// AnimBlueprintGeneratedClass ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C
// Size: 0x3460 (Inherited: 0x280)
struct UABP_ch0500_Sub_Physics_C : URSPlayerSubAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x288(0x78)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_21; // 0x300(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_20; // 0x540(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_19; // 0x780(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_18; // 0x9c0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_17; // 0xc00(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_16; // 0xe40(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_15; // 0x1080(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_14; // 0x12c0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_13; // 0x1500(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_12; // 0x1740(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_11; // 0x1980(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_10; // 0x1bc0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_9; // 0x1e00(0x240)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2040(0x30)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_8; // 0x2070(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_7; // 0x22b0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_6; // 0x24f0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_5; // 0x2730(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_4; // 0x2970(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_3; // 0x2bb0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2; // 0x2df0(0x240)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3030(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3050(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3070(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x3128(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3150(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3178(0xa0)
	char pad_3218[0x8]; // 0x3218(0x08)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x3220(0x240)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink AnimGraph); // Function ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_910E23564FD49834F4FC06BCBBC44EBC(); // Function ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_910E23564FD49834F4FC06BCBBC44EBC // (BlueprintEvent) // @ game+0x1685580
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_3FCBFA8D499D6C072D4E8D9358D11729(); // Function ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_3FCBFA8D499D6C072D4E8D9358D11729 // (BlueprintEvent) // @ game+0x1685580
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_F0E614BD4284A5D1796814A08F945E7F(); // Function ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_F0E614BD4284A5D1796814A08F945E7F // (BlueprintEvent) // @ game+0x1685580
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_091A4B9D47B8FA5E1278AA83E8C6D131(); // Function ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_091A4B9D47B8FA5E1278AA83E8C6D131 // (BlueprintEvent) // @ game+0x1685580
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_923F5963443D1DEA4B546C9D9262FF09(); // Function ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ch0500_Sub_Physics_AnimGraphNode_KawaiiPhysics_923F5963443D1DEA4B546C9D9262FF09 // (BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_ABP_ch0500_Sub_Physics(int32_t EntryPoint); // Function ABP_ch0500_Sub_Physics.ABP_ch0500_Sub_Physics_C.ExecuteUbergraph_ABP_ch0500_Sub_Physics // (Final|UbergraphFunction) // @ game+0x1685580
};

