// AnimBlueprintGeneratedClass ABP_wp0400.ABP_wp0400_C
// Size: 0x1ca8 (Inherited: 0x590)
struct UABP_wp0400_C : UWp0400AnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x590(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x598(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22; // 0x5c8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x6d0(0x20)
	struct FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x6f0(0x10)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x700(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x808(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0x910(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0xa18(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0xb20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0xc28(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0xd30(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0xe38(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0xf40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x1048(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x1150(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x1258(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x1360(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x1468(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x1570(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1678(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1780(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x1888(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x1990(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1a98(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1ba0(0x108)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_wp0400.ABP_wp0400_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_ABP_wp0400(int32_t EntryPoint); // Function ABP_wp0400.ABP_wp0400_C.ExecuteUbergraph_ABP_wp0400 // (Final|UbergraphFunction) // @ game+0x1685580
};

