// AnimBlueprintGeneratedClass ABP_ch0100.ABP_ch0100_C
// Size: 0x2d5d (Inherited: 0x820)
struct UABP_ch0100_C : URSPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x820(0x08)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x828(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x870(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x928(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x950(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x978(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xa38(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xaf0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0xb90(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0xc50(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0xc98(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0xda0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0xea8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0xfb0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0xfd0(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x10d8(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x1198(0x48)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x11e0(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x13c0(0x1e0)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x15a0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x15e8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x16a8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1760(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x1788(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x17b0(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x17d0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1818(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x18d8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1990(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x19b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x19e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1a08(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x1a30(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1a78(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1b38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1b60(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1b88(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1c40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1c68(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1c90(0xe0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1d70(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1e30(0xe0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1f10(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1f38(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1fd8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2020(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2048(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2090(0xc0)
	bool __CustomProperty_bKawaiiPhysics_89B8E5084F979CBEC401D8A90985D7EF; // 0x2150(0x01)
	char pad_2151[0x3]; // 0x2151(0x03)
	float __CustomProperty_PhysicsIdlingSec_89B8E5084F979CBEC401D8A90985D7EF; // 0x2154(0x04)
	float __CustomProperty_PhysicsAlpha_89B8E5084F979CBEC401D8A90985D7EF; // 0x2158(0x04)
	char pad_215C[0x4]; // 0x215c(0x04)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x2160(0xa0)
	struct FASAnimNode_StateMachine ASAnimGraphNode_StateMachine; // 0x2200(0x2b8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x24b8(0x108)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x25c0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x25f0(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x26f8(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x27b0(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2850(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2870(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2890(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x28b8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x28d8(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2900(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2920(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2a28(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2a48(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2b50(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2c58(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2c78(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2d18(0x28)
	struct ARSBattlePlayer_C* PlayerBP; // 0x2d40(0x08)
	float WeaponEmissive; // 0x2d48(0x04)
	bool bEventFlag; // 0x2d4c(0x01)
	char pad_2D4D[0x3]; // 0x2d4d(0x03)
	struct FVector WeaponStringScale; // 0x2d50(0x0c)
	bool bPsychicWait; // 0x2d5c(0x01)

	void BeginEvent(bool bDummy); // Function ABP_ch0100.ABP_ch0100_C.BeginEvent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EndEvent(bool bDummy); // Function ABP_ch0100.ABP_ch0100_C.EndEvent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_ch0100.ABP_ch0100_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateWeaponEmissive(); // Function ABP_ch0100.ABP_ch0100_C.UpdateWeaponEmissive // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_ch0100.ABP_ch0100_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void BlueprintInitializeAnimation(); // Function ABP_ch0100.ABP_ch0100_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void DispWeaponString(bool bDisp); // Function ABP_ch0100.ABP_ch0100_C.DispWeaponString // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_ABP_ch0100(int32_t EntryPoint); // Function ABP_ch0100.ABP_ch0100_C.ExecuteUbergraph_ABP_ch0100 // (Final|UbergraphFunction) // @ game+0x1685580
};

