// AnimBlueprintGeneratedClass ABP_ch0800_Sub_Physics.ABP_ch0800_Sub_Physics_C
// Size: 0x4420 (Inherited: 0x280)
struct UABP_ch0800_Sub_Physics_C : URSPlayerSubAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	struct FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x288(0x78)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x300(0x30)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_28; // 0x330(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_27; // 0x570(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_26; // 0x7b0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_25; // 0x9f0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_24; // 0xc30(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_23; // 0xe70(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_22; // 0x10b0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_21; // 0x12f0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_20; // 0x1530(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_19; // 0x1770(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_18; // 0x19b0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_17; // 0x1bf0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_16; // 0x1e30(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_15; // 0x2070(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_14; // 0x22b0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_13; // 0x24f0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_12; // 0x2730(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_11; // 0x2970(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_10; // 0x2bb0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_9; // 0x2df0(0x240)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3030(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3050(0x20)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_8; // 0x3070(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_7; // 0x32b0(0x240)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x34f0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x35a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x35d0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x35f8(0xa0)
	char pad_3698[0x8]; // 0x3698(0x08)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_6; // 0x36a0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_5; // 0x38e0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_4; // 0x3b20(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_3; // 0x3d60(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2; // 0x3fa0(0x240)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x41e0(0x240)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink AnimGraph); // Function ABP_ch0800_Sub_Physics.ABP_ch0800_Sub_Physics_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_ABP_ch0800_Sub_Physics(int32_t EntryPoint); // Function ABP_ch0800_Sub_Physics.ABP_ch0800_Sub_Physics_C.ExecuteUbergraph_ABP_ch0800_Sub_Physics // (Final|UbergraphFunction) // @ game+0x1685580
};

