// AnimBlueprintGeneratedClass ABP_ch0200.ABP_ch0200_C
// Size: 0x2c06 (Inherited: 0x820)
struct UABP_ch0200_C : URSPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x820(0x08)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x828(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x870(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x928(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x9e8(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0xa30(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0xb38(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0xc40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xd48(0x108)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0xe50(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x1030(0x1e0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1210(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x1230(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x1258(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x1280(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1340(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x13f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x1420(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1448(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x1500(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x15c0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1608(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x16c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x16e8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x1710(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1758(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1818(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1840(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1868(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1890(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x18b8(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1900(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x19c0(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x1a80(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1ac8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1b68(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x1c20(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1c68(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1d28(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1de0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1e08(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1e30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1e58(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1e80(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1f40(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2020(0xe0)
	bool __CustomProperty_bKawaiiPhysics_73487E064F89F4465CC3DB8C5A83437F; // 0x2100(0x01)
	char pad_2101[0x3]; // 0x2101(0x03)
	float __CustomProperty_PhysicsIdlingSec_73487E064F89F4465CC3DB8C5A83437F; // 0x2104(0x04)
	float __CustomProperty_PhysicsAlpha_73487E064F89F4465CC3DB8C5A83437F; // 0x2108(0x04)
	char pad_210C[0x4]; // 0x210c(0x04)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x2110(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x21b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x21d0(0x20)
	struct FASAnimNode_StateMachine ASAnimGraphNode_StateMachine; // 0x21f0(0x2b8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x24a8(0x108)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x25b0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x25e0(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x26e8(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2788(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x27a8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2860(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2888(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x28b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x28d0(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x28f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2918(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2940(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x29e0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2a28(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2a70(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2b30(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2bd0(0x28)
	struct ARSBattlePlayer_C* PlayerBP; // 0x2bf8(0x08)
	float WeaponEmissive; // 0x2c00(0x04)
	bool bEventFlag; // 0x2c04(0x01)
	bool bPsychicWait; // 0x2c05(0x01)

	void BeginEvent(bool bDummy); // Function ABP_ch0200.ABP_ch0200_C.BeginEvent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EndEvent(bool bDummy); // Function ABP_ch0200.ABP_ch0200_C.EndEvent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_ch0200.ABP_ch0200_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateWeaponEmissive(); // Function ABP_ch0200.ABP_ch0200_C.UpdateWeaponEmissive // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_ch0200.ABP_ch0200_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void BlueprintInitializeAnimation(); // Function ABP_ch0200.ABP_ch0200_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_ABP_ch0200(int32_t EntryPoint); // Function ABP_ch0200.ABP_ch0200_C.ExecuteUbergraph_ABP_ch0200 // (Final|UbergraphFunction) // @ game+0x1685580
};

