// UserDefinedStruct AiParamEnemy.AiParamEnemy
// Size: 0x9c (Inherited: 0x00)
struct FAiParamEnemy {
	enum class EEnemyThinkActionType ThinkActionType_275_4D91E8174221C8D681B73A9BA48F76F8; // 0x00(0x01)
	bool NeedRay_280_4BB263E74DD43BF25E4DBFA8C418D48E; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	float Probability_196_FDEA211941BB44CF66D073867B4BBE0C; // 0x04(0x04)
	float Probability2_245_F5B646AD49AC2D7332311AB8D1DFFBB9; // 0x08(0x04)
	float Range_197_BD510F8A49F3A560E6DAEDA6933A3FDA; // 0x0c(0x04)
	float NoRange_242_8B638B8E437600F0461B32AA0A1E6E94; // 0x10(0x04)
	float Angle_198_3C6DE6EA4363370F4B1D6F9019B3FAC1; // 0x14(0x04)
	float NoAngle_250_F2864EB44E6219E7878FC88200106888; // 0x18(0x04)
	float CoolTime_199_B401FCBC4824FA7805FE69A54E625875; // 0x1c(0x04)
	float SpeedScale_205_5E9E1ACA442720C5FC477EB7C1FF6B60; // 0x20(0x04)
	float Hp_227_10D9C5FC44129D78AF1F16BB77E917AC; // 0x24(0x04)
	float Time_228_BE5850A649DE740B847A93900D0EF774; // 0x28(0x04)
	float Value_218_FA982003417ABC11B0C9FCBB2D3BBD7B; // 0x2c(0x04)
	float Another_Probability1_233_0695897E4D929F08C3819F979636A6E0; // 0x30(0x04)
	float Another_Probability2_234_5BB909D14BB1EF2F0BDB14882F1840A2; // 0x34(0x04)
	float Another_Probability3_235_F020FA144AE0FDCBC4F1719FF4A82222; // 0x38(0x04)
	float Another_Probability4_255_3D67FC9348C8250625C8F08FCBBA33A7; // 0x3c(0x04)
	float Another_Probability5_256_D8A7AE704291F69A7BD80C8424BB50AB; // 0x40(0x04)
	float Another_Value1_236_C90183804405C69A8D2174A2A8908B20; // 0x44(0x04)
	float Another_Value2_237_3D70DA9441AC06A273A803BF84E6B454; // 0x48(0x04)
	float Another_Value3_238_B1EC20F8493135EE19969787AB2EF32D; // 0x4c(0x04)
	struct TArray<float> NextProbabilities_261_6495029C428431A5D441EA8E72A24A9E; // 0x50(0x10)
	struct TArray<float> NextValues0_264_2FE7A80F4069A2F586D447B99A1A91C7; // 0x60(0x10)
	struct TArray<float> NextValues1_266_1F731B984F462A393B9EBE8556F6A76E; // 0x70(0x10)
	bool IsBerserk_247_71DD46824898E9CAE3B6FDA368A60E07; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct TArray<char> UniqueConditions_271_91EC03D7483A0D148666829F0348383F; // 0x88(0x10)
	bool IgnoreOutOfScreen_285_5E1023D34CF35BCC04FD0EA726654249; // 0x98(0x01)
	bool IgnoreRestrictAttackOther_284_486E39144425F7313B7378BBD9B3CA57; // 0x99(0x01)
	bool NotAddAttackingList_289_D220180A49DAE69BB36174A5ADFA0069; // 0x9a(0x01)
	bool NotBrainField_291_36464B3D405BCF79828B0BB18E6C2963; // 0x9b(0x01)
};

