// UserDefinedStruct AttackCollisionInfoBP.AttackCollisionInfoBP
// Size: 0xc0 (Inherited: 0x00)
struct FAttackCollisionInfoBP {
	struct FName RootSocketName_24_3EEEE927414150D25963009A398E0207; // 0x00(0x08)
	struct FName TopSocketName_26_DB742762423CF879CFC380B969332A1F; // 0x08(0x08)
	float Radius_9_589248E74C0804A5312CCAAAFF97D109; // 0x10(0x04)
	float RootOffset_57_D72D38194D55C7F8C822C5B4CCE42E44; // 0x14(0x04)
	float TopOffset_59_010C8A794FE03130163194B023E0CBD3; // 0x18(0x04)
	float LimitHeight_76_5A8C44C642F2E3F807E7C7BB5C513D82; // 0x1c(0x04)
	struct FCollisionCommonInfoBP Common_45_33AB12FB401DEFC93743E28B03FE3EF9; // 0x20(0x78)
	struct UDataTable* SkillTable_62_E5EA266A4AFE8A57BD33F1B85C035BC0; // 0x98(0x08)
	struct FName SkillName_54_907CE78A4CEAD15A5637449C84958305; // 0xa0(0x08)
	float EffectiveRangeMin_68_1C84328549F6518703FBDD8FEC2035A3; // 0xa8(0x04)
	float EffectiveRangeMax_70_D394897A404B8485F2FFC1854DA2BBE5; // 0xac(0x04)
	struct FName OutEffectiveRangeSkillName_73_DD13176146FF7894347B0A89294BA21F; // 0xb0(0x08)
	struct FHCHitEffectInfo EffectInfo_65_5701B8F34D5327BE8835258ABCBF1BE4; // 0xb8(0x08)
};

