// Class BattlePrototype.BP_SM_MapModel_Base
// Size: 0x2e8 (Inherited: 0x240)
struct ABP_SM_MapModel_Base : AStaticMeshActor {
	bool isDetaileMap; // 0x240(0x01)
	bool isScale; // 0x241(0x01)
	char pad_242[0x2]; // 0x242(0x02)
	float playerrate; // 0x244(0x04)
	float MinimapGradationValue; // 0x248(0x04)
	float MapIconScaleRate; // 0x24c(0x04)
	float MapIconDetail_ZOffset; // 0x250(0x04)
	float MinimapOnlyIconGradationValue; // 0x254(0x04)
	bool MinimapOnlyIconGradationValueFlag; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)
	struct UMaterialInstanceDynamic* m_MaterialDynamicMinimap; // 0x260(0x08)
	struct UMaterialInstanceDynamic* m_MaterialDynamicDetail; // 0x268(0x08)
	struct TArray<struct UStaticMeshComponent*> m_SubMapData; // 0x270(0x10)
	char pad_280[0x8]; // 0x280(0x08)
	struct TArray<struct FUIMapFloorAdjustData> PGAdjuster; // 0x288(0x10)
	bool m_pgAdjusterFlag; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	struct TArray<float> PgHeightData; // 0x2a0(0x10)
	bool m_pgIconHeightFlag; // 0x2b0(0x01)
	bool m_isCenterOffsetProc; // 0x2b1(0x01)
	char pad_2B2[0x6]; // 0x2b2(0x06)
	struct TArray<struct FUIDetaileMapSubAreaCenterPosition> m_AreaCenterPos; // 0x2b8(0x10)
	bool m_FloorWidthDataCheck; // 0x2c8(0x01)
	char pad_2C9[0x3]; // 0x2c9(0x03)
	int32_t m_FloorWidthIndex; // 0x2cc(0x04)
	struct TArray<float> m_FloorWidthData; // 0x2d0(0x10)
	char pad_2E0[0x8]; // 0x2e0(0x08)

	void SetSubModelVisible(struct FName SubName, bool Flag); // Function BattlePrototype.BP_SM_MapModel_Base.SetSubModelVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x1166610
	void SetScale(bool Scale); // Function BattlePrototype.BP_SM_MapModel_Base.SetScale // (Final|Native|Public|BlueprintCallable) // @ game+0x1166560
	void SetPlayerRate(float playerrate); // Function BattlePrototype.BP_SM_MapModel_Base.SetPlayerRate // (Final|Native|Public|BlueprintCallable) // @ game+0x1166460
	void SetPersSwitch(bool pers); // Function BattlePrototype.BP_SM_MapModel_Base.SetPersSwitch // (Final|Native|Public|BlueprintCallable) // @ game+0x11663e0
	void SetGradationValue(float Gradation); // Function BattlePrototype.BP_SM_MapModel_Base.SetGradationValue // (Final|Native|Public|BlueprintCallable) // @ game+0x11661d0
	void SetFloorPGAdjuster(struct TArray<struct FUIMapFloorAdjustData> Update); // Function BattlePrototype.BP_SM_MapModel_Base.SetFloorPGAdjuster // (Final|Native|Public|BlueprintCallable) // @ game+0x1166090
	void SetFloorIndextoGame(int32_t floorindex); // Function BattlePrototype.BP_SM_MapModel_Base.SetFloorIndextoGame // (Final|Native|Public|BlueprintCallable) // @ game+0x1166010
	bool SetFloorIndex(int32_t floorindex); // Function BattlePrototype.BP_SM_MapModel_Base.SetFloorIndex // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetDetaileMap(bool detaileMap); // Function BattlePrototype.BP_SM_MapModel_Base.SetDetaileMap // (Final|Native|Public|BlueprintCallable) // @ game+0x1165f80
	void SetBrainField(bool Flag); // Function BattlePrototype.BP_SM_MapModel_Base.SetBrainField // (Final|Native|Public|BlueprintCallable) // @ game+0x1165c50
	bool MaterialUpdate(); // Function BattlePrototype.BP_SM_MapModel_Base.MaterialUpdate // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool isPgIconHeightFlag(); // Function BattlePrototype.BP_SM_MapModel_Base.isPgIconHeightFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1166da0
	bool isMinimapOnlyIconGradationValue(); // Function BattlePrototype.BP_SM_MapModel_Base.isMinimapOnlyIconGradationValue // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1166d80
	bool isCenterOffsetProc(); // Function BattlePrototype.BP_SM_MapModel_Base.isCenterOffsetProc // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1166c00
	bool IsBrainField(); // Function BattlePrototype.BP_SM_MapModel_Base.IsBrainField // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1166bc0
	bool isAdjusterFlag(); // Function BattlePrototype.BP_SM_MapModel_Base.isAdjusterFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1166ba0
	float GetZoomMin(); // Function BattlePrototype.BP_SM_MapModel_Base.GetZoomMin // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	float GetZoomMax(); // Function BattlePrototype.BP_SM_MapModel_Base.GetZoomMax // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	struct TArray<float> GetPgIconHeightFlag(); // Function BattlePrototype.BP_SM_MapModel_Base.GetPgIconHeightFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1164be0
	float GetMinimapOnlyIconGradationValue(); // Function BattlePrototype.BP_SM_MapModel_Base.GetMinimapOnlyIconGradationValue // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1164bc0
	float GetMinimapGradationValue(); // Function BattlePrototype.BP_SM_MapModel_Base.GetMinimapGradationValue // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1164ba0
	float GetMapIconScaleRate(); // Function BattlePrototype.BP_SM_MapModel_Base.GetMapIconScaleRate // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1164b80
	float GetMapIconDetail_ZOffset(); // Function BattlePrototype.BP_SM_MapModel_Base.GetMapIconDetail_ZOffset // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1164b60
	struct TArray<struct FUIMapFloorAdjustData> GetFloorPGAdjuster(); // Function BattlePrototype.BP_SM_MapModel_Base.GetFloorPGAdjuster // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1164820
	int32_t GetFloorIndextoGameWidthNum(); // Function BattlePrototype.BP_SM_MapModel_Base.GetFloorIndextoGameWidthNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1164800
	bool GetFloorIndextoGameWidthFlag(); // Function BattlePrototype.BP_SM_MapModel_Base.GetFloorIndextoGameWidthFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x11647e0
	float GetFloorIndextoGameWidthData(int32_t floorindex); // Function BattlePrototype.BP_SM_MapModel_Base.GetFloorIndextoGameWidthData // (Final|Native|Public|BlueprintCallable) // @ game+0x1164750
	int32_t GetFloorIndextoGameWidth(); // Function BattlePrototype.BP_SM_MapModel_Base.GetFloorIndextoGameWidth // (Final|Native|Public|BlueprintCallable) // @ game+0x1164730
	struct TArray<struct FUIDetaileMapFloorData> GetFloorData(); // Function BattlePrototype.BP_SM_MapModel_Base.GetFloorData // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	float GetDirectionRotate(); // Function BattlePrototype.BP_SM_MapModel_Base.GetDirectionRotate // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	struct UCapsuleComponent* GetCollisitonData(); // Function BattlePrototype.BP_SM_MapModel_Base.GetCollisitonData // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct TArray<struct FUIDetaileMapSubAreaCenterPosition> GetAreaCenterPosArray(); // Function BattlePrototype.BP_SM_MapModel_Base.GetAreaCenterPosArray // (Final|Native|Public|BlueprintCallable) // @ game+0x1164370
	struct FVector GetAreaCenterPos(); // Function BattlePrototype.BP_SM_MapModel_Base.GetAreaCenterPos // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1164330
	void CalcMaterialUpDateParam(float RateHeight, float Width); // Function BattlePrototype.BP_SM_MapModel_Base.CalcMaterialUpDateParam // (Final|Native|Public|BlueprintCallable) // @ game+0x1164100
};

// Class BattlePrototype.BP_UI_SceneMap
// Size: 0x520 (Inherited: 0x230)
struct ABP_UI_SceneMap : AActor {
	struct FVector ObjectIconScale; // 0x230(0x0c)
	bool DebugCameraPers; // 0x23c(0x01)
	char pad_23D[0x3]; // 0x23d(0x03)
	struct FVector ViewModeCameraLocation; // 0x240(0x0c)
	struct FVector ViewModeViewLocation; // 0x24c(0x0c)
	float ViewModeZoom; // 0x258(0x04)
	float MapGradationValue; // 0x25c(0x04)
	float MapHeightValue; // 0x260(0x04)
	float m_FootPrintSpanNormal; // 0x264(0x04)
	float m_FootPrintSpanExtent; // 0x268(0x04)
	float m_FootPrintSpanMax; // 0x26c(0x04)
	bool m_FootPrintStop; // 0x270(0x01)
	char pad_271[0x3]; // 0x271(0x03)
	float m_CameraHeight; // 0x274(0x04)
	float m_CameraOrthoWidth; // 0x278(0x04)
	float m_CameraRotatePitch; // 0x27c(0x04)
	float m_RotateCamera; // 0x280(0x04)
	float m_CameraRoll; // 0x284(0x04)
	float m_CameraRollBase; // 0x288(0x04)
	bool isScaleFlag; // 0x28c(0x01)
	bool isCameraRotateFlag; // 0x28d(0x01)
	bool IsDetailMap; // 0x28e(0x01)
	bool m_IsPerspective; // 0x28f(0x01)
	int32_t m_AreaMax; // 0x290(0x04)
	int32_t m_FloorMax; // 0x294(0x04)
	int32_t m_CurrentFloor; // 0x298(0x04)
	int32_t m_CurrentArea; // 0x29c(0x04)
	int32_t m_CurrentLevel; // 0x2a0(0x04)
	int32_t CurrentFloorPlayer; // 0x2a4(0x04)
	int32_t CurrentAreaPlayer; // 0x2a8(0x04)
	int32_t CurrentFloorMain; // 0x2ac(0x04)
	int32_t CurrentFloorSub; // 0x2b0(0x04)
	int32_t CurrentFloorBonds; // 0x2b4(0x04)
	int32_t m_CurrentIndex; // 0x2b8(0x04)
	int32_t m_ChapterNo; // 0x2bc(0x04)
	int32_t m_ProgressNo; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct TArray<struct FUIDetaileMapFloorData> m_FloorData; // 0x2c8(0x10)
	struct FDelegate m_OnMinimapChangeFloor; // 0x2d8(0x10)
	struct TArray<struct UMaterialInterface*> m_MaterialIconArray; // 0x2e8(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> m_MaterialDynamicIconArray; // 0x2f8(0x10)
	float m_minimapDistanceSquareEnemy; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)
	struct ABP_SM_MapModel_Base* m_SM_MapModel_Base; // 0x310(0x08)
	struct TArray<struct UStaticMeshComponent*> m_MeshList; // 0x318(0x10)
	struct FUIDetaileMapCheckData m_DetailMapData; // 0x328(0x28)
	char pad_350[0x30]; // 0x350(0x30)
	struct AActor* m_AsyncLineActor; // 0x380(0x08)
	char pad_388[0xc0]; // 0x388(0xc0)
	struct URSGameInstance* Instance; // 0x448(0x08)
	struct AEnemyManager* EnemyManager; // 0x450(0x08)
	struct APlayerCameraManager* CameraManager; // 0x458(0x08)
	struct AEventManager* EventManager; // 0x460(0x08)
	struct USceneCaptureComponent2D* CaptureCamera; // 0x468(0x08)
	struct APawn* m_player; // 0x470(0x08)
	struct UInstancedStaticMeshComponent* ObjectInstancedMesh; // 0x478(0x08)
	struct UInstancedStaticMeshComponent* NpcPlInstancedMesh; // 0x480(0x08)
	struct UInstancedStaticMeshComponent* EnemyInstancedMeshNormal; // 0x488(0x08)
	struct UInstancedStaticMeshComponent* EnemyInstancedMesh0630; // 0x490(0x08)
	struct UInstancedStaticMeshComponent* FootInstancedMesh; // 0x498(0x08)
	struct UInstancedStaticMeshComponent* MainQuestInstancedMesh; // 0x4a0(0x08)
	struct UInstancedStaticMeshComponent* SubQuestActiveInstancedMesh; // 0x4a8(0x08)
	struct UInstancedStaticMeshComponent* SubQuestCompActiveInstancedMesh; // 0x4b0(0x08)
	struct UInstancedStaticMeshComponent* BoudsQuestInstancedMesh; // 0x4b8(0x08)
	struct APsychicObjectManager* PsychicObjectManager; // 0x4c0(0x08)
	struct APlayerManager* PlayerManager; // 0x4c8(0x08)
	struct TArray<struct TWeakObjectPtr<struct ARSCharacterBase>> PlayerCharacterList; // 0x4d0(0x10)
	struct TArray<struct ARSCharacterBase*> m_EnemyList; // 0x4e0(0x10)
	struct TArray<struct FTransform> m_PlPosDataListNormal; // 0x4f0(0x10)
	struct TArray<struct FTransform> m_PlPosDataListExtent; // 0x500(0x10)
	struct ARSHUDBase* m_pHudBase; // 0x510(0x08)
	char pad_518[0x8]; // 0x518(0x08)

	void UpdateMinimapCalc(); // Function BattlePrototype.BP_UI_SceneMap.UpdateMinimapCalc // (Final|Native|Public|BlueprintCallable) // @ game+0x11668c0
	void UpdateMaterialCalc(float Rate, bool Update); // Function BattlePrototype.BP_UI_SceneMap.UpdateMaterialCalc // (Final|Native|Public|BlueprintCallable) // @ game+0x11667f0
	void UpdateDetailmapCalc(); // Function BattlePrototype.BP_UI_SceneMap.UpdateDetailmapCalc // (Final|Native|Public|BlueprintCallable) // @ game+0x11667d0
	void StartMinimapBrainField(); // Function BattlePrototype.BP_UI_SceneMap.StartMinimapBrainField // (Final|Native|Public|BlueprintCallable) // @ game+0x11667b0
	bool Start(); // Function BattlePrototype.BP_UI_SceneMap.Start // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void SetWantsTraceRequest(struct AActor* Actor, bool Flag); // Function BattlePrototype.BP_UI_SceneMap.SetWantsTraceRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x11666e0
	void SetSubModel(); // Function BattlePrototype.BP_UI_SceneMap.SetSubModel // (Final|Native|Public|BlueprintCallable) // @ game+0x11665f0
	void SetProgressNo(int32_t Progress); // Function BattlePrototype.BP_UI_SceneMap.SetProgressNo // (Final|Native|Public|BlueprintCallable) // @ game+0x11664e0
	void SetMapHeight(float Height); // Function BattlePrototype.BP_UI_SceneMap.SetMapHeight // (Final|Native|Public|BlueprintCallable) // @ game+0x1166360
	void SetMapGradation(float Gradation); // Function BattlePrototype.BP_UI_SceneMap.SetMapGradation // (Final|Native|Public|BlueprintCallable) // @ game+0x11662e0
	void SetIconUpdateFlag(bool Flag); // Function BattlePrototype.BP_UI_SceneMap.SetIconUpdateFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x1166250
	void SetDetailMapData(struct FUIDetaileMapCheckData Data, int32_t initareano); // Function BattlePrototype.BP_UI_SceneMap.SetDetailMapData // (Final|Native|Public|BlueprintCallable) // @ game+0x1165e50
	void SetCurrentIndex(int32_t Index); // Function BattlePrototype.BP_UI_SceneMap.SetCurrentIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x1165dd0
	void SetChapterNoIndex(int32_t no); // Function BattlePrototype.BP_UI_SceneMap.SetChapterNoIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x1165d50
	void SetBrainField(bool Flag); // Function BattlePrototype.BP_UI_SceneMap.SetBrainField // (Final|Native|Public|BlueprintCallable) // @ game+0x1165cd0
	void SceneCaptureCameraInit(struct USceneCaptureComponent2D* pCamera); // Function BattlePrototype.BP_UI_SceneMap.SceneCaptureCameraInit // (Final|Native|Public|BlueprintCallable) // @ game+0x1165bd0
	bool QuestIconInit_Native(); // Function BattlePrototype.BP_UI_SceneMap.QuestIconInit_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PsychicObjUpdate(); // Function BattlePrototype.BP_UI_SceneMap.PsychicObjUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x8518d0
	void PsychicObjInit(struct UInstancedStaticMeshComponent* InstancedMesh, float Square); // Function BattlePrototype.BP_UI_SceneMap.PsychicObjInit // (Final|Native|Public|BlueprintCallable) // @ game+0x1165b00
	void PlayerFootIconUpdate(); // Function BattlePrototype.BP_UI_SceneMap.PlayerFootIconUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x1165ae0
	void PlayerFootIconInit(struct UInstancedStaticMeshComponent* InstancedMesh); // Function BattlePrototype.BP_UI_SceneMap.PlayerFootIconInit // (Final|Native|Public|BlueprintCallable) // @ game+0x1165a60
	void OnEnemyListUpdate(); // Function BattlePrototype.BP_UI_SceneMap.OnEnemyListUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x1165a40
	void NpcPlayerUpdate(); // Function BattlePrototype.BP_UI_SceneMap.NpcPlayerUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x1165a20
	void NpcPlayerInit(struct UInstancedStaticMeshComponent* InstancedMesh); // Function BattlePrototype.BP_UI_SceneMap.NpcPlayerInit // (Final|Native|Public|BlueprintCallable) // @ game+0x11659a0
	bool isCheckProg(struct FUIDetaileMapCheckCoreData Data); // Function BattlePrototype.BP_UI_SceneMap.isCheckProg // (Final|Native|Public|BlueprintCallable) // @ game+0x1166cd0
	bool isCheckFlag(struct FUIDetaileMapCheckCoreData Data); // Function BattlePrototype.BP_UI_SceneMap.isCheckFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x1166c20
	bool IsBrainField(); // Function BattlePrototype.BP_UI_SceneMap.IsBrainField // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1166be0
	bool IsAysncLocation(); // Function BattlePrototype.BP_UI_SceneMap.IsAysncLocation // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x1164fc0
	bool isActorTick(); // Function BattlePrototype.BP_UI_SceneMap.isActorTick // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void InstanceObjInit(struct UInstancedStaticMeshComponent* mainquest, struct UInstancedStaticMeshComponent* subquestActive, struct UInstancedStaticMeshComponent* subquestCompActive, struct UInstancedStaticMeshComponent* boudsquest); // Function BattlePrototype.BP_UI_SceneMap.InstanceObjInit // (Final|Native|Public|BlueprintCallable) // @ game+0x1164e70
	void InitializePlayerFootIconArray(); // Function BattlePrototype.BP_UI_SceneMap.InitializePlayerFootIconArray // (Final|Native|Public|BlueprintCallable) // @ game+0x1164e50
	void InitializeMaterialNative(); // Function BattlePrototype.BP_UI_SceneMap.InitializeMaterialNative // (Final|Native|Public|BlueprintCallable) // @ game+0x1164e30
	struct ASceneManager* GetSceneManager(); // Function BattlePrototype.BP_UI_SceneMap.GetSceneManager // (Final|Native|Public|BlueprintCallable) // @ game+0x1164e00
	float GetRotateCamera(); // Function BattlePrototype.BP_UI_SceneMap.GetRotateCamera // (Final|Native|Public|BlueprintCallable) // @ game+0x1164de0
	float GetRateData(struct FVector inputpos); // Function BattlePrototype.BP_UI_SceneMap.GetRateData // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1164d40
	enum class QuestProgressState GetQuestInfoState(struct FName questId); // Function BattlePrototype.BP_UI_SceneMap.GetQuestInfoState // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1164ca0
	struct TArray<struct ANpcTownPeople*> getMinimapNpcList(); // Function BattlePrototype.BP_UI_SceneMap.getMinimapNpcList // (Final|Native|Public|BlueprintCallable) // @ game+0x1166b20
	struct AStaticMeshActor* getMeshClassRefalence(struct FString Path); // Function BattlePrototype.BP_UI_SceneMap.getMeshClassRefalence // (Final|Native|Protected|BlueprintCallable) // @ game+0x1166a30
	struct UMaterialInstanceDynamic* getMaterialInstanceNative(enum class EUIMapIconNative iconTypeNatice); // Function BattlePrototype.BP_UI_SceneMap.getMaterialInstanceNative // (Final|Native|Public|BlueprintCallable) // @ game+0x11669a0
	struct FVector GetLineTraceActorLocation(); // Function BattlePrototype.BP_UI_SceneMap.GetLineTraceActorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1164b30
	struct UInstancedStaticMeshComponent* GetInstanceMeshSubQuestCompActive(); // Function BattlePrototype.BP_UI_SceneMap.GetInstanceMeshSubQuestCompActive // (Final|Native|Public|BlueprintCallable) // @ game+0x1164b10
	struct UInstancedStaticMeshComponent* GetInstanceMeshSubQuestActive(); // Function BattlePrototype.BP_UI_SceneMap.GetInstanceMeshSubQuestActive // (Final|Native|Public|BlueprintCallable) // @ game+0x1164af0
	struct UInstancedStaticMeshComponent* GetInstanceMeshMainQuest(); // Function BattlePrototype.BP_UI_SceneMap.GetInstanceMeshMainQuest // (Final|Native|Public|BlueprintCallable) // @ game+0x1164ad0
	struct UInstancedStaticMeshComponent* GetInstanceMeshBondsQuest(); // Function BattlePrototype.BP_UI_SceneMap.GetInstanceMeshBondsQuest // (Final|Native|Public|BlueprintCallable) // @ game+0x1164ab0
	struct AActor* GetIconAdjustVector(struct AActor* ActorClass, struct FName findName); // Function BattlePrototype.BP_UI_SceneMap.GetIconAdjustVector // (Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	struct FName GetGimmickActorName(struct AActor* Actor); // Function BattlePrototype.BP_UI_SceneMap.GetGimmickActorName // (Final|Native|Public|BlueprintCallable) // @ game+0x1164a20
	int32_t GetFloorIndexCore2(float floorrate, bool detail); // Function BattlePrototype.BP_UI_SceneMap.GetFloorIndexCore2 // (Final|Native|Public|BlueprintCallable) // @ game+0x11645d0
	int32_t GetFloorIndexCore(float floorrate); // Function BattlePrototype.BP_UI_SceneMap.GetFloorIndexCore // (Final|Native|Public|BlueprintCallable) // @ game+0x11646a0
	struct AEventManager* GetEventManager(); // Function BattlePrototype.BP_UI_SceneMap.GetEventManager // (Final|Native|Public|BlueprintCallable) // @ game+0x11645a0
	int32_t GetCurrentFloorSub(); // Function BattlePrototype.BP_UI_SceneMap.GetCurrentFloorSub // (Final|Native|Public|BlueprintCallable) // @ game+0x1164580
	int32_t GetCurrentFloorPlayer(); // Function BattlePrototype.BP_UI_SceneMap.GetCurrentFloorPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x1164560
	int32_t GetCurrentFloorMain(); // Function BattlePrototype.BP_UI_SceneMap.GetCurrentFloorMain // (Final|Native|Public|BlueprintCallable) // @ game+0x1164540
	int32_t GetCurrentFloorBonds(); // Function BattlePrototype.BP_UI_SceneMap.GetCurrentFloorBonds // (Final|Native|Public|BlueprintCallable) // @ game+0x1164520
	int32_t GetCurrentAreaPlayer(); // Function BattlePrototype.BP_UI_SceneMap.GetCurrentAreaPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x1164500
	float GetCameraRollBase(); // Function BattlePrototype.BP_UI_SceneMap.GetCameraRollBase // (Final|Native|Public|BlueprintCallable) // @ game+0x11644e0
	float GetCameraRoll(); // Function BattlePrototype.BP_UI_SceneMap.GetCameraRoll // (Final|Native|Public|BlueprintCallable) // @ game+0x11644c0
	int32_t getAreaMax(struct FName AssetClass, struct FName AssetDataPath); // Function BattlePrototype.BP_UI_SceneMap.getAreaMax // (Final|Native|Public|BlueprintCallable) // @ game+0x11668e0
	void EnemyIconUpdate(); // Function BattlePrototype.BP_UI_SceneMap.EnemyIconUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x1164310
	void EnemyIconInit(struct UInstancedStaticMeshComponent* InstancedMeshNormal, struct UInstancedStaticMeshComponent* InstancedMesh0630, float Square); // Function BattlePrototype.BP_UI_SceneMap.EnemyIconInit // (Final|Native|Public|BlueprintCallable) // @ game+0x1164200
	void EndMinimapBrainField(); // Function BattlePrototype.BP_UI_SceneMap.EndMinimapBrainField // (Final|Native|Public|BlueprintCallable) // @ game+0x11641e0
	bool End(); // Function BattlePrototype.BP_UI_SceneMap.End // (Event|Public|BlueprintEvent) // @ game+0x1685580
	bool DebugUpdateIcon(); // Function BattlePrototype.BP_UI_SceneMap.DebugUpdateIcon // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void CameraUpdateMinimapPerspective(); // Function BattlePrototype.BP_UI_SceneMap.CameraUpdateMinimapPerspective // (Final|Native|Public|BlueprintCallable) // @ game+0x11641c0
	bool CameraSetPerspectiveNative(bool isperspective); // Function BattlePrototype.BP_UI_SceneMap.CameraSetPerspectiveNative // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	bool Camera_UpdateDetailMap(); // Function BattlePrototype.BP_UI_SceneMap.Camera_UpdateDetailMap // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct FVector CalcMapIconLocation(enum class EUIMapIconNative Type, struct FVector inputLocation, float addZ); // Function BattlePrototype.BP_UI_SceneMap.CalcMapIconLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1163fc0
	void BgModelLoadPreviousAreaNative(int32_t Area, int32_t Lc); // Function BattlePrototype.BP_UI_SceneMap.BgModelLoadPreviousAreaNative // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1163ee0
	void BgModelLoadNextAreaNative(int32_t Area, int32_t Lc); // Function BattlePrototype.BP_UI_SceneMap.BgModelLoadNextAreaNative // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1163e00
};

// Class BattlePrototype.UISceneMapFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UUISceneMapFunctionLibrary : UBlueprintFunctionLibrary {

	void MinimapIconGetElementListUse(struct UObject* WorldContextObject, int32_t Location, int32_t Area, int32_t valiation, struct TArray<struct UDataTable*> IconTables, enum class EUiSceneMapIconType Type, struct TArray<struct FUiSceneMapIconNode> resultList); // Function BattlePrototype.UISceneMapFunctionLibrary.MinimapIconGetElementListUse // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x11654e0
	void MinimapIconGetElementList_OtherArea(struct UObject* WorldContextObject, struct TArray<struct UDataTable*> IconTables, enum class EUiSceneMapIconType Type, struct TArray<struct FUiSceneMapIconNode> resultList, struct FName AreaName); // Function BattlePrototype.UISceneMapFunctionLibrary.MinimapIconGetElementList_OtherArea // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1165780
	void MinimapIconGetElementList(struct UObject* WorldContextObject, struct TArray<struct UDataTable*> IconTables, enum class EUiSceneMapIconType Type, struct TArray<struct FUiSceneMapIconNode> resultList); // Function BattlePrototype.UISceneMapFunctionLibrary.MinimapIconGetElementList // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1165300
	enum class EMapIconType MinimapIconGetArrangeIconType(struct UObject* WorldContextObject, struct TArray<struct UDataTable*> IconTables, struct FName pointName); // Function BattlePrototype.UISceneMapFunctionLibrary.MinimapIconGetArrangeIconType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11651b0
	void MinimapIconGetArrangeElementList(struct UObject* WorldContextObject, struct UDataTable* ArrangePointTable, int32_t LocationNo, int32_t AreaNo, enum class EMapIconType map_Icon_Type, struct TArray<struct FMapArrangeItemNode> resultList); // Function BattlePrototype.UISceneMapFunctionLibrary.MinimapIconGetArrangeElementList // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1164fe0
};

// Class BattlePrototype.DebuggingItemBase
// Size: 0x2c8 (Inherited: 0x230)
struct ADebuggingItemBase : AActor {
	int32_t Priority; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct FText HashName; // 0x238(0x18)
	struct FText dispName; // 0x250(0x18)
	struct FMulticastInlineDelegate OnInFocus; // 0x268(0x10)
	struct FMulticastInlineDelegate OnLostFocus; // 0x278(0x10)
	struct FMulticastInlineDelegate OnKeyLeft; // 0x288(0x10)
	struct FMulticastInlineDelegate OnKeyRight; // 0x298(0x10)
	struct FMulticastInlineDelegate OnKeySelect; // 0x2a8(0x10)
	char pad_2B8[0x10]; // 0x2b8(0x10)

	struct ADebuggingItemBase* SearchItem(struct FText InHashName, bool InRecursive, bool InIgnoreCase); // Function BattlePrototype.DebuggingItemBase.SearchItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11d2670
	void Dump(int32_t InIndent); // Function BattlePrototype.DebuggingItemBase.Dump // (Final|Native|Public|BlueprintCallable) // @ game+0x11b54f0
	void DestroyItem(bool DestroyChild); // Function BattlePrototype.DebuggingItemBase.DestroyItem // (Final|Native|Public|BlueprintCallable) // @ game+0x11b6870
	struct UWidget* CreateWidgetBP(); // Function BattlePrototype.DebuggingItemBase.CreateWidgetBP // (Event|Public|BlueprintEvent) // @ game+0x1685580
};

// Class BattlePrototype.DebuggingItemGroup
// Size: 0x2d0 (Inherited: 0x2c8)
struct ADebuggingItemGroup : ADebuggingItemBase {
	char pad_2C8[0x8]; // 0x2c8(0x08)

	void UnregisterChildFromItem(struct ADebuggingItemBase* InItem); // Function BattlePrototype.DebuggingItemGroup.UnregisterChildFromItem // (Native|Public|BlueprintCallable) // @ game+0x11d39f0
	void UnregisterChildFromHashName(struct FText InHashName); // Function BattlePrototype.DebuggingItemGroup.UnregisterChildFromHashName // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11d3810
	void RegisterChild(struct ADebuggingItemBase* InItem); // Function BattlePrototype.DebuggingItemGroup.RegisterChild // (Native|Public|BlueprintCallable) // @ game+0x11d2520
};

// Class BattlePrototype.DebuggingItemAchievementGroup
// Size: 0x308 (Inherited: 0x2d0)
struct ADebuggingItemAchievementGroup : ADebuggingItemGroup {
	char pad_2D0[0x4]; // 0x2d0(0x04)
	struct TWeakObjectPtr<struct ADebuggingItemStringArray> StringList; // 0x2d4(0x08)
	struct TWeakObjectPtr<struct ADebuggingItemLabel> Label; // 0x2dc(0x08)
	struct TWeakObjectPtr<struct ADebuggingItemEvent> Unlock; // 0x2e4(0x08)
	struct TWeakObjectPtr<struct ADebuggingItemEvent> Lock; // 0x2ec(0x08)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct TArray<int64_t> EnumValueList; // 0x2f8(0x10)

	void Update(); // Function BattlePrototype.DebuggingItemAchievementGroup.Update // (Final|Native|Public) // @ game+0x8518d0
	void OnExexUnlock(struct ADebuggingItemEvent* Item); // Function BattlePrototype.DebuggingItemAchievementGroup.OnExexUnlock // (Final|Native|Public) // @ game+0x79d490
	void OnExexLock(struct ADebuggingItemEvent* Item); // Function BattlePrototype.DebuggingItemAchievementGroup.OnExexLock // (Final|Native|Public) // @ game+0x79d490
	void OnChangeSelected(struct ADebuggingItemStringArray* Item); // Function BattlePrototype.DebuggingItemAchievementGroup.OnChangeSelected // (Final|Native|Public) // @ game+0x79d490
};

// Class BattlePrototype.DebuggingItemInt
// Size: 0x300 (Inherited: 0x2c8)
struct ADebuggingItemInt : ADebuggingItemBase {
	struct FMulticastInlineDelegate OnChanged; // 0x2c8(0x10)
	struct FMulticastInlineDelegate OnSliderSettingChanged; // 0x2d8(0x10)
	int32_t Min; // 0x2e8(0x04)
	int32_t Max; // 0x2ec(0x04)
	int32_t Step; // 0x2f0(0x04)
	int32_t Value; // 0x2f4(0x04)
	char pad_2F8[0x8]; // 0x2f8(0x08)

	void SetValue(int32_t InValue); // Function BattlePrototype.DebuggingItemInt.SetValue // (Final|Native|Public|BlueprintCallable) // @ game+0x11d3790
	void SetSliderSettings(int32_t InMin, int32_t InMax, int32_t InStep); // Function BattlePrototype.DebuggingItemInt.SetSliderSettings // (Final|Native|Public|BlueprintCallable) // @ game+0x11d33a0
	void OnKeyRightFunc(struct ADebuggingItemBase* InItem, bool IsRepeat, int32_t InSpeed); // Function BattlePrototype.DebuggingItemInt.OnKeyRightFunc // (Final|Native|Protected|BlueprintCallable) // @ game+0x11d2250
	void OnKeyLeftFunc(struct ADebuggingItemBase* InItem, bool IsRepeat, int32_t InSpeed); // Function BattlePrototype.DebuggingItemInt.OnKeyLeftFunc // (Final|Native|Protected|BlueprintCallable) // @ game+0x11d1e50
	int32_t GetValue(); // Function BattlePrototype.DebuggingItemInt.GetValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11d1880
};

// Class BattlePrototype.DebuggingItemInt2
// Size: 0x308 (Inherited: 0x300)
struct ADebuggingItemInt2 : ADebuggingItemInt {
	int32_t Index; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
};

// Class BattlePrototype.DebuggingItemBool
// Size: 0x2e8 (Inherited: 0x2c8)
struct ADebuggingItemBool : ADebuggingItemBase {
	struct FMulticastInlineDelegate OnChanged; // 0x2c8(0x10)
	bool Value; // 0x2d8(0x01)
	char pad_2D9[0xf]; // 0x2d9(0x0f)

	void SetValue(bool InValue); // Function BattlePrototype.DebuggingItemBool.SetValue // (Final|Native|Public|BlueprintCallable) // @ game+0x11d3680
	void OnKeySelectFunc(struct ADebuggingItemBase* InItem, bool IsRepeat); // Function BattlePrototype.DebuggingItemBool.OnKeySelectFunc // (Final|Native|Protected|BlueprintCallable) // @ game+0x11d2450
	bool GetValue(); // Function BattlePrototype.DebuggingItemBool.GetValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11d1860
};

// Class BattlePrototype.DebuggingItemBool2
// Size: 0x2f0 (Inherited: 0x2e8)
struct ADebuggingItemBool2 : ADebuggingItemBool {
	int32_t Index; // 0x2e8(0x04)
	char pad_2EC[0x4]; // 0x2ec(0x04)
};

// Class BattlePrototype.DebuggingItemInGameAchievementGroup
// Size: 0x360 (Inherited: 0x2d0)
struct ADebuggingItemInGameAchievementGroup : ADebuggingItemGroup {
	struct TArray<struct TWeakObjectPtr<struct ADebuggingItemInt2>> IntList; // 0x2d0(0x10)
	struct TWeakObjectPtr<struct ADebuggingItemInt> IntReport; // 0x2e0(0x08)
	struct TArray<struct TWeakObjectPtr<struct ADebuggingItemBool2>> TradeBool; // 0x2e8(0x10)
	struct TArray<struct TWeakObjectPtr<struct ADebuggingItemBool2>> QuestBool; // 0x2f8(0x10)
	struct TArray<struct TWeakObjectPtr<struct ADebuggingItemBool2>> AttachmentBool; // 0x308(0x10)
	struct TArray<struct TWeakObjectPtr<struct ADebuggingItemBool2>> EnemyBool; // 0x318(0x10)
	struct TWeakObjectPtr<struct ADebuggingItemInt2> IntMoney; // 0x328(0x08)
	struct TWeakObjectPtr<struct ADebuggingItemEvent> ExecMoney; // 0x330(0x08)
	struct TArray<struct TWeakObjectPtr<struct ADebuggingItemBool2>> PresentBool; // 0x338(0x10)
	struct UAchievementManager* Manager; // 0x348(0x08)
	struct UAchievementParamDBAsset* DBAsset; // 0x350(0x08)
	char pad_358[0x8]; // 0x358(0x08)

	void OnPageOpened(); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnPageOpened // (Final|Native|Public) // @ game+0x8518d0
	void OnEventChangeKins(struct ADebuggingItemEvent* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnEventChangeKins // (Final|Native|Public) // @ game+0x79d490
	void OnChangeReportCount(struct ADebuggingItemInt* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnChangeReportCount // (Final|Native|Public) // @ game+0x79d490
	void OnChangeIntParam(struct ADebuggingItemInt* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnChangeIntParam // (Final|Native|Public) // @ game+0x79d490
	void OnChangeBoolTrade(struct ADebuggingItemBool* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnChangeBoolTrade // (Final|Native|Public) // @ game+0x79d490
	void OnChangeBoolQuest(struct ADebuggingItemBool* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnChangeBoolQuest // (Final|Native|Public) // @ game+0x79d490
	void OnChangeBoolPresent(struct ADebuggingItemBool* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnChangeBoolPresent // (Final|Native|Public) // @ game+0x79d490
	void OnChangeBoolEnemy(struct ADebuggingItemBool* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnChangeBoolEnemy // (Final|Native|Public) // @ game+0x79d490
	void OnChangeBoolAttachment(struct ADebuggingItemBool* Item); // Function BattlePrototype.DebuggingItemInGameAchievementGroup.OnChangeBoolAttachment // (Final|Native|Public) // @ game+0x79d490
};

// Class BattlePrototype.RSTickableManagerBase
// Size: 0x38 (Inherited: 0x28)
struct URSTickableManagerBase : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class BattlePrototype.AchievementManager
// Size: 0x1f8 (Inherited: 0x38)
struct UAchievementManager : URSTickableManagerBase {
	char pad_38[0x10]; // 0x38(0x10)
	struct URSGameInstance* _gameInstance; // 0x48(0x08)
	char pad_50[0x10]; // 0x50(0x10)
	struct FAchievementParam Parameter; // 0x60(0x130)
	char pad_190[0x28]; // 0x190(0x28)
	struct TArray<struct FName> achievementQueue; // 0x1b8(0x10)
	struct TArray<struct FName> achievementFailedQueue; // 0x1c8(0x10)
	char pad_1D8[0x8]; // 0x1d8(0x08)
	struct TArray<struct FName> openCompleted; // 0x1e0(0x10)
	char pad_1F0[0x8]; // 0x1f0(0x08)

	void WatchOpeningMovie(); // Function BattlePrototype.AchievementManager.WatchOpeningMovie // (Final|Native|Public|BlueprintCallable) // @ game+0x116b5a0
	void UseSas(); // Function BattlePrototype.AchievementManager.UseSas // (Final|Native|Public|BlueprintCallable) // @ game+0x116b510
	void UsePKObject(); // Function BattlePrototype.AchievementManager.UsePKObject // (Final|Native|Public|BlueprintCallable) // @ game+0x116b480
	void UseDrive(); // Function BattlePrototype.AchievementManager.UseDrive // (Final|Native|Public|BlueprintCallable) // @ game+0x116b3f0
	void UseCombinationVision(enum class EPlayerID playerId, enum class EPlayerID visionCharID); // Function BattlePrototype.AchievementManager.UseCombinationVision // (Final|Native|Public|BlueprintCallable) // @ game+0x116b240
	void UseBrainCrash(); // Function BattlePrototype.AchievementManager.UseBrainCrash // (Final|Native|Public|BlueprintCallable) // @ game+0x116b1b0
	void Use4CVinCombo(); // Function BattlePrototype.AchievementManager.Use4CVinCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x116b120
	void TradeItem(struct FName ItemId); // Function BattlePrototype.AchievementManager.TradeItem // (Final|Native|Public|BlueprintCallable) // @ game+0x116afe0
	void TimeoverInBF(); // Function BattlePrototype.AchievementManager.TimeoverInBF // (Final|Native|Public|BlueprintCallable) // @ game+0x116af50
	void SupportedInBrainField(); // Function BattlePrototype.AchievementManager.SupportedInBrainField // (Final|Native|Public|BlueprintCallable) // @ game+0x116aec0
	void SuohIncident(enum class EPlayerID playerId); // Function BattlePrototype.AchievementManager.SuohIncident // (Final|Native|Public|BlueprintCallable) // @ game+0x116ad90
	void StartStory(enum class EPlayerID playerId); // Function BattlePrototype.AchievementManager.StartStory // (Final|Native|Public|BlueprintCallable) // @ game+0x116ac60
	void StartPsychicObjectBus(); // Function BattlePrototype.AchievementManager.StartPsychicObjectBus // (Final|Native|Public|BlueprintCallable) // @ game+0x116abd0
	void SasHologram(); // Function BattlePrototype.AchievementManager.SasHologram // (Final|Native|Public|BlueprintCallable) // @ game+0x116ab40
	void ResuscitateFollow(); // Function BattlePrototype.AchievementManager.ResuscitateFollow // (Final|Native|Public|BlueprintCallable) // @ game+0x116aa20
	void Resuscitated(); // Function BattlePrototype.AchievementManager.Resuscitated // (Final|Native|Public|BlueprintCallable) // @ game+0x116aab0
	void QueryAchievements(); // Function BattlePrototype.AchievementManager.QueryAchievements // (Final|Native|Public|BlueprintCallable) // @ game+0x116aa00
	void Protected(); // Function BattlePrototype.AchievementManager.Protected // (Final|Native|Public|BlueprintCallable) // @ game+0x116a970
	void Present(enum class EPlayerID playerId, enum class EPlayerID TargetID, struct FName ItemId); // Function BattlePrototype.AchievementManager.Present // (Final|Native|Public|BlueprintCallable) // @ game+0x116a740
	void PlayVoice(struct FString CueName); // Function BattlePrototype.AchievementManager.PlayVoice // (Final|Native|Public|BlueprintCallable) // @ game+0x116a560
	bool OpenAchievementCheckProgress_EnemyKill(); // Function BattlePrototype.AchievementManager.OpenAchievementCheckProgress_EnemyKill // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xad4510
	bool OpenAchievement(enum class EAchievementsType Type); // Function BattlePrototype.AchievementManager.OpenAchievement // (Final|Native|Public|BlueprintCallable) // @ game+0x116a4d0
	void MaMoRu(); // Function BattlePrototype.AchievementManager.MaMoRu // (Final|Native|Public|BlueprintCallable) // @ game+0x116a440
	void KillsInBrainField(int32_t Num); // Function BattlePrototype.AchievementManager.KillsInBrainField // (Final|Native|Public|BlueprintCallable) // @ game+0x116a310
	void KillEnemys(int32_t Num); // Function BattlePrototype.AchievementManager.KillEnemys // (Final|Native|Public|BlueprintCallable) // @ game+0x116a0b0
	void KillEnemyDataForAchievement(struct FName enemyName, struct FHCHitResult hcResult, enum class EPsychicObjectUniqueType poType, bool bBrainCrashMulti); // Function BattlePrototype.AchievementManager.KillEnemyDataForAchievement // (Final|Native|Public|BlueprintCallable) // @ game+0x1169ce0
	void Kill_UseBus(int32_t Num); // Function BattlePrototype.AchievementManager.Kill_UseBus // (Final|Native|Public|BlueprintCallable) // @ game+0x116a1e0
	void JustDodge(); // Function BattlePrototype.AchievementManager.JustDodge // (Final|Native|Public|BlueprintCallable) // @ game+0x1169c50
	bool IsOpenAchievement(enum class EAchievementsType Type); // Function BattlePrototype.AchievementManager.IsOpenAchievement // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1169bc0
	void GetItem(struct FName ItemId); // Function BattlePrototype.AchievementManager.GetItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1169a80
	struct FString GetDebugString(int32_t idx); // Function BattlePrototype.AchievementManager.GetDebugString // (Final|Native|Public|BlueprintCallable) // @ game+0x11699d0
	void GatherAllMember(); // Function BattlePrototype.AchievementManager.GatherAllMember // (Final|Native|Public|BlueprintCallable) // @ game+0x1169940
	void FinishLastBattle(); // Function BattlePrototype.AchievementManager.FinishLastBattle // (Final|Native|Public|BlueprintCallable) // @ game+0x11698b0
	void EquipItems(enum class EPlayerID playerId, struct FName ItemId); // Function BattlePrototype.AchievementManager.EquipItems // (Final|Native|Public|BlueprintCallable) // @ game+0x11696f0
	void EndStory(enum class EPlayerID playerId); // Function BattlePrototype.AchievementManager.EndStory // (Final|Native|Public|BlueprintCallable) // @ game+0x11695c0
	void EndPsychicObjectBus(); // Function BattlePrototype.AchievementManager.EndPsychicObjectBus // (Final|Native|Public|BlueprintCallable) // @ game+0x1169530
	void DriveMaxBonus(); // Function BattlePrototype.AchievementManager.DriveMaxBonus // (Final|Native|Public|BlueprintCallable) // @ game+0x11694a0
	void CompleteEnemyLibrary(); // Function BattlePrototype.AchievementManager.CompleteEnemyLibrary // (Final|Native|Public|BlueprintCallable) // @ game+0x1169410
	void ClearQuest(struct FName questId); // Function BattlePrototype.AchievementManager.ClearQuest // (Final|Native|Public|BlueprintCallable) // @ game+0x11692d0
	void ClearBondsEp(enum class EPlayerID playerId, enum class EPlayerID TargetID, int32_t episodeNo); // Function BattlePrototype.AchievementManager.ClearBondsEp // (Final|Native|Public|BlueprintCallable) // @ game+0x11690a0
	void CheckCompleteSkill(enum class EPlayerID playerId); // Function BattlePrototype.AchievementManager.CheckCompleteSkill // (Final|Native|Public|BlueprintCallable) // @ game+0x1168f00
	void ChaseAttack(); // Function BattlePrototype.AchievementManager.ChaseAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x1168e70
	void BrainCrashKillsSameTime(int32_t Num); // Function BattlePrototype.AchievementManager.BrainCrashKillsSameTime // (Final|Native|Public|BlueprintCallable) // @ game+0x1168d40
	void BondsLvOver6(enum class EPlayerID playerId, enum class EPlayerID TargetID); // Function BattlePrototype.AchievementManager.BondsLvOver6 // (Final|Native|Public|BlueprintCallable) // @ game+0x1168b90
	void AddMoney(int32_t Num); // Function BattlePrototype.AchievementManager.AddMoney // (Final|Native|Public|BlueprintCallable) // @ game+0x1168a60
	void AcquireSkill(enum class EPlayerID playerId, enum class EPlayerSkill skill); // Function BattlePrototype.AchievementManager.AcquireSkill // (Final|Native|Public|BlueprintCallable) // @ game+0x11688b0
};

// Class BattlePrototype.AchievementUtility
// Size: 0x28 (Inherited: 0x28)
struct UAchievementUtility : UBlueprintFunctionLibrary {

	void WatchOpeningMovie(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.WatchOpeningMovie // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b5c0
	void UseSas(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.UseSas // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b530
	void UsePKObject(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.UsePKObject // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b4a0
	void UseDrive(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.UseDrive // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b410
	void UseCombinationVision(struct UObject* WorldContextObject, enum class EPlayerID playerId, enum class EPlayerID visionCharID); // Function BattlePrototype.AchievementUtility.UseCombinationVision // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b300
	void UseBrainCrash(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.UseBrainCrash // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b1d0
	void Use4CVinCombo(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.Use4CVinCombo // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b140
	void TradeItem(struct UObject* WorldContextObject, struct FName ItemId); // Function BattlePrototype.AchievementUtility.TradeItem // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116b070
	void TimeoverInBF(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.TimeoverInBF // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116af70
	void SupportedInBrainField(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.SupportedInBrainField // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116aee0
	void SuohIncident(struct UObject* WorldContextObject, enum class EPlayerID playerId); // Function BattlePrototype.AchievementUtility.SuohIncident // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116ae10
	void StartStory(struct UObject* WorldContextObject, enum class EPlayerID playerId); // Function BattlePrototype.AchievementUtility.StartStory // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116ace0
	void StartPsychicObjectBus(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.StartPsychicObjectBus // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116abf0
	void SasHologram(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.SasHologram // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116ab60
	void ResuscitateFollow(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.ResuscitateFollow // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116aa40
	void Resuscitated(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.Resuscitated // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116aad0
	void Protected(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.Protected // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116a990
	void Present(struct UObject* WorldContextObject, enum class EPlayerID playerId, enum class EPlayerID TargetID, struct FName ItemId); // Function BattlePrototype.AchievementUtility.Present // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116a840
	void PlayVoice(struct UObject* WorldContextObject, struct FString CueName); // Function BattlePrototype.AchievementUtility.PlayVoice // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116a630
	void MaMoRu(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.MaMoRu // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116a460
	void KillsInBrainField(struct UObject* WorldContextObject, int32_t Num); // Function BattlePrototype.AchievementUtility.KillsInBrainField // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116a390
	void KillEnemys(struct UObject* WorldContextObject, int32_t Num); // Function BattlePrototype.AchievementUtility.KillEnemys // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116a130
	void KillEnemyDataForAchievement(struct UObject* WorldContextObject, struct FName enemyName, struct FHCHitResult hcResult, enum class EPsychicObjectUniqueType poType, bool bBrainCrashMulti); // Function BattlePrototype.AchievementUtility.KillEnemyDataForAchievement // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169eb0
	void Kill_UseBus(struct UObject* WorldContextObject, int32_t Num); // Function BattlePrototype.AchievementUtility.Kill_UseBus // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x116a260
	void JustDodge(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.JustDodge // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169c70
	void GetItem(struct UObject* WorldContextObject, struct FName ItemId); // Function BattlePrototype.AchievementUtility.GetItem // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169b10
	void GatherAllMember(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.GatherAllMember // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169960
	void FinishLastBattle(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.FinishLastBattle // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11698d0
	void EquipItems(struct UObject* WorldContextObject, enum class EPlayerID playerId, struct FName ItemId); // Function BattlePrototype.AchievementUtility.EquipItems // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11697c0
	void EndStory(struct UObject* WorldContextObject, enum class EPlayerID playerId); // Function BattlePrototype.AchievementUtility.EndStory // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169640
	void EndPsychicObjectBus(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.EndPsychicObjectBus // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169550
	void DriveMaxBonus(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.DriveMaxBonus // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11694c0
	void CompleteEnemyLibrary(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.CompleteEnemyLibrary // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169430
	void ClearQuest(struct UObject* WorldContextObject, struct FName questId); // Function BattlePrototype.AchievementUtility.ClearQuest // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169360
	void ClearBondsEp(struct UObject* WorldContextObject, enum class EPlayerID playerId, enum class EPlayerID TargetID, int32_t episodeNo); // Function BattlePrototype.AchievementUtility.ClearBondsEp // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11691a0
	void Clear(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.Clear // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1169030
	void CheckCompleteSkill(struct UObject* WorldContextObject, enum class EPlayerID playerId); // Function BattlePrototype.AchievementUtility.CheckCompleteSkill // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1168f80
	void ChaseAttack(struct UObject* WorldContextObject); // Function BattlePrototype.AchievementUtility.ChaseAttack // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1168e90
	void BrainCrashKillsSameTime(struct UObject* WorldContextObject, int32_t Num); // Function BattlePrototype.AchievementUtility.BrainCrashKillsSameTime // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1168dc0
	void BondsLvOver6(struct UObject* WorldContextObject, enum class EPlayerID playerId, enum class EPlayerID TargetID); // Function BattlePrototype.AchievementUtility.BondsLvOver6 // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1168c50
	void AddMoney(struct UObject* WorldContextObject, int32_t Num); // Function BattlePrototype.AchievementUtility.AddMoney // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1168ae0
	void AcquireSkill(struct UObject* WorldContextObject, enum class EPlayerID playerId, enum class EPlayerSkill skill); // Function BattlePrototype.AchievementUtility.AcquireSkill // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1168970
};

// Class BattlePrototype.AchievementParamDBAsset
// Size: 0x280 (Inherited: 0x28)
struct UAchievementParamDBAsset : UObject {
	struct TMap<enum class EPlayerID, struct FAchievementPresentItem> PresentItemListM; // 0x28(0x50)
	struct TMap<enum class EPlayerID, struct FAchievementPresentItem> PresentItemListF; // 0x78(0x50)
	int32_t PresentItemTotal; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct TArray<struct FName> AttachmentItemList; // 0xd0(0x10)
	struct TArray<struct FName> TradeItemList; // 0xe0(0x10)
	struct TArray<struct FName> CostumeEquipItemList; // 0xf0(0x10)
	struct TArray<struct FName> BakiHeadItemList; // 0x100(0x10)
	struct TArray<struct FString> BoredomVoiceList; // 0x110(0x10)
	struct TArray<struct FName> QuestList; // 0x120(0x10)
	struct TMap<enum class EPlayerID, int32_t> bondsProgressM; // 0x130(0x50)
	struct TMap<enum class EPlayerID, int32_t> bondsProgressF; // 0x180(0x50)
	struct TArray<struct FName> EnemyLibraryList; // 0x1d0(0x10)
	struct TMap<enum class EPlayerSkillCategory, struct FAchievementSkillItem> SkillListM; // 0x1e0(0x50)
	struct TMap<enum class EPlayerSkillCategory, struct FAchievementSkillItem> SkillListF; // 0x230(0x50)

	void Convert(); // Function BattlePrototype.AchievementParamDBAsset.Convert // (Final|Native|Public) // @ game+0x8518d0
};

// Class BattlePrototype.ActionIcon
// Size: 0x298 (Inherited: 0x230)
struct AActionIcon : AActor {
	struct AActionIcon* PairActionIconActor; // 0x230(0x08)
	char pad_238[0x8]; // 0x238(0x08)
	struct UBoxComponent* ShowBoxComponent; // 0x240(0x08)
	struct UBoxComponent* EventBoxComponent; // 0x248(0x08)
	char pad_250[0x20]; // 0x250(0x20)
	struct FVector WorldPositionOffset; // 0x270(0x0c)
	enum class EActionIconType actionIconType; // 0x27c(0x01)
	enum class EActionIconSubQuestState ActionIconSubQuestState; // 0x27d(0x01)
	bool ActionIconSubQuestActive; // 0x27e(0x01)
	char pad_27F[0x1]; // 0x27f(0x01)
	struct UUIActionIcon* UIActionIcon; // 0x280(0x08)
	struct AActionIcon* PairActionIcon; // 0x288(0x08)
	char pad_290[0x4]; // 0x290(0x04)
	bool OverlapEventInvalidFlag; // 0x294(0x01)
	char pad_295[0x3]; // 0x295(0x03)

	void UpdateActionIconState(); // Function BattlePrototype.ActionIcon.UpdateActionIconState // (Final|Native|Public|BlueprintCallable) // @ game+0x116fb60
	void SetWorldPositionOffset(struct FVector WorldPositionOffset); // Function BattlePrototype.ActionIcon.SetWorldPositionOffset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x116f9b0
	void SetVisible(bool Flag, bool UpdateState); // Function BattlePrototype.ActionIcon.SetVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x116f8e0
	void SetSubQuestState(enum class EActionIconSubQuestState State, bool subquestActive); // Function BattlePrototype.ActionIcon.SetSubQuestState // (Final|Native|Public|BlueprintCallable) // @ game+0x116f810
	void SetOverlapEventInvalidFlag(bool Enable); // Function BattlePrototype.ActionIcon.SetOverlapEventInvalidFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x116f790
	void SetLockIconMode(bool isLock); // Function BattlePrototype.ActionIcon.SetLockIconMode // (Final|Native|Public|BlueprintCallable) // @ game+0x116f700
	void setIconType(enum class EActionIconType actionIconType, bool IsActive); // Function BattlePrototype.ActionIcon.setIconType // (Final|Native|Public|BlueprintCallable) // @ game+0x116f630
	void SetBattleFlag(bool bBattle); // Function BattlePrototype.ActionIcon.SetBattleFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x116f480
	void SetActionIconSupportParam(struct FActionIconSupportParam ActionIconSupportParam); // Function BattlePrototype.ActionIcon.SetActionIconSupportParam // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x116f3c0
	void SetActionCollisionEnable(bool Enable); // Function BattlePrototype.ActionIcon.SetActionCollisionEnable // (Final|Native|Public|BlueprintCallable) // @ game+0x116f330
	void SafeSetIconMode(enum class EActionIconMode Mode); // Function BattlePrototype.ActionIcon.SafeSetIconMode // (Final|Native|Public|BlueprintCallable) // @ game+0x116f2b0
	void RestoreVisible(); // Function BattlePrototype.ActionIcon.RestoreVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x116f290
	void OnReActivate(); // Function BattlePrototype.ActionIcon.OnReActivate // (Final|Native|Public|BlueprintCallable) // @ game+0x8518d0
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function BattlePrototype.ActionIcon.OnOverlapEnd // (Final|Native|Public) // @ game+0x116f030
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BattlePrototype.ActionIcon.OnOverlapBegin // (Final|Native|Public|HasOutParms) // @ game+0x116ee40
	void OnDecide(); // Function BattlePrototype.ActionIcon.OnDecide // (Final|Native|Public|BlueprintCallable) // @ game+0x116ee20
	bool IsPlayingActionIcon(); // Function BattlePrototype.ActionIcon.IsPlayingActionIcon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116edf0
	bool IsActionAbleIcon(); // Function BattlePrototype.ActionIcon.IsActionAbleIcon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116eca0
	enum class EActionIconSubQuestState GetSubQuestState(); // Function BattlePrototype.ActionIcon.GetSubQuestState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116ec80
	bool GetOverlapEventInvalidFlag(); // Function BattlePrototype.ActionIcon.GetOverlapEventInvalidFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x116ec60
	enum class EActionIconType GetIconType(); // Function BattlePrototype.ActionIcon.GetIconType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116eb10
	bool CheckVisibleIcon(struct AActor* Actor); // Function BattlePrototype.ActionIcon.CheckVisibleIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x116e410
};

// Class BattlePrototype.ActionManager
// Size: 0x298 (Inherited: 0x230)
struct AActionManager : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	float VisibilityCheckDistance; // 0x238(0x04)
	bool IsDispAreaNextUI; // 0x23c(0x01)
	bool IsDebug; // 0x23d(0x01)
	char pad_23E[0x5a]; // 0x23e(0x5a)

	void UnregistAction2(int32_t Handle); // Function BattlePrototype.ActionManager.UnregistAction2 // (Final|Native|Public|BlueprintCallable) // @ game+0x116fa40
	void UnregistAction(int32_t Handle); // Function BattlePrototype.ActionManager.UnregistAction // (Final|Native|Public|BlueprintCallable) // @ game+0x116fac0
	void SetEnableActionCheck(bool bEnable); // Function BattlePrototype.ActionManager.SetEnableActionCheck // (Final|Native|Public|BlueprintCallable) // @ game+0x116f5a0
	void SetBattleFlag(bool bBattle); // Function BattlePrototype.ActionManager.SetBattleFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x116f510
	int32_t RegisterAction2(struct AActor* Actor); // Function BattlePrototype.ActionManager.RegisterAction2 // (Final|Native|Public|BlueprintCallable) // @ game+0x116f170
	int32_t RegisterAction(struct AActor* Actor); // Function BattlePrototype.ActionManager.RegisterAction // (Final|Native|Public|BlueprintCallable) // @ game+0x116f200
	bool IsExistEnableAction2(); // Function BattlePrototype.ActionManager.IsExistEnableAction2 // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116ed90
	bool IsExistEnableAction(); // Function BattlePrototype.ActionManager.IsExistEnableAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116edc0
	void ClearActionAll(); // Function BattlePrototype.ActionManager.ClearActionAll // (Final|Native|Public|BlueprintCallable) // @ game+0x116e4a0
};

// Class BattlePrototype.ActionManagerInterface
// Size: 0x28 (Inherited: 0x28)
struct UActionManagerInterface : UInterface {

	void ActionManagerSetIconMode(int32_t Handle, enum class EActionIconMode Mode); // Function BattlePrototype.ActionManagerInterface.ActionManagerSetIconMode // (Native|Event|Public|BlueprintEvent) // @ game+0x116e350
	void ActionManagerSetBattleFlag(bool bBattle); // Function BattlePrototype.ActionManagerInterface.ActionManagerSetBattleFlag // (Native|Event|Public|BlueprintEvent) // @ game+0x116e2c0
	struct AActor* ActionManagerGetPairActor(); // Function BattlePrototype.ActionManagerInterface.ActionManagerGetPairActor // (Native|Event|Public|BlueprintEvent) // @ game+0x116e290
	float ActionManagerGetEditableAngle(); // Function BattlePrototype.ActionManagerInterface.ActionManagerGetEditableAngle // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x116e260
	bool ActionManagerExecute(int32_t Handle); // Function BattlePrototype.ActionManagerInterface.ActionManagerExecute // (Native|Event|Public|BlueprintEvent) // @ game+0x116e1c0
	bool ActionManagerCheck(int32_t Handle); // Function BattlePrototype.ActionManagerInterface.ActionManagerCheck // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x116e120
};

// Class BattlePrototype.ActorVisibleChangeBase
// Size: 0x260 (Inherited: 0x230)
struct AActorVisibleChangeBase : AActor {
	bool IsCollectArrangeItem; // 0x230(0x01)
	bool IsCollectArrangeObject; // 0x231(0x01)
	bool IsCollectAnotherActor; // 0x232(0x01)
	char pad_233[0x5]; // 0x233(0x05)
	struct USphereComponent* CollectorComponent; // 0x238(0x08)
	struct TArray<struct AActor*> ChangeActors; // 0x240(0x10)
	struct TArray<struct AArrangeItemBase*> ChangeActors_ArrangeItemBase; // 0x250(0x10)

	void VisibleActors(); // Function BattlePrototype.ActorVisibleChangeBase.VisibleActors // (Final|Native|Public|BlueprintCallable) // @ game+0x116fb80
	void UnvisibleActors(); // Function BattlePrototype.ActorVisibleChangeBase.UnvisibleActors // (Final|Native|Public|BlueprintCallable) // @ game+0x116fb40
	void CollectActors(); // Function BattlePrototype.ActorVisibleChangeBase.CollectActors // (Final|Native|Public|BlueprintCallable) // @ game+0x116e4c0
};

// Class BattlePrototype.AddContentManager
// Size: 0xd8 (Inherited: 0x28)
struct UAddContentManager : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct UDataTable* _RefDataTable; // 0x30(0x08)
	struct UDataTable* _AddContentsPresentListDataTable; // 0x38(0x08)
	struct TMap<struct FName, bool> _EntitledData; // 0x40(0x50)
	char pad_90[0x48]; // 0x90(0x48)

	bool IsEntitled(struct FName AddContentName); // Function BattlePrototype.AddContentManager.IsEntitled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116ed00
	bool IsCheckingEntitlementInProgress(); // Function BattlePrototype.AddContentManager.IsCheckingEntitlementInProgress // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x116ecd0
	struct TArray<struct FName> GetInvalidContentsList(struct TArray<struct FName> possessionContentsList); // Function BattlePrototype.AddContentManager.GetInvalidContentsList // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x116eb30
	struct TArray<struct FName> GetEntitledContentsList(); // Function BattlePrototype.AddContentManager.GetEntitledContentsList // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116ea90
	struct TArray<struct FName> GetAllContentsList(); // Function BattlePrototype.AddContentManager.GetAllContentsList // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x116ea10
	bool GetAddContentsTitleIdAndExplanationId(struct FName AddContentName, struct FString TitleID, struct FString ExplanationID); // Function BattlePrototype.AddContentManager.GetAddContentsTitleIdAndExplanationId // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x116e8b0
	bool GetAddContentsPresentInfo(struct TArray<struct FAddContentsPresentInfo> infoList, struct FName AddContentName); // Function BattlePrototype.AddContentManager.GetAddContentsPresentInfo // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x116e790
	bool GetAddContentRefDataID(struct FName ID, struct FName AddContentName); // Function BattlePrototype.AddContentManager.GetAddContentRefDataID // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x116e6b0
	bool GetAddContentRefDataCell(struct FAddContentRefDataCell rowParam, struct FName AddContentName); // Function BattlePrototype.AddContentManager.GetAddContentRefDataCell // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x116e510
	bool ConstructLocalEntitleData(); // Function BattlePrototype.AddContentManager.ConstructLocalEntitleData // (Final|Native|Public|BlueprintCallable) // @ game+0x116e4e0
};

// Class BattlePrototype.AjitoBase
// Size: 0x230 (Inherited: 0x230)
struct AAjitoBase : AActor {
};

// Class BattlePrototype.AjitoManager
// Size: 0x238 (Inherited: 0x230)
struct AAjitoManager : AActor {
	char pad_230[0x8]; // 0x230(0x08)
};

// Class BattlePrototype.AjitoMember
// Size: 0x390 (Inherited: 0x230)
struct AAjitoMember : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x238(0x08)
	struct FTransform m_storeSkeletalMeshTransform; // 0x240(0x30)
	char pad_270[0x4]; // 0x270(0x04)
	enum class EPlayerID playerId; // 0x274(0x01)
	char pad_275[0x3]; // 0x275(0x03)
	int32_t PlaceID; // 0x278(0x04)
	int32_t PlaceNo; // 0x27c(0x04)
	struct TArray<int32_t> ExclusivePlaceNoList; // 0x280(0x10)
	struct TArray<struct FString> WithPlaceNoList; // 0x290(0x10)
	struct FName ActionName; // 0x2a0(0x08)
	bool IsLookAtPlayer; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct UCapsuleComponent* CharacterCapsuleComponent; // 0x2b0(0x08)
	struct UBoxComponent* ShowBoxComponent; // 0x2b8(0x08)
	struct UBoxComponent* EventBoxComponent; // 0x2c0(0x08)
	struct AMakeEventActor* MakeEventActorClass; // 0x2c8(0x08)
	struct AMakeEventActor* MakeEventActor; // 0x2d0(0x08)
	char pad_2D8[0x1]; // 0x2d8(0x01)
	bool IsOverlappingPlayer; // 0x2d9(0x01)
	char pad_2DA[0x6]; // 0x2da(0x06)
	float ActionIconCoolTime; // 0x2e0(0x04)
	bool IsAvalableAction; // 0x2e4(0x01)
	char pad_2E5[0xb]; // 0x2e5(0x0b)
	struct UChildActorComponent* ChildActionIcon; // 0x2f0(0x08)
	struct AActionIcon* ActionIcon; // 0x2f8(0x08)
	struct FVector ActionIconWorldPositionOffset; // 0x300(0x0c)
	enum class EActionIconType actionIconType; // 0x30c(0x01)
	char pad_30D[0x3]; // 0x30d(0x03)
	float TargetIconOffsetZ; // 0x310(0x04)
	char pad_314[0x4]; // 0x314(0x04)
	struct URSAjitoAnimInstance* AnimClass; // 0x318(0x08)
	struct TWeakObjectPtr<struct URSAjitoAnimInstance> AnimationBP; // 0x320(0x08)
	struct UDataTable* IconOffsetDataTable; // 0x328(0x08)
	struct TMap<struct FName, struct FNpcIconOffsetInfo> IconOffsetDataInfos; // 0x330(0x50)
	float WaitTimeTransitionToTalk; // 0x380(0x04)
	float WaitTimeTransitionToIdle; // 0x384(0x04)
	char pad_388[0x8]; // 0x388(0x08)

	void WaitTransitionToTalk(float WaitTime); // Function BattlePrototype.AjitoMember.WaitTransitionToTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11744f0
	void WaitTransitionToIdle(float WaitTime); // Function BattlePrototype.AjitoMember.WaitTransitionToIdle // (Final|Native|Public|BlueprintCallable) // @ game+0x1174470
	void UpdateTargetIconOffsetZ(); // Function BattlePrototype.AjitoMember.UpdateTargetIconOffsetZ // (Final|Native|Public|BlueprintCallable) // @ game+0x1174450
	bool UpdateActionIcon(); // Function BattlePrototype.AjitoMember.UpdateActionIcon // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1174420
	void SetTargetIconOffsetZ(float HeadHeight); // Function BattlePrototype.AjitoMember.SetTargetIconOffsetZ // (Final|Native|Public|BlueprintCallable) // @ game+0x1174310
	void SetIconOffsetPreset(struct FName RawName); // Function BattlePrototype.AjitoMember.SetIconOffsetPreset // (Final|Native|Public|BlueprintCallable) // @ game+0x1174290
	bool SetAttachmentVisible(bool Visible); // Function BattlePrototype.AjitoMember.SetAttachmentVisible // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x11741f0
	void SetActionIcoVisible(bool Visible); // Function BattlePrototype.AjitoMember.SetActionIcoVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x11740e0
	void SetActionIconType(enum class EActionIconType Type); // Function BattlePrototype.AjitoMember.SetActionIconType // (Final|Native|Public|BlueprintCallable) // @ game+0x1174170
	void RequestTalkStart(); // Function BattlePrototype.AjitoMember.RequestTalkStart // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1174080
	void RequestTalkEnd(); // Function BattlePrototype.AjitoMember.RequestTalkEnd // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1174060
	void PresentEventStart(); // Function BattlePrototype.AjitoMember.PresentEventStart // (Final|Native|Public|BlueprintCallable) // @ game+0x1173b60
	void PresentEventEnd(); // Function BattlePrototype.AjitoMember.PresentEventEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x1173b40
	bool IsWaitTransitionToTalk(); // Function BattlePrototype.AjitoMember.IsWaitTransitionToTalk // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1173b10
	bool IsWaitTransitionToIdle(); // Function BattlePrototype.AjitoMember.IsWaitTransitionToIdle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1173ae0
	bool IsTalkEnablePlayer(); // Function BattlePrototype.AjitoMember.IsTalkEnablePlayer // (Event|Public|BlueprintEvent) // @ game+0x1685580
	bool IsReadyToTalk(); // Function BattlePrototype.AjitoMember.IsReadyToTalk // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1173a80
	bool IsActiveMakeEvent(); // Function BattlePrototype.AjitoMember.IsActiveMakeEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x11738f0
	float GetHeadHeight(); // Function BattlePrototype.AjitoMember.GetHeadHeight // (Final|Native|Public|BlueprintCallable) // @ game+0x1173890
	struct TArray<struct AActor*> GetAllOmActors(); // Function BattlePrototype.AjitoMember.GetAllOmActors // (Final|Native|Public|BlueprintCallable) // @ game+0x1173720
	void ClearWaitTransitionToTalk(); // Function BattlePrototype.AjitoMember.ClearWaitTransitionToTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x1173700
	void ClearWaitTransitionToIdle(); // Function BattlePrototype.AjitoMember.ClearWaitTransitionToIdle // (Final|Native|Public|BlueprintCallable) // @ game+0x11736e0
	void AdjustIconOffsetByHeadHeightForce(float HeadHeight); // Function BattlePrototype.AjitoMember.AdjustIconOffsetByHeadHeightForce // (Final|Native|Public|BlueprintCallable) // @ game+0x1173660
	void AdjustIconOffsetByHeadHeight(); // Function BattlePrototype.AjitoMember.AdjustIconOffsetByHeadHeight // (Final|Native|Public|BlueprintCallable) // @ game+0x1173640
};

// Class BattlePrototype.AjitoNpcPlaceHolderBase
// Size: 0x238 (Inherited: 0x230)
struct AAjitoNpcPlaceHolderBase : AActor {
	int32_t PlacementID; // 0x230(0x04)
	bool IsAvailable; // 0x234(0x01)
	char pad_235[0x3]; // 0x235(0x03)

	void SetVisible(bool Visible); // Function BattlePrototype.AjitoNpcPlaceHolderBase.SetVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x1174390
};

// Class BattlePrototype.RSActorSystemBase
// Size: 0x230 (Inherited: 0x230)
struct ARSActorSystemBase : AActor {
};

// Class BattlePrototype.AjitoPlacementManager
// Size: 0x248 (Inherited: 0x230)
struct AAjitoPlacementManager : ARSActorSystemBase {
	enum class EPlayerID playerId; // 0x230(0x01)
	char pad_231[0x7]; // 0x231(0x07)
	struct TArray<struct FAjitoPlacementInfo> ActorInfos; // 0x238(0x10)
};

// Class BattlePrototype.AnimControllerComponent
// Size: 0xe0 (Inherited: 0xc0)
struct UAnimControllerComponent : UActorComponent {
	char pad_C0[0x20]; // 0xc0(0x20)

	void RequestTumbleWakeup(); // Function BattlePrototype.AnimControllerComponent.RequestTumbleWakeup // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x11740c0
	void RequestTumble(); // Function BattlePrototype.AnimControllerComponent.RequestTumble // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x11740a0
	void RequestFaintWakeup(); // Function BattlePrototype.AnimControllerComponent.RequestFaintWakeup // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1174040
	void RequestFaint(); // Function BattlePrototype.AnimControllerComponent.RequestFaint // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1174020
	void RequestDamageFlyWakeup(); // Function BattlePrototype.AnimControllerComponent.RequestDamageFlyWakeup // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1174000
	void RequestDamageFly(); // Function BattlePrototype.AnimControllerComponent.RequestDamageFly // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1173fe0
	void RequestDamage(enum class HCDamageKind damageKind, float StiffenSec, float HitStopSec, float HitStopRate, struct FRotator Rot); // Function BattlePrototype.AnimControllerComponent.RequestDamage // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1173e30
	void ReceiveNotifySuperArmor(struct UObject* Notify, int32_t ResistStagger, bool bBegin); // Function BattlePrototype.AnimControllerComponent.ReceiveNotifySuperArmor // (Final|Native|Public|BlueprintCallable) // @ game+0x1173d30
	void ReceiveNotifyDirectionControl(struct UObject* Notify, bool bBegin, float RotateSpeed, bool bUseSocket, struct FName SocketName); // Function BattlePrototype.AnimControllerComponent.ReceiveNotifyDirectionControl // (Final|Native|Public|BlueprintCallable) // @ game+0x1173b80
	bool IsUseSocketDirectionControl(); // Function BattlePrototype.AnimControllerComponent.IsUseSocketDirectionControl // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1173ab0
	bool IsEnableDirectionControl(); // Function BattlePrototype.AnimControllerComponent.IsEnableDirectionControl // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1173a50
	bool IsAnimTumbleDowning(); // Function BattlePrototype.AnimControllerComponent.IsAnimTumbleDowning // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1173a20
	bool IsAnimTumble(); // Function BattlePrototype.AnimControllerComponent.IsAnimTumble // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11739f0
	bool IsAnimFaintDowning(); // Function BattlePrototype.AnimControllerComponent.IsAnimFaintDowning // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11739c0
	bool IsAnimFaint(); // Function BattlePrototype.AnimControllerComponent.IsAnimFaint // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1173990
	bool IsAnimDamageFlyRise(); // Function BattlePrototype.AnimControllerComponent.IsAnimDamageFlyRise // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x6939d0
	bool IsAnimDamageFlyLanding(); // Function BattlePrototype.AnimControllerComponent.IsAnimDamageFlyLanding // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x693a00
	bool IsAnimDamageFly(); // Function BattlePrototype.AnimControllerComponent.IsAnimDamageFly // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1173960
	int32_t GetResistStagger(); // Function BattlePrototype.AnimControllerComponent.GetResistStagger // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11738c0
	struct FName GetDirectionControlSocketName(); // Function BattlePrototype.AnimControllerComponent.GetDirectionControlSocketName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1173820
	float GetDirectionControllRotateSpeed(); // Function BattlePrototype.AnimControllerComponent.GetDirectionControllRotateSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1173860
	struct UAnimControllerComponent* GetAnimControllerComponentFromActor(struct AActor* Actor); // Function BattlePrototype.AnimControllerComponent.GetAnimControllerComponentFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x11737a0
};

// Class BattlePrototype.AnimeInterlockingManager
// Size: 0xb0 (Inherited: 0x28)
struct UAnimeInterlockingManager : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct URSGameInstance* m_gameInstance; // 0x38(0x08)
	struct UDataTable* m_AnimeInterlockingData_DataTable; // 0x40(0x08)
	struct UDataTable* m_AnimeInterlockingReward_DataTable; // 0x48(0x08)
	struct UDataTable* m_AnimeInterlockingSubReward_DataTable; // 0x50(0x08)
	struct UDataTable* m_AnimeInterlockingNumData_DataTable; // 0x58(0x08)
	struct UDataTable* m_AnimeInterlockingNumReward_DataTable; // 0x60(0x08)
	struct UDataTable* m_AnimeInterlockingSubNumReward_DataTable; // 0x68(0x08)
	struct UDataTable* m_AnimeInterlockingRewardToKins_DataTable; // 0x70(0x08)
	struct FAnimeInterlockingChallengeQuestInfo m_ChallengeInfo; // 0x78(0x18)
	struct TArray<struct FAnimeInterlockingSaveParams> m_AnimeInterlockingSaveParamsList; // 0x90(0x10)
	struct TArray<struct FAnimeInterlockingNumRewardSaveParams> m_AnimeInterlockingNumRewardSaveParamsList; // 0xa0(0x10)

	void SetIsChallengeInfoCorrectAnswer(bool isCorrectAnswer); // Function BattlePrototype.AnimeInterlockingManager.SetIsChallengeInfoCorrectAnswer // (Final|Native|Public|BlueprintCallable) // @ game+0x1177e90
	void SetIsAnimeInterlockingNumRewardAchievement(struct FName AnimeInterlockingNumRewardName, bool isAchievement); // Function BattlePrototype.AnimeInterlockingManager.SetIsAnimeInterlockingNumRewardAchievement // (Final|Native|Public|BlueprintCallable) // @ game+0x1177dc0
	void SetIsAnimeInterlockingNoticedFlag(struct FName AnimeInterlockingName, bool isNoticed); // Function BattlePrototype.AnimeInterlockingManager.SetIsAnimeInterlockingNoticedFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x1177cf0
	void SetIsAnimeInterlockingNewFlag(struct FName AnimeInterlockingName, bool isNewFlag); // Function BattlePrototype.AnimeInterlockingManager.SetIsAnimeInterlockingNewFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x1177c20
	void SetIsAnimeInterlockingGetReward(struct FName AnimeInterlockingName, bool isGetReward); // Function BattlePrototype.AnimeInterlockingManager.SetIsAnimeInterlockingGetReward // (Final|Native|Public|BlueprintCallable) // @ game+0x1177b50
	void SetIsAnimeInterlockingGetNumReward(struct FName AnimeInterlockingNumRewardName, bool isGetNumReward); // Function BattlePrototype.AnimeInterlockingManager.SetIsAnimeInterlockingGetNumReward // (Final|Native|Public|BlueprintCallable) // @ game+0x1177a80
	void SetIsAnimeInterlockingAchievementQuest(struct FName AnimeInterlockingName, bool isAchievementQuest); // Function BattlePrototype.AnimeInterlockingManager.SetIsAnimeInterlockingAchievementQuest // (Final|Native|Public|BlueprintCallable) // @ game+0x11779b0
	void SetChallengeInfoAnimeInterlockingName(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.SetChallengeInfoAnimeInterlockingName // (Final|Native|Public|BlueprintCallable) // @ game+0x1177930
	bool SetAnimeInterlockingSaveParams(struct FName AnimeInterlockingName, struct FAnimeInterlockingSaveParams SaveParams); // Function BattlePrototype.AnimeInterlockingManager.SetAnimeInterlockingSaveParams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1177820
	bool SetAnimeInterlockingNumRewardSaveParams(struct FName AnimeInterlockingNumName, struct FAnimeInterlockingNumRewardSaveParams SaveParams); // Function BattlePrototype.AnimeInterlockingManager.SetAnimeInterlockingNumRewardSaveParams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1177720
	void SetAnimeInterlockingIncorrectAnswerNum(struct FName AnimeInterlockingName, int32_t IncorrectAnswerNum); // Function BattlePrototype.AnimeInterlockingManager.SetAnimeInterlockingIncorrectAnswerNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1177660
	bool IsEnableQuest(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.IsEnableQuest // (Final|Native|Public|BlueprintCallable) // @ game+0x1177550
	bool IsChallengeInfoCorrectAnswer(); // Function BattlePrototype.AnimeInterlockingManager.IsChallengeInfoCorrectAnswer // (Final|Native|Public|BlueprintCallable) // @ game+0x1177530
	bool IsAnimeInterlockingNumRewardAchievement(struct FName AnimeInterlockingNumRewardName); // Function BattlePrototype.AnimeInterlockingManager.IsAnimeInterlockingNumRewardAchievement // (Final|Native|Public|BlueprintCallable) // @ game+0x11774a0
	bool IsAnimeInterlockingNoticedFlag(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.IsAnimeInterlockingNoticedFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x1177410
	bool IsAnimeInterlockingNewFlag(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.IsAnimeInterlockingNewFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x1177380
	bool IsAnimeInterlockingGetReward(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.IsAnimeInterlockingGetReward // (Final|Native|Public|BlueprintCallable) // @ game+0x11772f0
	bool IsAnimeInterlockingGetNumReward(struct FName AnimeInterlockingNumRewardName); // Function BattlePrototype.AnimeInterlockingManager.IsAnimeInterlockingGetNumReward // (Final|Native|Public|BlueprintCallable) // @ game+0x1177260
	bool IsAnimeInterlockingAchievementQuest(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.IsAnimeInterlockingAchievementQuest // (Final|Native|Public|BlueprintCallable) // @ game+0x11771d0
	int32_t GetQuestClearNum(); // Function BattlePrototype.AnimeInterlockingManager.GetQuestClearNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1177100
	struct FName GetChallengeInfoAnimeInterlockingName(); // Function BattlePrototype.AnimeInterlockingManager.GetChallengeInfoAnimeInterlockingName // (Final|Native|Public|BlueprintCallable) // @ game+0x11770e0
	bool GetAnimeInterlockingSubReward(struct FName AnimeInterlockingName, struct FAnimeInterlockingsPresentList presentList); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingSubReward // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176fd0
	bool GetAnimeInterlockingSaveParams(struct FName AnimeInterlockingName, struct FAnimeInterlockingSaveParams SaveParams); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingSaveParams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176ec0
	bool GetAnimeInterlockingRewardToKins(struct FString ItemId, int32_t KinsNum); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingRewardToKins // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176d80
	bool GetAnimeInterlockingReward(struct FName AnimeInterlockingName, struct FAnimeInterlockingsPresentList presentList); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingReward // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176c70
	void GetAnimeInterlockingRefDataList(struct FName AnimeInterlockingName, struct TArray<struct FAnimeInterlockingRefDataCell> refDataList); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingRefDataList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176b50
	bool GetAnimeInterlockingRefData(struct FName AnimeInterlockingName, struct FAnimeInterlockingRefDataCell refData); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingRefData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176a30
	bool GetAnimeInterlockingNumSubReward(struct FName AnimeInterlockingNumName, struct FAnimeInterlockingsPresentList presentList); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingNumSubReward // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176920
	bool GetAnimeInterlockingNumRewardSaveParams(struct FName AnimeInterlockingNumName, struct FAnimeInterlockingNumRewardSaveParams SaveParams); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingNumRewardSaveParams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176820
	bool GetAnimeInterlockingNumReward(struct FName AnimeInterlockingNumName, struct FAnimeInterlockingsPresentList presentList); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingNumReward // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176710
	void GetAnimeInterlockingNumRefDataList(struct FName AnimeInterlockingNumName, struct TArray<struct FAnimeInterlockingNumRefDataCell> refDataList); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingNumRefDataList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11765f0
	bool GetAnimeInterlockingNumRefData(struct FName AnimeInterlockingNumName, struct FAnimeInterlockingNumRefDataCell refData); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingNumRefData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11764d0
	int32_t GetAnimeInterlockingIncorrectAnswerNum(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.GetAnimeInterlockingIncorrectAnswerNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1176440
	void GetAcquirableButNotAcquiredNumRewardNameList(struct TArray<struct FName> nameList); // Function BattlePrototype.AnimeInterlockingManager.GetAcquirableButNotAcquiredNumRewardNameList // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1176390
	void AddAnimeInterlockingIncorrectAnswerNum(struct FName AnimeInterlockingName); // Function BattlePrototype.AnimeInterlockingManager.AddAnimeInterlockingIncorrectAnswerNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1176240
};

// Class BattlePrototype.AnimNotify_OnRadialBlur
// Size: 0x68 (Inherited: 0x38)
struct UAnimNotify_OnRadialBlur : UAnimNotify {
	int32_t Priority; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UCurveVector* CurveData; // 0x40(0x08)
	enum class ENotifyRadialBlurModulateType ModulateType; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	struct FVector Location; // 0x4c(0x0c)
	struct FName BoneName; // 0x58(0x08)
	bool IsUseExecuteKind; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)

	void PlayBlur(struct USkeletalMeshComponent* MeshComp); // Function BattlePrototype.AnimNotify_OnRadialBlur.PlayBlur // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x11775e0
	struct UCurveVector* GetUseCurveData(struct USkeletalMeshComponent* MeshComp); // Function BattlePrototype.AnimNotify_OnRadialBlur.GetUseCurveData // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1177130
};

// Class BattlePrototype.AnimNotify_RSPlayParticleEffect
// Size: 0xd0 (Inherited: 0x90)
struct UAnimNotify_RSPlayParticleEffect : UAnimNotify_PlayParticleEffect {
	char pad_90[0x8]; // 0x90(0x08)
	struct URSParticleSystemComponentBase* ComponentClass; // 0x98(0x08)
	bool Ignore; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	struct FVector ScaleOffset; // 0xa4(0x0c)
	enum class EAttachLocation LocationType; // 0xb0(0x01)
	bool OptionSeeThrough; // 0xb1(0x01)
	bool IsRegistToChara; // 0xb2(0x01)
	bool IsInterruptTelepo; // 0xb3(0x01)
	struct FBoolVector SocketLocation; // 0xb4(0x03)
	struct FBoolVector SocketRotation; // 0xb7(0x03)
	enum class ERSParticleSystemAttachRotationOffMode SocketRotationOffMode; // 0xba(0x01)
	struct FBoolVector SocketScale; // 0xbb(0x03)
	enum class ESequencerDilationOwner DilationOwner; // 0xbe(0x01)
	char pad_BF[0x1]; // 0xbf(0x01)
	struct UParticleComponentListManager* ParticleComponentManager; // 0xc0(0x08)
	char pad_C8[0x8]; // 0xc8(0x08)
};

// Class BattlePrototype.AnimNotify_RSPlayParticleEffect_SASCopyBase
// Size: 0xd0 (Inherited: 0xd0)
struct UAnimNotify_RSPlayParticleEffect_SASCopyBase : UAnimNotify_RSPlayParticleEffect {

	bool CheckExecNotify(struct USkeletalMeshComponent* MeshComp); // Function BattlePrototype.AnimNotify_RSPlayParticleEffect_SASCopyBase.CheckExecNotify // (Event|Protected|BlueprintEvent|Const) // @ game+0x1685580
};

// Class BattlePrototype.AnimNotify_RSPlayParticleEffectWithCondition
// Size: 0xd0 (Inherited: 0xd0)
struct UAnimNotify_RSPlayParticleEffectWithCondition : UAnimNotify_RSPlayParticleEffect {

	bool CheckCondition(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function BattlePrototype.AnimNotify_RSPlayParticleEffectWithCondition.CheckCondition // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11762c0
};

// Class BattlePrototype.AnimNotifyState_DirectionControl
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_DirectionControl : UAnimNotifyState {
};

// Class BattlePrototype.AnimNotifyState_RSTimedFootStepEffect
// Size: 0x98 (Inherited: 0x30)
struct UAnimNotifyState_RSTimedFootStepEffect : UAnimNotifyState {
	struct URSParticleSystemComponentBase* ComponentClass; // 0x30(0x08)
	struct FName ActionType; // 0x38(0x08)
	struct FVector HitSegmentOffset; // 0x40(0x0c)
	bool Ignore; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	struct FVector ScaleOffset; // 0x50(0x0c)
	enum class EAttachLocation LocationType; // 0x5c(0x01)
	bool OptionSeeThrough; // 0x5d(0x01)
	struct FBoolVector SocketLocation; // 0x5e(0x03)
	struct FBoolVector SocketRotation; // 0x61(0x03)
	struct FBoolVector SocketScale; // 0x64(0x03)
	char pad_67[0x1]; // 0x67(0x01)
	struct FName SocketName; // 0x68(0x08)
	struct FVector LocationOffset; // 0x70(0x0c)
	struct FRotator RotationOffset; // 0x7c(0x0c)
	enum class ESequencerDilationOwner DilationOwner; // 0x88(0x01)
	char pad_89[0x7]; // 0x89(0x07)
	struct URSParticleSystemComponentBase* m_pParticle; // 0x90(0x08)
};

// Class BattlePrototype.AnimNotifyState_RSTimedParticleSystem
// Size: 0x88 (Inherited: 0x60)
struct UAnimNotifyState_RSTimedParticleSystem : UAnimNotifyState_TimedParticleEffect {
	struct URSParticleSystemComponentBase* ComponentClass; // 0x60(0x08)
	bool Ignore; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct FVector ScaleOffset; // 0x6c(0x0c)
	enum class EAttachLocation LocationType; // 0x78(0x01)
	bool OptionSeeThrough; // 0x79(0x01)
	bool IsRegistToChara; // 0x7a(0x01)
	bool IsInterruptTelepo; // 0x7b(0x01)
	struct FBoolVector SocketLocation; // 0x7c(0x03)
	struct FBoolVector SocketRotation; // 0x7f(0x03)
	enum class ERSParticleSystemAttachRotationOffMode SocketRotationOffMode; // 0x82(0x01)
	struct FBoolVector SocketScale; // 0x83(0x03)
	enum class ESequencerDilationOwner DilationOwner; // 0x86(0x01)
	char pad_87[0x1]; // 0x87(0x01)
};

// Class BattlePrototype.AnimNotifyState_RSTimedParticleSystem_SASCopyBase
// Size: 0x88 (Inherited: 0x88)
struct UAnimNotifyState_RSTimedParticleSystem_SASCopyBase : UAnimNotifyState_RSTimedParticleSystem {

	bool CheckExecNotifyBegin(struct USkeletalMeshComponent* MeshComp); // Function BattlePrototype.AnimNotifyState_RSTimedParticleSystem_SASCopyBase.CheckExecNotifyBegin // (Event|Protected|BlueprintEvent|Const) // @ game+0x1685580
};

// Class BattlePrototype.AnimNotifyState_RSTimedParticleSystemWithCondition
// Size: 0x88 (Inherited: 0x88)
struct UAnimNotifyState_RSTimedParticleSystemWithCondition : UAnimNotifyState_RSTimedParticleSystem {

	bool CheckCondition(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function BattlePrototype.AnimNotifyState_RSTimedParticleSystemWithCondition.CheckCondition // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1179ec0
};

// Class BattlePrototype.AnimNotifyState_RSTrail
// Size: 0x98 (Inherited: 0x58)
struct UAnimNotifyState_RSTrail : UAnimNotifyState_Trail {
	char pad_58[0x1]; // 0x58(0x01)
	bool bPlayerCopyMode; // 0x59(0x01)
	bool bIgnoreOriginal; // 0x5a(0x01)
	bool bIgnoreCopy; // 0x5b(0x01)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct URSParticleSystemComponentBase* ComponentClass; // 0x60(0x08)
	bool Ignore; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UParticleComponentListManager* ParticleComponentManager; // 0x70(0x08)
	float WidthScale; // 0x78(0x04)
	float FadeOutStart; // 0x7c(0x04)
	struct FName FadeOutMaterialScalarName; // 0x80(0x08)
	bool OptionSeeThrough; // 0x88(0x01)
	enum class ESequencerDilationOwner DilationOwner; // 0x89(0x01)
	bool IsRegistToChara; // 0x8a(0x01)
	bool IsInterruptTelepo; // 0x8b(0x01)
	char pad_8C[0xc]; // 0x8c(0x0c)
};

// Class BattlePrototype.AnimNotifyState_SuperArmor
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_SuperArmor : UAnimNotifyState {
	int32_t ResistStagger; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class BattlePrototype.AnyObjectCreator
// Size: 0x58 (Inherited: 0x28)
struct UAnyObjectCreator : UObject {
	struct AActor* SpawnClass; // 0x28(0x08)
	struct AActor* SpawnObject; // 0x30(0x08)
	bool bSuccessConstruct; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString LoadAssetName; // 0x40(0x10)
	struct UObject* LoadedObject; // 0x50(0x08)
};

// Class BattlePrototype.DebuggingItemAppVersionGroup
// Size: 0x2e0 (Inherited: 0x2d0)
struct ADebuggingItemAppVersionGroup : ADebuggingItemGroup {
	struct TWeakObjectPtr<struct ADebuggingItemLabel> DispLabel; // 0x2d0(0x08)
	struct TWeakObjectPtr<struct ADebuggingItemInt> VersionInt; // 0x2d8(0x08)

	void OnPageOpened(); // Function BattlePrototype.DebuggingItemAppVersionGroup.OnPageOpened // (Final|Native|Public) // @ game+0x8518d0
	void OnExecChangeReleaseVersion(struct ADebuggingItemEvent* Item); // Function BattlePrototype.DebuggingItemAppVersionGroup.OnExecChangeReleaseVersion // (Final|Native|Public) // @ game+0x79d490
};

// Class BattlePrototype.ArrangeItemBase
// Size: 0x318 (Inherited: 0x230)
struct AArrangeItemBase : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	bool isDoBeginPlay; // 0x238(0x01)
	char pad_239[0x7]; // 0x239(0x07)
	struct UChildActorComponent* ChildActionIcon; // 0x240(0x08)
	struct FName ActionIconSupportParamID; // 0x248(0x08)
	struct FVector ActionIconWorldPositionOffset; // 0x250(0x0c)
	enum class EActionIconType actionIconType; // 0x25c(0x01)
	char pad_25D[0x3]; // 0x25d(0x03)
	struct FString ID; // 0x260(0x10)
	struct FString RandomArrangeItemID; // 0x270(0x10)
	char pad_280[0x4]; // 0x280(0x04)
	int32_t LevelID; // 0x284(0x04)
	int32_t GroupID; // 0x288(0x04)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct FString ArrangeItemId; // 0x290(0x10)
	struct FArrangeItemDataCell ArrangeItemDataCell; // 0x2a0(0x28)
	bool Acquired; // 0x2c8(0x01)
	bool isInvisivleInEvent; // 0x2c9(0x01)
	char pad_2CA[0x6]; // 0x2ca(0x06)
	double IntervalTime; // 0x2d0(0x08)
	struct FName OnScenarioFlagName; // 0x2d8(0x08)
	struct USoundAtomCue* AddItemSeCue; // 0x2e0(0x08)
	struct USoundAtomCue* AcquisitionFailureSound; // 0x2e8(0x08)
	struct UBoxComponent* ShowBoxComponent; // 0x2f0(0x08)
	struct UBoxComponent* EventBoxComponent; // 0x2f8(0x08)
	char pad_300[0x6]; // 0x300(0x06)
	bool WhetherToGetFullItem; // 0x306(0x01)
	enum class EArrangeItemBrainTalkType BrainTalkType; // 0x307(0x01)
	bool bAutoGet; // 0x308(0x01)
	char pad_309[0x3]; // 0x309(0x03)
	struct FVector EvetBoxSize; // 0x30c(0x0c)

	void SetVisible(bool Flag); // Function BattlePrototype.ArrangeItemBase.SetVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x117af10
	void Setup(); // Function BattlePrototype.ArrangeItemBase.Setup // (Final|Native|Public|BlueprintCallable) // @ game+0x117b0a0
	void RestoreVisible(); // Function BattlePrototype.ArrangeItemBase.RestoreVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x117aa80
	void OnRebirth(bool IsInitialize); // Function BattlePrototype.ArrangeItemBase.OnRebirth // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x117a8a0
	void OnBindShowBoxBeginOverlap(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BattlePrototype.ArrangeItemBase.OnBindShowBoxBeginOverlap // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x117a500
	void OnBindAcquire(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function BattlePrototype.ArrangeItemBase.OnBindAcquire // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x117a310
	void OnAcquire(bool IsInitialize); // Function BattlePrototype.ArrangeItemBase.OnAcquire // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x117a280
};

// Class BattlePrototype.ArrangeItemIDSetter
// Size: 0x28 (Inherited: 0x28)
struct UArrangeItemIDSetter : UBlueprintFunctionLibrary {
};

// Class BattlePrototype.ArrangeItemManager
// Size: 0x2c0 (Inherited: 0x230)
struct AArrangeItemManager : AActor {
	char pad_230[0x18]; // 0x230(0x18)
	struct TArray<struct FArrangeItemListForSaveData> m_allArrangeItemList; // 0x248(0x10)
	struct TArray<struct FRandomArrangeItemIDInfo> m_allRandomArrangeItemIDInfo; // 0x258(0x10)
	double m_timerCount; // 0x268(0x08)
	struct FDelegate OnChangeMinimapStateDelegate; // 0x270(0x10)
	struct FMulticastInlineDelegate OnAcquireDispather; // 0x280(0x10)
	struct FMulticastInlineDelegate OnRebirthDispather; // 0x290(0x10)
	double m_LotteryPrintDispEndTime; // 0x2a0(0x08)
	struct TArray<struct FString> m_LotteryPrintTextList; // 0x2a8(0x10)
	bool m_isLotteryPrintDispDrawed; // 0x2b8(0x01)
	bool m_isDebugLotteryPrintDispFlag; // 0x2b9(0x01)
	bool m_isDebugForceRepopTimeFlag; // 0x2ba(0x01)
	char pad_2BB[0x1]; // 0x2bb(0x01)
	float m_debugForceRepopTime; // 0x2bc(0x04)

	bool SetRebirth(struct FName ID); // Function BattlePrototype.ArrangeItemManager.SetRebirth // (Final|Native|Public|BlueprintCallable) // @ game+0x117ae80
	void SetRandomArrangeParam2Actor(struct AArrangeItemBase* _actor); // Function BattlePrototype.ArrangeItemManager.SetRandomArrangeParam2Actor // (Final|Native|Public|BlueprintCallable) // @ game+0x117ae00
	bool SetIntervalTime(struct FName ID, float arrangeItemIntervaltime, float resultIntervalTime); // Function BattlePrototype.ArrangeItemManager.SetIntervalTime // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x117acf0
	bool SetAcquired(struct FName ID, bool Flag); // Function BattlePrototype.ArrangeItemManager.SetAcquired // (Final|Native|Public|BlueprintCallable) // @ game+0x117ab60
	bool SetAccessed(struct FName ID, bool Flag); // Function BattlePrototype.ArrangeItemManager.SetAccessed // (Final|Native|Public|BlueprintCallable) // @ game+0x117aaa0
	bool GetArrangeItemParam(struct FName ID, float IntervalTime, bool Acquired, bool Accessed); // Function BattlePrototype.ArrangeItemManager.GetArrangeItemParam // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1179f90
	void ChangeAreaWork(); // Function BattlePrototype.ArrangeItemManager.ChangeAreaWork // (Final|Native|Public|BlueprintCallable) // @ game+0x1179ea0
};

// Class BattlePrototype.ArrangeItemParticle
// Size: 0x340 (Inherited: 0x318)
struct AArrangeItemParticle : AArrangeItemBase {
	struct URSParticleSystemComponentBase* ParticleComponent; // 0x318(0x08)
	struct URSParticleSystemComponentBase* ParticleComponentSub1; // 0x320(0x08)
	struct URSParticleSystemComponentBase* AcquiredParticleComponent; // 0x328(0x08)
	struct URSParticleSystemComponentBase* AcquiredParticleComponentSub1; // 0x330(0x08)
	struct USoundAtomCue* AcquiredSeCue; // 0x338(0x08)

	struct UParticleSystem* GetEmitterTemplate(); // Function BattlePrototype.ArrangeItemParticle.GetEmitterTemplate // (Native|Event|Public|BlueprintEvent) // @ game+0x117a1c0
};

// Class BattlePrototype.ArrangeItemParticleEvent
// Size: 0x340 (Inherited: 0x340)
struct AArrangeItemParticleEvent : AArrangeItemParticle {

	bool DoEvent(); // Function BattlePrototype.ArrangeItemParticleEvent.DoEvent // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
};

// Class BattlePrototype.ArrangeObject
// Size: 0x2a8 (Inherited: 0x230)
struct AArrangeObject : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	bool isDoBeginPlay; // 0x238(0x01)
	char pad_239[0x3]; // 0x239(0x03)
	int32_t ID; // 0x23c(0x04)
	int32_t LevelID; // 0x240(0x04)
	int32_t GroupID; // 0x244(0x04)
	struct UStaticMeshComponent* ArrangeMesh; // 0x248(0x08)
	struct FVector FirstPosition; // 0x250(0x0c)
	struct FRotator FirstRotation; // 0x25c(0x0c)
	struct FVector TempPosition; // 0x268(0x0c)
	struct FRotator TempRotation; // 0x274(0x0c)
	struct UFootStepComponent* FootStepComponent; // 0x280(0x08)
	struct TArray<struct FHitActorInfo> HitActorList; // 0x288(0x10)
	float HitSeInterval; // 0x298(0x04)
	float PlaySeVelocity; // 0x29c(0x04)
	float PlayRunSeVelocity; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)

	void OnHitCallback(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult Hit); // Function BattlePrototype.ArrangeObject.OnHitCallback // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x117a6f0
};

// Class BattlePrototype.ArrangeObjectManager
// Size: 0x38 (Inherited: 0x28)
struct UArrangeObjectManager : UObject {
	struct TArray<struct AArrangeObject*> ArrangeObjects; // 0x28(0x10)

	void UnregisterObjectAll(); // Function BattlePrototype.ArrangeObjectManager.UnregisterObjectAll // (Native|Public|BlueprintCallable) // @ game+0x117b150
	void UnregisterObject(struct AArrangeObject* ArrangeObject); // Function BattlePrototype.ArrangeObjectManager.UnregisterObject // (Native|Public|BlueprintCallable) // @ game+0x117b0c0
	void SetVisible(bool IsVisible, int32_t LevelID, int32_t GroupID); // Function BattlePrototype.ArrangeObjectManager.SetVisible // (Final|Native|Public|BlueprintCallable) // @ game+0x117afa0
	void SetEnableCollision(bool Flag, bool bHiddenCheck); // Function BattlePrototype.ArrangeObjectManager.SetEnableCollision // (Final|Native|Public|BlueprintCallable) // @ game+0x117ac20
	void RestoreObjectInfo(int32_t LevelID, int32_t GroupID); // Function BattlePrototype.ArrangeObjectManager.RestoreObjectInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x117a9c0
	void RestoreFirstObjectInfo(int32_t LevelID, int32_t GroupID); // Function BattlePrototype.ArrangeObjectManager.RestoreFirstObjectInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x117a9c0
	void RegisterObject(struct AArrangeObject* ArrangeObject); // Function BattlePrototype.ArrangeObjectManager.RegisterObject // (Native|Public|BlueprintCallable) // @ game+0x117a930
	void Initialize(struct UObject* WorldContextObject); // Function BattlePrototype.ArrangeObjectManager.Initialize // (Native|Public|BlueprintCallable) // @ game+0x117a1f0
	struct AArrangeObject* GetArrangeObject(int32_t ID); // Function BattlePrototype.ArrangeObjectManager.GetArrangeObject // (Final|Native|Public|BlueprintCallable) // @ game+0x117a130
	void BackupObjectInfo(int32_t LevelID, int32_t GroupID); // Function BattlePrototype.ArrangeObjectManager.BackupObjectInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1179de0
	void BackupFirstObjectInfo(int32_t LevelID, int32_t GroupID); // Function BattlePrototype.ArrangeObjectManager.BackupFirstObjectInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1179de0
};

// Class BattlePrototype.AssetFuncLib
// Size: 0x28 (Inherited: 0x28)
struct UAssetFuncLib : UBlueprintFunctionLibrary {

	void SetForceMipLevelsToBeResidentByTexture(struct UTexture2D* Texture, float Seconds, int32_t CinematicLODGroupMask, bool HighProirity); // Function BattlePrototype.AssetFuncLib.SetForceMipLevelsToBeResidentByTexture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117fc90
	void SetForceMipLevelsToBeResidentBySkeletalMeshComp(struct USkeletalMeshComponent* SkelMeshComp, float Seconds, int32_t CinematicLODGroupMask, bool HighProirity); // Function BattlePrototype.AssetFuncLib.SetForceMipLevelsToBeResidentBySkeletalMeshComp // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117fb50
	void SetChapterChunkPriority(int32_t ChapterNo); // Function BattlePrototype.AssetFuncLib.SetChapterChunkPriority // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xd6c4f0
	void ResetForceMipLevelsToBeResidentByTexture(struct UTexture2D* Texture); // Function BattlePrototype.AssetFuncLib.ResetForceMipLevelsToBeResidentByTexture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117f780
	void ResetForceMipLevelsToBeResidentBySkeletalMeshComp(struct USkeletalMeshComponent* SkelMeshComp); // Function BattlePrototype.AssetFuncLib.ResetForceMipLevelsToBeResidentBySkeletalMeshComp // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117f710
	struct FString ObjectSoftRefToStringRaw(struct TSoftObjectPtr<UObject> Object); // Function BattlePrototype.AssetFuncLib.ObjectSoftRefToStringRaw // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x117f140
	struct FString ObjectSoftRefToString(struct TSoftObjectPtr<UObject> Object); // Function BattlePrototype.AssetFuncLib.ObjectSoftRefToString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x117f040
	struct FName ObjectSoftRefToName(struct TSoftObjectPtr<UObject> Object); // Function BattlePrototype.AssetFuncLib.ObjectSoftRefToName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x117ef80
	void ModifyAssets(struct TArray<struct UObject*> Assets); // Function BattlePrototype.AssetFuncLib.ModifyAssets // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117eeb0
	bool IsReadyForceMipLevelsToBeResidentByTexture(struct UTexture2D* Texture); // Function BattlePrototype.AssetFuncLib.IsReadyForceMipLevelsToBeResidentByTexture // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117ed70
	bool IsFullInstallPackage(); // Function BattlePrototype.AssetFuncLib.IsFullInstallPackage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117ed40
	bool IsChunkLoaded(int32_t ChunkId, bool isNotExistError); // Function BattlePrototype.AssetFuncLib.IsChunkLoaded // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117eb20
	bool IsChapterChunkLoaded(int32_t ChapterNo); // Function BattlePrototype.AssetFuncLib.IsChapterChunkLoaded // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117ea10
	struct FString GetPrimaryAssetPath(struct FPrimaryAssetId PrimaryAssetId); // Function BattlePrototype.AssetFuncLib.GetPrimaryAssetPath // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x117e620
	bool GetPackagePath(struct UObject* Object, struct FName OutName); // Function BattlePrototype.AssetFuncLib.GetPackagePath // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x117e550
	struct TArray<struct FName> GetAssetSoftDependencies(struct FName AssetName); // Function BattlePrototype.AssetFuncLib.GetAssetSoftDependencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x117e200
	struct TArray<struct FName> GetAssetSearchableNameDependencies(struct FName AssetName); // Function BattlePrototype.AssetFuncLib.GetAssetSearchableNameDependencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x117e130
	struct TArray<struct FName> GetAssetPackagesDependencies(struct FName AssetName); // Function BattlePrototype.AssetFuncLib.GetAssetPackagesDependencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x117e060
	struct TArray<struct FName> GetAssetManageDependencies(struct FName AssetName); // Function BattlePrototype.AssetFuncLib.GetAssetManageDependencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x117df90
	struct TArray<struct FName> GetAssetHardDependencies(struct FName AssetName); // Function BattlePrototype.AssetFuncLib.GetAssetHardDependencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x117dec0
	struct TArray<struct FName> GetAssetDependencies(struct FName AssetName, bool hard, bool soft, bool searchableName, bool manage); // Function BattlePrototype.AssetFuncLib.GetAssetDependencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x117dcb0
	struct TArray<struct FName> GetAssetAllDependencies(struct FName AssetName); // Function BattlePrototype.AssetFuncLib.GetAssetAllDependencies // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x117dbe0
};

// Class BattlePrototype.AssetLoadComponent
// Size: 0xe0 (Inherited: 0xc0)
struct UAssetLoadComponent : UActorComponent {
	struct USoundAtomCueSheet* SoundCueSheet; // 0xc0(0x08)
	struct TArray<struct UParticleSystem*> ParticleList; // 0xc8(0x10)
	char pad_D8[0x8]; // 0xd8(0x08)
};

// Class BattlePrototype.AssetMemoryData
// Size: 0x50 (Inherited: 0x28)
struct UAssetMemoryData : UObject {
	struct FName ObjectPath; // 0x28(0x08)
	struct FName AssetName; // 0x30(0x08)
	struct FName AssetClass; // 0x38(0x08)
	uint64_t PhysicalSize; // 0x40(0x08)
	uint64_t VirtualSize; // 0x48(0x08)
};

// Class BattlePrototype.AttachEffectBackgroundVolume
// Size: 0x290 (Inherited: 0x268)
struct AAttachEffectBackgroundVolume : AVolume {
	struct TArray<struct AEffectBackground*> Particles; // 0x268(0x10)
	bool Subtract; // 0x278(0x01)
	bool Unbound; // 0x279(0x01)
	char pad_27A[0x16]; // 0x27a(0x16)

	void OnActorEndOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.AttachEffectBackgroundVolume.OnActorEndOverlapFunc // (Final|Native|Public) // @ game+0x117f300
	void OnActorBeginOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.AttachEffectBackgroundVolume.OnActorBeginOverlapFunc // (Final|Native|Public) // @ game+0x117f240
};

// Class BattlePrototype.AttackComponentBase
// Size: 0xf0 (Inherited: 0xc0)
struct UAttackComponentBase : UActorComponent {
	char pad_C0[0x10]; // 0xc0(0x10)
	struct UPlayerAnimControllerComponent* _animCon; // 0xd0(0x08)
	char pad_D8[0x18]; // 0xd8(0x18)

	void SpawnSASVisionActor(struct AActor* ActorClass, struct FName locationTagName, bool bFollow); // Function BattlePrototype.AttackComponentBase.SpawnSASVisionActor // (Final|Native|Public|BlueprintCallable) // @ game+0x117fe50
	void SetAttackInputKind(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackComponentBase.SetAttackInputKind // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x117f810
	void SetAttacking(bool bAttacking, bool bAddComboCount); // Function BattlePrototype.AttackComponentBase.SetAttacking // (Final|Native|Protected|BlueprintCallable) // @ game+0x117f8b0
	bool OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function BattlePrototype.AttackComponentBase.OnMontageEnded // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool OnMontageBlendingOut(struct UAnimMontage* Montage, bool bInterrupted); // Function BattlePrototype.AttackComponentBase.OnMontageBlendingOut // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool OnCustomAttackTimingNotified(struct FString CustomName); // Function BattlePrototype.AttackComponentBase.OnCustomAttackTimingNotified // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool OnChangeAttacking(bool bAttacking); // Function BattlePrototype.AttackComponentBase.OnChangeAttacking // (Event|Protected|BlueprintEvent) // @ game+0x1685580
	void OnChangeAnimKind(enum class PlayerAnimKind NewKind, enum class PlayerAnimKind OldKind); // Function BattlePrototype.AttackComponentBase.OnChangeAnimKind // (Final|Native|Public|BlueprintCallable) // @ game+0x117f490
	bool IsAttacking(); // Function BattlePrototype.AttackComponentBase.IsAttacking // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11739c0
	bool IsAttackCombo(); // Function BattlePrototype.AttackComponentBase.IsAttackCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117e8f0
	bool InputButtonByCombo(bool bPressed, bool bComboFirst); // Function BattlePrototype.AttackComponentBase.InputButtonByCombo // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct UPlayerAnimControllerComponent* GetOwnerAnimCon(); // Function BattlePrototype.AttackComponentBase.GetOwnerAnimCon // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e530
	int32_t GetBranchComboCount(); // Function BattlePrototype.AttackComponentBase.GetBranchComboCount // (Event|Public|BlueprintEvent|Const) // @ game+0x1685580
	enum class RSAttackInputKind GetBranchComboAttackInputKind(); // Function BattlePrototype.AttackComponentBase.GetBranchComboAttackInputKind // (Event|Public|BlueprintEvent|Const) // @ game+0x1685580
	enum class RSAttackInputKind GetAttackInputKind(); // Function BattlePrototype.AttackComponentBase.GetAttackInputKind // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e2f0
	struct UAttackInputComponent* GetAttackInputComponent(); // Function BattlePrototype.AttackComponentBase.GetAttackInputComponent // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e2d0
	struct UAttackComponentBase* FindAttackingComponent(struct AActor* Actor); // Function BattlePrototype.AttackComponentBase.FindAttackingComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117dad0
	struct UAttackComponentBase* FindAttackComponentBySASVisionActor(struct AActor* Actor, struct AActor* ActorClass); // Function BattlePrototype.AttackComponentBase.FindAttackComponentBySASVisionActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x117da10
	void DisappearSASVisionActor(); // Function BattlePrototype.AttackComponentBase.DisappearSASVisionActor // (Final|Native|Public|BlueprintCallable) // @ game+0x117d9f0
	void DestroySASVisionActor(); // Function BattlePrototype.AttackComponentBase.DestroySASVisionActor // (Final|Native|Public|BlueprintCallable) // @ game+0x117d9d0
	void ClearInputAll(); // Function BattlePrototype.AttackComponentBase.ClearInputAll // (Final|Native|Public|BlueprintCallable) // @ game+0x117d8d0
	bool ClearInput(); // Function BattlePrototype.AttackComponentBase.ClearInput // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CheckStartAttack(float DeltaTime); // Function BattlePrototype.AttackComponentBase.CheckStartAttack // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void AddComboCount(); // Function BattlePrototype.AttackComponentBase.AddComboCount // (Final|Native|Protected|BlueprintCallable) // @ game+0x117d410
};

// Class BattlePrototype.AttackInputComponent
// Size: 0x2ea8 (Inherited: 0xc0)
struct UAttackInputComponent : UActorComponent {
	struct FMulticastInlineDelegate OnComboInputEnd; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnChangePsychicComboLevel; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnChangeFlyingPsychicComboLevel; // 0xe0(0x10)
	char pad_F0[0x2da0]; // 0xf0(0x2da0)
	struct TArray<struct UAttackComponentBase*> _inputAttackComponentList; // 0x2e90(0x10)
	char pad_2EA0[0x8]; // 0x2ea0(0x08)

	void UnregisterCurrentAttackComponent(struct UAttackComponentBase* attackComp); // Function BattlePrototype.AttackInputComponent.UnregisterCurrentAttackComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x117ff60
	void SetPsychicComboLevel(int32_t PsychicComboLevel); // Function BattlePrototype.AttackInputComponent.SetPsychicComboLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x117fdd0
	void SetFlyingPsychicComboLevel(int32_t PsychicComboLevel); // Function BattlePrototype.AttackInputComponent.SetFlyingPsychicComboLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x117fad0
	void SetDisableCombo(enum class RSAttackInputKind kind, bool bDisable); // Function BattlePrototype.AttackInputComponent.SetDisableCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117fa00
	void SetComboAttackInputKind(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.SetComboAttackInputKind // (Final|Native|Public|BlueprintCallable) // @ game+0x117f980
	void SetAttackedFlyingCombo(); // Function BattlePrototype.AttackInputComponent.SetAttackedFlyingCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117f890
	void ResetPsychicComboLevel(); // Function BattlePrototype.AttackInputComponent.ResetPsychicComboLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x117f7f0
	void ResetFlyingCombo(); // Function BattlePrototype.AttackInputComponent.ResetFlyingCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117f6f0
	void ResetComboByInputKind(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.ResetComboByInputKind // (Final|Native|Public|BlueprintCallable) // @ game+0x117f670
	void ResetCombo(); // Function BattlePrototype.AttackInputComponent.ResetCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117f650
	void RegisterCurrentAttackComponent(struct UAttackComponentBase* attackComp); // Function BattlePrototype.AttackInputComponent.RegisterCurrentAttackComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x117f5d0
	void OverwriteComboCount(int32_t comboCount); // Function BattlePrototype.AttackInputComponent.OverwriteComboCount // (Final|Native|Public|BlueprintCallable) // @ game+0x117f550
	void OnAttackComponentChangeAttacking(struct UAttackComponentBase* attackComp, bool bAttacking); // Function BattlePrototype.AttackInputComponent.OnAttackComponentChangeAttacking // (Final|Native|Protected) // @ game+0x117f3c0
	bool IsWaitPsychicCombo(); // Function BattlePrototype.AttackInputComponent.IsWaitPsychicCombo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117ee80
	bool IsRegisterCombo(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.IsRegisterCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117edf0
	bool IsDisableCombo(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.IsDisableCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117ecb0
	bool IsComboInterval(enum class RSAttackInputKind kind, bool bCheckWaitFlag); // Function BattlePrototype.AttackInputComponent.IsComboInterval // (Final|Native|Public|BlueprintCallable) // @ game+0x117ebe0
	bool IsCheckStartAttack(enum class RSAttackInputKind AttackKind); // Function BattlePrototype.AttackInputComponent.IsCheckStartAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x117ea90
	bool IsAttackingByKind(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.IsAttackingByKind // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x117e980
	bool IsAttacking(); // Function BattlePrototype.AttackInputComponent.IsAttacking // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x117e950
	bool IsAttackedFlyingCombo(); // Function BattlePrototype.AttackInputComponent.IsAttackedFlyingCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x117e920
	void InputAttackByPC(enum class RSAttackInputKind inputKind, bool bPressed); // Function BattlePrototype.AttackInputComponent.InputAttackByPC // (Final|Native|Public|BlueprintCallable) // @ game+0x117e820
	int32_t GetRemainUseCount(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.GetRemainUseCount // (Final|Native|Public|BlueprintCallable) // @ game+0x117e790
	int32_t GetPsychicComboLevelMax(); // Function BattlePrototype.AttackInputComponent.GetPsychicComboLevelMax // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e760
	int32_t GetPsychicComboLevel(); // Function BattlePrototype.AttackInputComponent.GetPsychicComboLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e730
	int32_t GetPsychicComboCount(); // Function BattlePrototype.AttackInputComponent.GetPsychicComboCount // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x117e700
	struct TArray<struct UAttackComponentBase*> GetInputAttackComponentList(); // Function BattlePrototype.AttackInputComponent.GetInputAttackComponentList // (Final|Native|Public|BlueprintCallable) // @ game+0x117e4b0
	int32_t GetFlyingPsychicComboLevelMax(); // Function BattlePrototype.AttackInputComponent.GetFlyingPsychicComboLevelMax // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e480
	int32_t GetFlyingPsychicComboLevel(); // Function BattlePrototype.AttackInputComponent.GetFlyingPsychicComboLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e450
	struct FName GetComboPattern(); // Function BattlePrototype.AttackInputComponent.GetComboPattern // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e410
	int32_t GetComboCountByInputKind(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.GetComboCountByInputKind // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e380
	int32_t GetComboCount(); // Function BattlePrototype.AttackInputComponent.GetComboCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e350
	enum class RSAttackInputKind GetComboAttackInputKind(); // Function BattlePrototype.AttackInputComponent.GetComboAttackInputKind // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x117e320
	struct UAttackComponentBase* FindAttackingComponent(enum class RSAttackInputKind kind); // Function BattlePrototype.AttackInputComponent.FindAttackingComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x117db50
	void DebugSetComboDisp(bool bDisp); // Function BattlePrototype.AttackInputComponent.DebugSetComboDisp // (Final|Native|Public|BlueprintCallable) // @ game+0x117d950
	void ClearUseCount(); // Function BattlePrototype.AttackInputComponent.ClearUseCount // (Final|Native|Public|BlueprintCallable) // @ game+0x117d930
	void ClearPsychicComboCount(); // Function BattlePrototype.AttackInputComponent.ClearPsychicComboCount // (Final|Native|Public|BlueprintCallable) // @ game+0x117d910
	void ClearInputAll(); // Function BattlePrototype.AttackInputComponent.ClearInputAll // (Final|Native|Public|BlueprintCallable) // @ game+0x117d8f0
	void ClearComboPattern(struct FName patternName); // Function BattlePrototype.AttackInputComponent.ClearComboPattern // (Final|Native|Public|BlueprintCallable) // @ game+0x117d850
	void CheckStartAttack(float DeltaTime); // Function BattlePrototype.AttackInputComponent.CheckStartAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x117d7d0
	void ChangeComboPattern(struct FName patternName); // Function BattlePrototype.AttackInputComponent.ChangeComboPattern // (Final|Native|Public|BlueprintCallable) // @ game+0x117d750
	void BeginComboInterval(); // Function BattlePrototype.AttackInputComponent.BeginComboInterval // (Final|Native|Public|BlueprintCallable) // @ game+0x117d730
	void AddPsychicComboCount(); // Function BattlePrototype.AttackInputComponent.AddPsychicComboCount // (Final|Native|Public|BlueprintCallable) // @ game+0x117d710
	void AddComboPattern(struct FName patternName, enum class RSAttackInputKind inputKind, struct TArray<struct UAttackComponentBase*> attackComps, float comboInterval, int32_t maxUseCount); // Function BattlePrototype.AttackInputComponent.AddComboPattern // (Final|Native|Public|BlueprintCallable) // @ game+0x117d530
	void AddComboCount(enum class RSAttackInputKind kind, enum class RSAttackInputKind branchKind, int32_t branchComboCount); // Function BattlePrototype.AttackInputComponent.AddComboCount // (Final|Native|Public|BlueprintCallable) // @ game+0x117d430
};

// Class BattlePrototype.AttackPropertyMediatorComponent
// Size: 0x110 (Inherited: 0xc0)
struct UAttackPropertyMediatorComponent : UActorComponent {
	char pad_C0[0x50]; // 0xc0(0x50)

	void SetAttackRate(struct FName ClaimantName, float AttackRate); // Function BattlePrototype.AttackPropertyMediatorComponent.SetAttackRate // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1184a00
	struct UAttackPropertyMediatorComponent* GetAttackPropertyMediator(struct AActor* Actor); // Function BattlePrototype.AttackPropertyMediatorComponent.GetAttackPropertyMediator // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1183f90
	struct UAttackPropertyMediatorComponent* FindAttackPropertyMediator(struct AActor* Actor); // Function BattlePrototype.AttackPropertyMediatorComponent.FindAttackPropertyMediator // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1183f90
	void ClearAttackRate(struct FName ClaimantName); // Function BattlePrototype.AttackPropertyMediatorComponent.ClearAttackRate // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1183e60
	float CalcTotalAttackRate(); // Function BattlePrototype.AttackPropertyMediatorComponent.CalcTotalAttackRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1183cd0
};

// Class BattlePrototype.AutoAimComponent
// Size: 0x130 (Inherited: 0xc0)
struct UAutoAimComponent : UActorComponent {
	float _aimSpeed; // 0xc0(0x04)
	float _aimSpeedInternalLock; // 0xc4(0x04)
	float _maxAimAngle; // 0xc8(0x04)
	bool _isInternalLock; // 0xcc(0x01)
	bool _isToCamera; // 0xcd(0x01)
	bool _isToBrainCrash; // 0xce(0x01)
	char pad_CF[0x1]; // 0xcf(0x01)
	float _offsetDegree; // 0xd0(0x04)
	enum class EDirectionOfRotation _directionOfRotation; // 0xd4(0x01)
	char pad_D5[0x3]; // 0xd5(0x03)
	float _frontDegree; // 0xd8(0x04)
	bool _isToWeakPoint; // 0xdc(0x01)
	char pad_DD[0x53]; // 0xdd(0x53)

	void UpdateRotateAim(float DeltaSeconds); // Function BattlePrototype.AutoAimComponent.UpdateRotateAim // (Final|Native|Protected) // @ game+0x1184e10
	float UpdateFromDirectionOfRotation(float Rot, float Sign); // Function BattlePrototype.AutoAimComponent.UpdateFromDirectionOfRotation // (Final|Native|Protected) // @ game+0x1184d40
	void PauseAutoAim(bool bPause); // Function BattlePrototype.AutoAimComponent.PauseAutoAim // (Final|Native|Public|BlueprintCallable) // @ game+0x11848a0
	void LockLocation(bool bLock, struct FVector LockLocation); // Function BattlePrototype.AutoAimComponent.LockLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x11847c0
	bool IsLockLocation(); // Function BattlePrototype.AutoAimComponent.IsLockLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1184640
	bool IsBindOwnerTick(); // Function BattlePrototype.AutoAimComponent.IsBindOwnerTick // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1184430
	struct UAutoAimComponent* GetAutoAimComponentFromActor(struct AActor* Actor); // Function BattlePrototype.AutoAimComponent.GetAutoAimComponentFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1184040
	void EndAutoAim(struct UObject* Notify); // Function BattlePrototype.AutoAimComponent.EndAutoAim // (Final|Native|Public|BlueprintCallable) // @ game+0x1183f10
	void BeginAutoAimLocation(struct UObject* Notify, float aimSpeed, float maxAimAngle, struct FVector aimLocation, struct UMeshComponent* socketRotateMesh, struct FName SocketName, float offsetDegree, enum class EDirectionOfRotation directionOfRotation, float frontDegree); // Function BattlePrototype.AutoAimComponent.BeginAutoAimLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1183a40
	void BeginAutoAim(struct UObject* Notify, float aimSpeed, float maxAimAngle, bool isInternalLock, bool isToCamera, struct AActor* brainCrashActor, struct UMeshComponent* socketRotateMesh, struct FName SocketName, float offsetDegree, enum class EDirectionOfRotation directionOfRotation, float frontDegree, float aimSpeedInternalLock, bool findAimTargetWhenNoTarget, bool isDetectTargetChange, bool isToWeakPoint); // Function BattlePrototype.AutoAimComponent.BeginAutoAim // (Final|Native|Public|BlueprintCallable) // @ game+0x1183620
};

// Class BattlePrototype.AutoRecoverComponent
// Size: 0xd8 (Inherited: 0xc0)
struct UAutoRecoverComponent : UActorComponent {
	float _HPRecoverStartSec; // 0xc0(0x04)
	float _HPRecoverSpeed; // 0xc4(0x04)
	float _autoRecoverHPFraction; // 0xc8(0x04)
	float _PPRecoverStartSec; // 0xcc(0x04)
	float _autoRecoverFullPPSec; // 0xd0(0x04)
	float _autoRecoverPPFraction; // 0xd4(0x04)

	void Setup(float hpRecoverSpeed, float hpRecoverStartSec); // Function BattlePrototype.AutoRecoverComponent.Setup // (Final|Native|Public|BlueprintCallable) // @ game+0x1184c80
	void ProcessAutoRecoverPP(float delataTime, bool enableRecover); // Function BattlePrototype.AutoRecoverComponent.ProcessAutoRecoverPP // (Final|Native|Public|BlueprintCallable) // @ game+0x1184930
	void ProcessAutoRecoverHP(float delataTime, bool enableRecover); // Function BattlePrototype.AutoRecoverComponent.ProcessAutoRecoverHP // (Final|Native|Public|BlueprintCallable) // @ game+0x1184930
};

// Class BattlePrototype.BattleCharacterDebugInterface
// Size: 0x28 (Inherited: 0x28)
struct UBattleCharacterDebugInterface : UInterface {

	bool IsDebugInvincible(); // Function BattlePrototype.BattleCharacterDebugInterface.IsDebugInvincible // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
};

// Class BattlePrototype.BattleCharacterHudInterface
// Size: 0x28 (Inherited: 0x28)
struct UBattleCharacterHudInterface : UInterface {

	bool SetEmphasisCrashGauge(bool bEmphasisCrashGauge); // Function BattlePrototype.BattleCharacterHudInterface.SetEmphasisCrashGauge // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IsSpawnWait(bool bSpawnWait); // Function BattlePrototype.BattleCharacterHudInterface.IsSpawnWait // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsInvisibleMiniMap(); // Function BattlePrototype.BattleCharacterHudInterface.IsInvisibleMiniMap // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void IsInvisibleHPGauge(bool bInvisible); // Function BattlePrototype.BattleCharacterHudInterface.IsInvisibleHPGauge // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void IsHpGaugeAlwaysMax(bool bAlwaysMax); // Function BattlePrototype.BattleCharacterHudInterface.IsHpGaugeAlwaysMax // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsEmphasisCrashGauge(); // Function BattlePrototype.BattleCharacterHudInterface.IsEmphasisCrashGauge // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	int32_t GetWeakNumber(); // Function BattlePrototype.BattleCharacterHudInterface.GetWeakNumber // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetTargetCursorPoint(struct FVector Point); // Function BattlePrototype.BattleCharacterHudInterface.GetTargetCursorPoint // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void GetHpGaugePoint(struct FVector Point); // Function BattlePrototype.BattleCharacterHudInterface.GetHpGaugePoint // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void GetCrashChanceCursorPoint(struct FVector Point); // Function BattlePrototype.BattleCharacterHudInterface.GetCrashChanceCursorPoint // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool BrainCrashUnlock(); // Function BattlePrototype.BattleCharacterHudInterface.BrainCrashUnlock // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
};

// Class BattlePrototype.BattleCharacterInterface
// Size: 0x28 (Inherited: 0x28)
struct UBattleCharacterInterface : UInterface {

	bool VibrationControllerInDamageInterface(struct FHCHitResult HitResult); // Function BattlePrototype.BattleCharacterInterface.VibrationControllerInDamageInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool StopBehaviorTree(bool bTickDisable); // Function BattlePrototype.BattleCharacterInterface.StopBehaviorTree // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ShakeCameraInDamageInterface(struct FHCHitResult HitResult); // Function BattlePrototype.BattleCharacterInterface.ShakeCameraInDamageInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetUseGuts(bool bUse); // Function BattlePrototype.BattleCharacterInterface.SetUseGuts // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1184bf0
	void SetNoDeadEvent(bool noDeadEvent); // Function BattlePrototype.BattleCharacterInterface.SetNoDeadEvent // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetNoCrashChanceEvent(bool noCrashChanceEvent); // Function BattlePrototype.BattleCharacterInterface.SetNoCrashChanceEvent // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetNoCrashChanceByUseGuts(bool bEnable); // Function BattlePrototype.BattleCharacterInterface.SetNoCrashChanceByUseGuts // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1184b60
	void SetInvalidDamageInterface(bool bInvalidDamage, struct FName ClaimantName, int32_t Param); // Function BattlePrototype.BattleCharacterInterface.SetInvalidDamageInterface // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetInfinityCrashChance(bool bEnable); // Function BattlePrototype.BattleCharacterInterface.SetInfinityCrashChance // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1184ad0
	bool SetHiddenCharacterAttachment(bool NewHidden); // Function BattlePrototype.BattleCharacterInterface.SetHiddenCharacterAttachment // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetCounterInterface(); // Function BattlePrototype.BattleCharacterInterface.SetCounterInterface // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetBehaviorTreeTickEnable(bool bEnable); // Function BattlePrototype.BattleCharacterInterface.SetBehaviorTreeTickEnable // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetActorAllTickEnabled(bool bEnabled); // Function BattlePrototype.BattleCharacterInterface.SetActorAllTickEnabled // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool RestartBehaviorTree(bool bTickEnable); // Function BattlePrototype.BattleCharacterInterface.RestartBehaviorTree // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsUseGuts(); // Function BattlePrototype.BattleCharacterInterface.IsUseGuts // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184790
	bool IsUniqueNoDead(); // Function BattlePrototype.BattleCharacterInterface.IsUniqueNoDead // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184760
	bool IsSuperArmorInterface(); // Function BattlePrototype.BattleCharacterInterface.IsSuperArmorInterface // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsNotAbleBrainCrashTarget(); // Function BattlePrototype.BattleCharacterInterface.IsNotAbleBrainCrashTarget // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184730
	bool IsNoDeadTutorial(); // Function BattlePrototype.BattleCharacterInterface.IsNoDeadTutorial // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184700
	bool IsNoDeadEvent(); // Function BattlePrototype.BattleCharacterInterface.IsNoDeadEvent // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11846d0
	bool IsNoCrashChanceEvent(); // Function BattlePrototype.BattleCharacterInterface.IsNoCrashChanceEvent // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11846a0
	bool IsNoCrashChanceByUseGuts(); // Function BattlePrototype.BattleCharacterInterface.IsNoCrashChanceByUseGuts // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184670
	bool IsInfinityCrashChance(); // Function BattlePrototype.BattleCharacterInterface.IsInfinityCrashChance // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184610
	bool IsHitWeakChangeDefaultEffectInterface(); // Function BattlePrototype.BattleCharacterInterface.IsHitWeakChangeDefaultEffectInterface // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsEventCondition(); // Function BattlePrototype.BattleCharacterInterface.IsEventCondition // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11845e0
	bool IsEnableSlashEffectInterface(struct FHCHitResult HitResult); // Function BattlePrototype.BattleCharacterInterface.IsEnableSlashEffectInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsEnableReactionCoefficientInterface(float OutReactionSRate, float OutReactionLRate, float OutDownRate, float OutCrashRate); // Function BattlePrototype.BattleCharacterInterface.IsEnableReactionCoefficientInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsDisableAtomCuePlayInterface(); // Function BattlePrototype.BattleCharacterInterface.IsDisableAtomCuePlayInterface // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x11845b0
	bool IsDeadPsychicObjOnly(); // Function BattlePrototype.BattleCharacterInterface.IsDeadPsychicObjOnly // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184580
	bool IsDeadPsychicObjComboOnly(); // Function BattlePrototype.BattleCharacterInterface.IsDeadPsychicObjComboOnly // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184550
	bool IsDeadPhysicsAttackOnly(); // Function BattlePrototype.BattleCharacterInterface.IsDeadPhysicsAttackOnly // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184520
	bool IsDeadLaunchAttackOnly(); // Function BattlePrototype.BattleCharacterInterface.IsDeadLaunchAttackOnly // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11844f0
	bool IsDeadChaseAttackOnly(); // Function BattlePrototype.BattleCharacterInterface.IsDeadChaseAttackOnly // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11844c0
	bool IsDeadBrainCrashOnly(); // Function BattlePrototype.BattleCharacterInterface.IsDeadBrainCrashOnly // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184490
	bool IsCrashMaxWithGuts(); // Function BattlePrototype.BattleCharacterInterface.IsCrashMaxWithGuts // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184460
	bool IsCounterWaitInterface(); // Function BattlePrototype.BattleCharacterInterface.IsCounterWaitInterface // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsAttractSelfInterface(); // Function BattlePrototype.BattleCharacterInterface.IsAttractSelfInterface // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184400
	bool IsAttackerTargetSelf(struct FHCHitResult HitResult); // Function BattlePrototype.BattleCharacterInterface.IsAttackerTargetSelf // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11842f0
	bool IsAbsoluteVisibilityTrace(); // Function BattlePrototype.BattleCharacterInterface.IsAbsoluteVisibilityTrace // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11842c0
	struct FVector GetWeakTargetPointInterface(struct FVector AttackerPos); // Function BattlePrototype.BattleCharacterInterface.GetWeakTargetPointInterface // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct FVector GetLookAtTargetLocation(); // Function BattlePrototype.BattleCharacterInterface.GetLookAtTargetLocation // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct FVector GetDamageReactionDirInterface(struct FHCHitResult HitResult); // Function BattlePrototype.BattleCharacterInterface.GetDamageReactionDirInterface // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	int32_t GetCharaKind(); // Function BattlePrototype.BattleCharacterInterface.GetCharaKind // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184260
	enum class ECharacterHitPriority GetCharacterHitPriorityInterface(); // Function BattlePrototype.BattleCharacterInterface.GetCharacterHitPriorityInterface // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1184290
	void GetCameraStabilizeParameter(float distLockHz, float distRestoreHz, float distLockVt, float distRestoreVt); // Function BattlePrototype.BattleCharacterInterface.GetCameraStabilizeParameter // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x11840c0
	struct FVector GetAutoAimTargetLocation(); // Function BattlePrototype.BattleCharacterInterface.GetAutoAimTargetLocation // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	enum class EAssassinAttackHit GetAssasinAttackHitType(); // Function BattlePrototype.BattleCharacterInterface.GetAssasinAttackHitType // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1184010
	bool EventStartForceEndBadStatus(); // Function BattlePrototype.BattleCharacterInterface.EventStartForceEndBadStatus // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EndNoDeadNoCrashChanceEvent(); // Function BattlePrototype.BattleCharacterInterface.EndNoDeadNoCrashChanceEvent // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DisEnableNoDeadTutorial(); // Function BattlePrototype.BattleCharacterInterface.DisEnableNoDeadTutorial // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1183ef0
	bool CheckEmphasisCrashGauge(struct FHCHitResult HitResult); // Function BattlePrototype.BattleCharacterInterface.CheckEmphasisCrashGauge // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	float CalcUniqueDamage(struct FHCHitResult HitResult, float BaseDamage); // Function BattlePrototype.BattleCharacterInterface.CalcUniqueDamage // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1183d00
	bool AddScarFromHitDamageInfoInterface(struct AActor* Actor, struct FHitDamageInfo HitDamageInfo); // Function BattlePrototype.BattleCharacterInterface.AddScarFromHitDamageInfoInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
};

// Class BattlePrototype.BattleEnemyInterface
// Size: 0x28 (Inherited: 0x28)
struct UBattleEnemyInterface : UInterface {

	void UpdateOutRangeFade_Native(float ToTargetLenge, bool ForceDisp); // Function BattlePrototype.BattleEnemyInterface.UpdateOutRangeFade_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool UpdateMoveMaxSpeed(); // Function BattlePrototype.BattleEnemyInterface.UpdateMoveMaxSpeed // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool UpdateFall_Native(); // Function BattlePrototype.BattleEnemyInterface.UpdateFall_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateDamageAnim_Native(bool DamageEnd, bool DamageDownEnd); // Function BattlePrototype.BattleEnemyInterface.UpdateDamageAnim_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SwitchDispCore_Native(bool DisplayOn); // Function BattlePrototype.BattleEnemyInterface.SwitchDispCore_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool StoreWeakState_Native(); // Function BattlePrototype.BattleEnemyInterface.StoreWeakState_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool StopCrashChanceLoopEffect_Native(); // Function BattlePrototype.BattleEnemyInterface.StopCrashChanceLoopEffect_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool StartVanish_Native(float VanishSec, float StartVanish, float EndVanish); // Function BattlePrototype.BattleEnemyInterface.StartVanish_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool StartReactionDilation_CallFromCPP(char ReactionKind, bool bAddDamage); // Function BattlePrototype.BattleEnemyInterface.StartReactionDilation_CallFromCPP // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StartFallIfFlyingIF(bool bDummy); // Function BattlePrototype.BattleEnemyInterface.StartFallIfFlyingIF // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool StartDamageFloating_Native(); // Function BattlePrototype.BattleEnemyInterface.StartDamageFloating_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetWeakEmissiveOff_Native(struct FString WeakSlotName); // Function BattlePrototype.BattleEnemyInterface.SetWeakEmissiveOff_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetUseWaitNoInterpolation_Native(bool Use); // Function BattlePrototype.BattleEnemyInterface.SetUseWaitNoInterpolation_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetTickEnableMeshOnly(bool bMeshOnly); // Function BattlePrototype.BattleEnemyInterface.SetTickEnableMeshOnly // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetReserveAction_Native(char Action, float Param00, float Param01); // Function BattlePrototype.BattleEnemyInterface.SetReserveAction_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetLanding_Native(bool bLanding); // Function BattlePrototype.BattleEnemyInterface.SetLanding_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetIsMoveAnim_Native(bool NewIsMoveAnim); // Function BattlePrototype.BattleEnemyInterface.SetIsMoveAnim_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetIsLaunchDown_Native(bool NewIsLaunchDown); // Function BattlePrototype.BattleEnemyInterface.SetIsLaunchDown_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetIsLandCheck_Native(bool NewIsLandCheck); // Function BattlePrototype.BattleEnemyInterface.SetIsLandCheck_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetIsBrainAccess_Native(bool NewIsBrainAccess); // Function BattlePrototype.BattleEnemyInterface.SetIsBrainAccess_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetIdleMove_Native(bool IsIdle); // Function BattlePrototype.BattleEnemyInterface.SetIdleMove_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetHp_Native(int32_t HP); // Function BattlePrototype.BattleEnemyInterface.SetHp_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetEnemyConsiderDownDead(bool bEnable); // Function BattlePrototype.BattleEnemyInterface.SetEnemyConsiderDownDead // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetDownTimer_Native(float NewTime); // Function BattlePrototype.BattleEnemyInterface.SetDownTimer_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetDamageCollisionDisable_Native(struct FName ClaimantName); // Function BattlePrototype.BattleEnemyInterface.SetDamageCollisionDisable_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SafeDestroy_Native(struct AActor* Actor); // Function BattlePrototype.BattleEnemyInterface.SafeDestroy_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool RestoreWeakState_Native(); // Function BattlePrototype.BattleEnemyInterface.RestoreWeakState_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool RestoreWeakEmissive_Native(struct FString WeakSlotName); // Function BattlePrototype.BattleEnemyInterface.RestoreWeakEmissive_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ResetStateReceivedExecuteAi_Native(); // Function BattlePrototype.BattleEnemyInterface.ResetStateReceivedExecuteAi_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ResetCore_Native(struct AActor* Enemy, bool RemoveCore); // Function BattlePrototype.BattleEnemyInterface.ResetCore_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ResetAction_Native(); // Function BattlePrototype.BattleEnemyInterface.ResetAction_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ReceivedNotifyAnimEnd_Native(bool Received); // Function BattlePrototype.BattleEnemyInterface.ReceivedNotifyAnimEnd_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool OutputLogCrashChanceEnd_Native(); // Function BattlePrototype.BattleEnemyInterface.OutputLogCrashChanceEnd_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool OnEndCrashChance_Native(); // Function BattlePrototype.BattleEnemyInterface.OnEndCrashChance_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnEndAnimDieIF(bool bDummy); // Function BattlePrototype.BattleEnemyInterface.OnEndAnimDieIF // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool LeaveBrainCrashAccess_Native(struct ARSCharacterBase* Character); // Function BattlePrototype.BattleEnemyInterface.LeaveBrainCrashAccess_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void LaunchDown_Native(bool IsEnd); // Function BattlePrototype.BattleEnemyInterface.LaunchDown_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool KickCrashChanceLoopEffect_Native(); // Function BattlePrototype.BattleEnemyInterface.KickCrashChanceLoopEffect_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsWeakUiDamageHit_CallFromCPP(); // Function BattlePrototype.BattleEnemyInterface.IsWeakUiDamageHit_CallFromCPP // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsUpdateEnemyTickEnable(); // Function BattlePrototype.BattleEnemyInterface.IsUpdateEnemyTickEnable // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsUpdateEnemySpawn(); // Function BattlePrototype.BattleEnemyInterface.IsUpdateEnemySpawn // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsUniqueAroundEffectPause(); // Function BattlePrototype.BattleEnemyInterface.IsUniqueAroundEffectPause // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsTickDisableCondition(); // Function BattlePrototype.BattleEnemyInterface.IsTickDisableCondition // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsSuspendFollowAttackInterface(); // Function BattlePrototype.BattleEnemyInterface.IsSuspendFollowAttackInterface // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsSpawned(); // Function BattlePrototype.BattleEnemyInterface.IsSpawned // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsReflectContainer(); // Function BattlePrototype.BattleEnemyInterface.IsReflectContainer // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsPressDown_Native(); // Function BattlePrototype.BattleEnemyInterface.IsPressDown_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsPossibleTargetAttack_CallFromCPP(struct AActor* Actor); // Function BattlePrototype.BattleEnemyInterface.IsPossibleTargetAttack_CallFromCPP // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsNotFindPlayer_CallFromCPP(); // Function BattlePrototype.BattleEnemyInterface.IsNotFindPlayer_CallFromCPP // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void IsMotionEnd_Native(bool ReturnValue); // Function BattlePrototype.BattleEnemyInterface.IsMotionEnd_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsLaunchDown_Native(); // Function BattlePrototype.BattleEnemyInterface.IsLaunchDown_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsInvincible_Native(); // Function BattlePrototype.BattleEnemyInterface.IsInvincible_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void IsIgnoreLandingCheck_Native(bool bIgnoreLandingCheck); // Function BattlePrototype.BattleEnemyInterface.IsIgnoreLandingCheck_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsFlyEnemyCheck_Native(); // Function BattlePrototype.BattleEnemyInterface.IsFlyEnemyCheck_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsExecLowProcess(); // Function BattlePrototype.BattleEnemyInterface.IsExecLowProcess // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsEnemyStateAttack_CallFromCPP(); // Function BattlePrototype.BattleEnemyInterface.IsEnemyStateAttack_CallFromCPP // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsEnemySpawn_Interface(); // Function BattlePrototype.BattleEnemyInterface.IsEnemySpawn_Interface // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void IsEnemyLandingCheck_Native(bool bHit); // Function BattlePrototype.BattleEnemyInterface.IsEnemyLandingCheck_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsEnemyFalling_Interface(); // Function BattlePrototype.BattleEnemyInterface.IsEnemyFalling_Interface // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsEnemyDamageDown_CallFromCPP(); // Function BattlePrototype.BattleEnemyInterface.IsEnemyDamageDown_CallFromCPP // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsEnemyConsiderDownDead(); // Function BattlePrototype.BattleEnemyInterface.IsEnemyConsiderDownDead // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsDisableUroAction_Interface(); // Function BattlePrototype.BattleEnemyInterface.IsDisableUroAction_Interface // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsDisableDownMotionInterface(); // Function BattlePrototype.BattleEnemyInterface.IsDisableDownMotionInterface // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsDamageMotionEnd_Native(); // Function BattlePrototype.BattleEnemyInterface.IsDamageMotionEnd_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsCheckSameCompareGroundLoaction(); // Function BattlePrototype.BattleEnemyInterface.IsCheckSameCompareGroundLoaction // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsCheckLookTargetTick(struct FVector Start, struct FVector End); // Function BattlePrototype.BattleEnemyInterface.IsCheckLookTargetTick // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsCheckLookScrollTick(struct FVector Start, struct FVector End); // Function BattlePrototype.BattleEnemyInterface.IsCheckLookScrollTick // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsCheckHeightChangeTick(); // Function BattlePrototype.BattleEnemyInterface.IsCheckHeightChangeTick // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool IsBrainSuccess_Native(); // Function BattlePrototype.BattleEnemyInterface.IsBrainSuccess_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void IsBrainCrashMiss_Native(bool IsMiss); // Function BattlePrototype.BattleEnemyInterface.IsBrainCrashMiss_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsBossEnemy_CallFromCPP(); // Function BattlePrototype.BattleEnemyInterface.IsBossEnemy_CallFromCPP // (Event|Public|BlueprintEvent|Const) // @ game+0x1685580
	float GetUniqueTickEnableRange(); // Function BattlePrototype.BattleEnemyInterface.GetUniqueTickEnableRange // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct FVector GetTopHeightLocation(); // Function BattlePrototype.BattleEnemyInterface.GetTopHeightLocation // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct AActor* GetTargetCharacter_Native(); // Function BattlePrototype.BattleEnemyInterface.GetTargetCharacter_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct USearchingComponent* GetSearchingComponent_Native(); // Function BattlePrototype.BattleEnemyInterface.GetSearchingComponent_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool GetPressDownLoop_Native(); // Function BattlePrototype.BattleEnemyInterface.GetPressDownLoop_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool GetNewDamageFloating_Native(); // Function BattlePrototype.BattleEnemyInterface.GetNewDamageFloating_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void GetLostData_Native(float LostMoveTimeMin, float LostMoveTimeMax, float LostMoveRotationRate, float SpeedScale, bool IsNoMoveAnim); // Function BattlePrototype.BattleEnemyInterface.GetLostData_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetLostActionInfoList_Native(struct TArray<struct FEmLostActionInfo> LostActionInfo); // Function BattlePrototype.BattleEnemyInterface.GetLostActionInfoList_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool GetIsLandCheck(); // Function BattlePrototype.BattleEnemyInterface.GetIsLandCheck // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool GetIsJumpEnd(); // Function BattlePrototype.BattleEnemyInterface.GetIsJumpEnd // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void GetHitObjectType_Native(struct TArray<enum class EObjectTypeQuery> ObjectType); // Function BattlePrototype.BattleEnemyInterface.GetHitObjectType_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct UHateTargetComponent* GetHateTarget_Native(); // Function BattlePrototype.BattleEnemyInterface.GetHateTarget_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool GetFall_Native(); // Function BattlePrototype.BattleEnemyInterface.GetFall_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool GetFailedFall_Native(); // Function BattlePrototype.BattleEnemyInterface.GetFailedFall_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	enum class EEnemyTribe GetEnemyTribe(); // Function BattlePrototype.BattleEnemyInterface.GetEnemyTribe // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct UEnemyScriptComponent* GetEnemyScriptComponent(); // Function BattlePrototype.BattleEnemyInterface.GetEnemyScriptComponent // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct UEnemyAnimControllerComponent* GetEnemyAnimControllerComponent(); // Function BattlePrototype.BattleEnemyInterface.GetEnemyAnimControllerComponent // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct UEnemyAiComponentBase* GetEnemyAiComponent(); // Function BattlePrototype.BattleEnemyInterface.GetEnemyAiComponent // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	enum class EnemyMoveAnimKind GetDownUpMoveAnimKind_Native(); // Function BattlePrototype.BattleEnemyInterface.GetDownUpMoveAnimKind_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	float GetDownTimer_Native(); // Function BattlePrototype.BattleEnemyInterface.GetDownTimer_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool GetDebugEnemyDownInfinity_Native(); // Function BattlePrototype.BattleEnemyInterface.GetDebugEnemyDownInfinity_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct FVector GetDamageHitDirectionIF(); // Function BattlePrototype.BattleEnemyInterface.GetDamageHitDirectionIF // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	struct AActor* GetCurrentTarget(); // Function BattlePrototype.BattleEnemyInterface.GetCurrentTarget // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void GetCurrentActionTime_Native(float ActionTime); // Function BattlePrototype.BattleEnemyInterface.GetCurrentActionTime_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct UCapsuleComponent* GetCapsuleComponent_Native(); // Function BattlePrototype.BattleEnemyInterface.GetCapsuleComponent_Native // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void FlyDown_Native(bool IsEnd); // Function BattlePrototype.BattleEnemyInterface.FlyDown_Native // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EntryBrainCrashAccess_Native(struct ARSCharacterBase* Character); // Function BattlePrototype.BattleEnemyInterface.EntryBrainCrashAccess_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EnemyUpdateEvDitherNative(float DeltaSec); // Function BattlePrototype.BattleEnemyInterface.EnemyUpdateEvDitherNative // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EnemyStartEvDitherNative(bool bDisp, float DitherTime); // Function BattlePrototype.BattleEnemyInterface.EnemyStartEvDitherNative // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EnemyEndEvDitherNative(bool bDisp); // Function BattlePrototype.BattleEnemyInterface.EnemyEndEvDitherNative // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EndDamageFloating_Native(); // Function BattlePrototype.BattleEnemyInterface.EndDamageFloating_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EnableFitGroundTmp_Native(); // Function BattlePrototype.BattleEnemyInterface.EnableFitGroundTmp_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EnableAllWeak_Native(bool bEnable); // Function BattlePrototype.BattleEnemyInterface.EnableAllWeak_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool DropFlyingEnemy_Native(struct AActor* Enemy); // Function BattlePrototype.BattleEnemyInterface.DropFlyingEnemy_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool DisableFitGroundTmp_Native(); // Function BattlePrototype.BattleEnemyInterface.DisableFitGroundTmp_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool DeadStart_Native(); // Function BattlePrototype.BattleEnemyInterface.DeadStart_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool DamageMotionEnd_Native(float DeltaTime); // Function BattlePrototype.BattleEnemyInterface.DamageMotionEnd_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool DamageFloatEnd_Native(); // Function BattlePrototype.BattleEnemyInterface.DamageFloatEnd_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CheckSASHologramAttack_Native(enum class ESASHologramAttackTiming Timing, struct ARSCharacterBase* RequestCharacter); // Function BattlePrototype.BattleEnemyInterface.CheckSASHologramAttack_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CheckNpcDrive_Native(enum class ENpcDriveCheckType CheckType, struct AActor* EnemyActor); // Function BattlePrototype.BattleEnemyInterface.CheckNpcDrive_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CameraAttentionEnd_Native(struct UCurveFloat* FovCurveOut); // Function BattlePrototype.BattleEnemyInterface.CameraAttentionEnd_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CallFuncDamageDownStart_Native(); // Function BattlePrototype.BattleEnemyInterface.CallFuncDamageDownStart_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CallFuncDamageDownLoop_Native(); // Function BattlePrototype.BattleEnemyInterface.CallFuncDamageDownLoop_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CallFuncDamageDownEnd_Native(); // Function BattlePrototype.BattleEnemyInterface.CallFuncDamageDownEnd_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CallDead_Native(); // Function BattlePrototype.BattleEnemyInterface.CallDead_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool BrainCrashLock_Native(); // Function BattlePrototype.BattleEnemyInterface.BrainCrashLock_Native // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
};

// Class BattlePrototype.BattlefieldFenceInterface
// Size: 0x28 (Inherited: 0x28)
struct UBattlefieldFenceInterface : UInterface {

	void SetBattlefieldVisibleForce(bool Visible); // Function BattlePrototype.BattlefieldFenceInterface.SetBattlefieldVisibleForce // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetBattlefieldEnable(bool Enable); // Function BattlePrototype.BattlefieldFenceInterface.SetBattlefieldEnable // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct USplineComponent* GetBattlefieldSpline(); // Function BattlePrototype.BattlefieldFenceInterface.GetBattlefieldSpline // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool GetBattlefieldEnable(); // Function BattlePrototype.BattlefieldFenceInterface.GetBattlefieldEnable // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
};

// Class BattlePrototype.BattlefieldManager
// Size: 0x310 (Inherited: 0x230)
struct ABattlefieldManager : ARSActorSystemBase {
	char pad_230[0x8]; // 0x230(0x08)
	struct FMulticastInlineDelegate DispatchBattleFieldBegin; // 0x238(0x10)
	struct FMulticastInlineDelegate DispatchBattleFieldEnd; // 0x248(0x10)
	struct FMulticastInlineDelegate DispatchBattleFieldRushEnd; // 0x258(0x10)
	struct TMap<struct FString, struct FBattlefieldInfo> CurrentBFInfos; // 0x268(0x50)
	int32_t FenceLotterySeed; // 0x2b8(0x04)
	struct FRandomStream RandomStream; // 0x2bc(0x08)
	bool IsActiveEvent; // 0x2c4(0x01)
	char pad_2C5[0x3]; // 0x2c5(0x03)
	struct AMakeEventActor* MakeEventActorClass; // 0x2c8(0x08)
	struct AMakeEventActor* MakeEventActor; // 0x2d0(0x08)
	char pad_2D8[0x8]; // 0x2d8(0x08)
	struct TArray<struct AActor*> AllFenceActors; // 0x2e0(0x10)
	char pad_2F0[0x8]; // 0x2f0(0x08)
	struct TArray<struct AActor*> AllTriggerActors; // 0x2f8(0x10)
	char pad_308[0x8]; // 0x308(0x08)

	void UpdateAtStartArea(); // Function BattlePrototype.BattlefieldManager.UpdateAtStartArea // (Final|Native|Public|BlueprintCallable) // @ game+0x118b8f0
	bool StartWipeoutBattlefield(int32_t BFGroupID); // Function BattlePrototype.BattlefieldManager.StartWipeoutBattlefield // (Final|Native|Public|BlueprintCallable) // @ game+0x118b860
	bool StartEventInBattleField(struct AMakeEventActor* MakeEventActorClass); // Function BattlePrototype.BattlefieldManager.StartEventInBattleField // (Final|Native|Public|BlueprintCallable) // @ game+0x118b7d0
	bool StartEventBattlefield(int32_t BFGroupID, int32_t SubGroupID); // Function BattlePrototype.BattlefieldManager.StartEventBattlefield // (Final|Native|Public|BlueprintCallable) // @ game+0x118b710
	bool StartBattlefield(enum class EBattlefieldEventType EventType, int32_t BFGroupID, int32_t SubGroupID, struct TArray<struct FBattlefieldTutorialInfo> AdditionalTutorialInfo, struct AMakeEventActor* MakeEventActorClass, int32_t TutorialGroupID, int32_t TutorialSubGroupID, float FenceBattleRate, struct FString SeedString, bool IsOnceBattle); // Function BattlePrototype.BattlefieldManager.StartBattlefield // (Final|Native|Public|BlueprintCallable) // @ game+0x118b390
	bool SetFenceEnableForce(int32_t fenceID, bool Enable); // Function BattlePrototype.BattlefieldManager.SetFenceEnableForce // (Final|Native|Public|BlueprintCallable) // @ game+0x118b210
	bool SetFenceEnable(int32_t fenceID, bool Enable); // Function BattlePrototype.BattlefieldManager.SetFenceEnable // (Final|Native|Public|BlueprintCallable) // @ game+0x118b150
	void SetEnableEnemyOutField(bool Enable, int32_t BFGroupID); // Function BattlePrototype.BattlefieldManager.SetEnableEnemyOutField // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x118b080
	void SetCurrentLocationAndArea(int32_t LocationId, int32_t areaId); // Function BattlePrototype.BattlefieldManager.SetCurrentLocationAndArea // (Final|Native|Public|BlueprintCallable) // @ game+0x118afc0
	bool SetCurrentBattlefieldInfos(struct TMap<struct FString, struct FBattlefieldInfo> Infos); // Function BattlePrototype.BattlefieldManager.SetCurrentBattlefieldInfos // (Final|Native|Public|BlueprintCallable) // @ game+0x118ae70
	bool SetBattlefieldInfo(int32_t BFGroupID, struct FBattlefieldInfo BFInfo); // Function BattlePrototype.BattlefieldManager.SetBattlefieldInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x118ad40
	bool ResetFenceRandomSeed(); // Function BattlePrototype.BattlefieldManager.ResetFenceRandomSeed // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x118ac80
	bool RepopBattlefieldInfos(int32_t LocationId, int32_t areaId, struct FString SeedString); // Function BattlePrototype.BattlefieldManager.RepopBattlefieldInfos // (Final|Native|Public|BlueprintCallable) // @ game+0x118ab20
	bool RepopBattlefieldEnemy(int32_t BFGroupID); // Function BattlePrototype.BattlefieldManager.RepopBattlefieldEnemy // (Final|Native|Public|BlueprintCallable) // @ game+0x118aa90
	bool OverwriteTmpBfInfo(int32_t GroupID, struct FString TriggerName); // Function BattlePrototype.BattlefieldManager.OverwriteTmpBfInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x118a700
	bool OnSave_SaveData(); // Function BattlePrototype.BattlefieldManager.OnSave_SaveData // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1173a80
	bool OnLoad_SaveData(); // Function BattlePrototype.BattlefieldManager.OnLoad_SaveData // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x118a6d0
	bool IsStartBattlefield(int32_t BFGroupID); // Function BattlePrototype.BattlefieldManager.IsStartBattlefield // (Final|Native|Public|BlueprintCallable) // @ game+0x118a640
	bool IsPlayerInFence(int32_t GroupID); // Function BattlePrototype.BattlefieldManager.IsPlayerInFence // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x118a5b0
	bool IsInSplineLoopDetail(struct FVector Pos, struct USplineComponent* Spline); // Function BattlePrototype.BattlefieldManager.IsInSplineLoopDetail // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x118a4d0
	bool IsInSplineLoop(struct FVector Pos, struct USplineComponent* Spline); // Function BattlePrototype.BattlefieldManager.IsInSplineLoop // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x118a3f0
	bool IsInFence(struct FVector Pos, int32_t GroupID); // Function BattlePrototype.BattlefieldManager.IsInFence // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x118a310
	bool IsFenceEnabled(int32_t GroupID); // Function BattlePrototype.BattlefieldManager.IsFenceEnabled // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x118a240
	bool IsExistBattlefieldEnemiesStrictly(int32_t BFGroupID, int32_t SubGroupID); // Function BattlePrototype.BattlefieldManager.IsExistBattlefieldEnemiesStrictly // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x118a140
	bool IsExistBattlefieldEnemies(int32_t BFGroupID, int32_t SubGroupID, int32_t FirstSubGroup); // Function BattlePrototype.BattlefieldManager.IsExistBattlefieldEnemies // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x118a030
	bool IsCharacterInCurrentBattleField(struct ARSCharacterBase* InCharacter); // Function BattlePrototype.BattlefieldManager.IsCharacterInCurrentBattleField // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1189fa0
	bool IsCharacterInBattleField(struct FBattlefieldInfo InInfo, struct ARSCharacterBase* InCharacter); // Function BattlePrototype.BattlefieldManager.IsCharacterInBattleField // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1189e60
	bool IsBattlefieldWillAppear(int32_t GroupID, float FenceBattleRate, struct FString SeedString, struct FString TargetName); // Function BattlePrototype.BattlefieldManager.IsBattlefieldWillAppear // (Final|Native|Public|BlueprintCallable) // @ game+0x1189c80
	bool IsAnyFenceEnabled(); // Function BattlePrototype.BattlefieldManager.IsAnyFenceEnabled // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1174420
	bool InitializeAtStartBattlefield(struct FBattlefieldInfo currentBFInfo); // Function BattlePrototype.BattlefieldManager.InitializeAtStartBattlefield // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x1189b60
	void InitializeAtStartArea(); // Function BattlePrototype.BattlefieldManager.InitializeAtStartArea // (Final|Native|Public|BlueprintCallable) // @ game+0x1189b40
	bool HaveDestroyedBattlefield(int32_t BFGroupID, struct FString TargetName); // Function BattlePrototype.BattlefieldManager.HaveDestroyedBattlefield // (Final|Native|Public|BlueprintCallable) // @ game+0x1189a20
	struct FBattlefieldInfo GetCurrentBattlefieldInfo(bool Exist); // Function BattlePrototype.BattlefieldManager.GetCurrentBattlefieldInfo // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1189920
	void GetBfFenceStatus(int32_t GroupID, bool Exist, bool IsVisible); // Function BattlePrototype.BattlefieldManager.GetBfFenceStatus // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1189800
	struct TArray<struct AActor*> GetBfFenceAll(int32_t GroupID); // Function BattlePrototype.BattlefieldManager.GetBfFenceAll // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1189730
	struct AActor* GetBfFence(int32_t GroupID); // Function BattlePrototype.BattlefieldManager.GetBfFence // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11896a0
	void GetBattlefieldInfo(int32_t BFGroupID, struct FBattlefieldInfo BFInfo, bool IsExist); // Function BattlePrototype.BattlefieldManager.GetBattlefieldInfo // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1189520
	void FinalizeAtStartArea(); // Function BattlePrototype.BattlefieldManager.FinalizeAtStartArea // (Final|Native|Public|BlueprintCallable) // @ game+0x1189390
	bool EndEventBattlefield(int32_t BFGroupID); // Function BattlePrototype.BattlefieldManager.EndEventBattlefield // (Final|Native|Public|BlueprintCallable) // @ game+0x1189270
	bool EndBattlefieldForce(int32_t BFGroupID); // Function BattlePrototype.BattlefieldManager.EndBattlefieldForce // (Final|Native|Public|BlueprintCallable) // @ game+0x11891e0
	bool EndBattlefield(int32_t BFGroupID); // Function BattlePrototype.BattlefieldManager.EndBattlefield // (Final|Native|Public|BlueprintCallable) // @ game+0x1189150
	bool EndAllBattlefieldForce(); // Function BattlePrototype.BattlefieldManager.EndAllBattlefieldForce // (Final|Native|Public|BlueprintCallable) // @ game+0x1189120
	bool BroadcastBattlefieldRushEnd(int32_t GroupID, int32_t SubGroupID); // Function BattlePrototype.BattlefieldManager.BroadcastBattlefieldRushEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x1188ff0
};

// Class BattlePrototype.BattleLogBuffer
// Size: 0x38 (Inherited: 0x28)
struct UBattleLogBuffer : UObject {
	struct TArray<struct FBattleLogParam> battleLogBufferArray; // 0x28(0x10)

	bool IsExistLogBuffer(); // Function BattlePrototype.BattleLogBuffer.IsExistLogBuffer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118a210
	void Initialize(); // Function BattlePrototype.BattleLogBuffer.Initialize // (Final|Native|Public) // @ game+0x11890e0
	struct TArray<struct FBattleLogParam> GetBattleLogBuffer(); // Function BattlePrototype.BattleLogBuffer.GetBattleLogBuffer // (Final|Native|Public|BlueprintCallable) // @ game+0x1189460
	void Clear(); // Function BattlePrototype.BattleLogBuffer.Clear // (Final|Native|Public|BlueprintCallable) // @ game+0x11890e0
	void AddBattleLogBuffer(struct FBattleLogParam Param); // Function BattlePrototype.BattleLogBuffer.AddBattleLogBuffer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1188e90
};

// Class BattlePrototype.BattleManager
// Size: 0x300 (Inherited: 0x230)
struct ABattleManager : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	struct TArray<struct ARSCharacterBase*> _battleActorList; // 0x238(0x10)
	char pad_248[0x8]; // 0x248(0x08)
	struct TArray<struct FName> _ForceBattleList; // 0x250(0x10)
	float BATTLEFIELD_SPEEDRUN_TIME; // 0x260(0x04)
	int32_t BATTLEFIELD_HORDE_ENEMY_NUM; // 0x264(0x04)
	char pad_268[0x8]; // 0x268(0x08)
	struct TArray<struct FActorBattleEndLogData> _BattleLogDataList; // 0x270(0x10)
	int32_t OneFrameHitEffectMax; // 0x280(0x04)
	int32_t HitEffectPoolNum_Other; // 0x284(0x04)
	int32_t HitEffectPoolNum_Npc; // 0x288(0x04)
	int32_t HitEffectPoolNum_Enemy; // 0x28c(0x04)
	int32_t HitEffectPoolNum_PlayerDamage; // 0x290(0x04)
	int32_t HitEffectPoolNum_Player; // 0x294(0x04)
	int32_t HitEffectPoolNum_Special; // 0x298(0x04)
	char pad_29C[0x4]; // 0x29c(0x04)
	struct TArray<struct FPoolHitEffectData> _HitEffectPool_Other; // 0x2a0(0x10)
	struct TArray<struct FPoolHitEffectData> _HitEffectPool_Npc; // 0x2b0(0x10)
	struct TArray<struct FPoolHitEffectData> _HitEffectPool_Enemy; // 0x2c0(0x10)
	struct TArray<struct FPoolHitEffectData> _HitEffectPool_PlayerDamage; // 0x2d0(0x10)
	struct TArray<struct FPoolHitEffectData> _HitEffectPool_Player; // 0x2e0(0x10)
	struct TArray<struct FPoolHitEffectData> _HitEffectPool_Special; // 0x2f0(0x10)

	void StartTutorialOperation(struct FName helpTutoID, float delaySec); // Function BattlePrototype.BattleManager.StartTutorialOperation // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void SetForceBattle(bool bForce, struct FName ClaimantName); // Function BattlePrototype.BattleManager.SetForceBattle // (Final|Native|Public|BlueprintCallable) // @ game+0x118b2d0
	void SetBattleMode(bool bBattle); // Function BattlePrototype.BattleManager.SetBattleMode // (Final|Native|Protected|BlueprintCallable) // @ game+0x118acb0
	void RemoveBattleActor(struct ARSCharacterBase* Actor, enum class EReasonBattleEnd reason); // Function BattlePrototype.BattleManager.RemoveBattleActor // (Final|Native|Public|BlueprintCallable) // @ game+0x118a9d0
	void PoolHitEffectData(struct AActor* HitActor, struct FHCHitResult HitResult, bool bNoLimit); // Function BattlePrototype.BattleManager.PoolHitEffectData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x118a850
	bool PlayBrainTalkStealthLost(); // Function BattlePrototype.BattleManager.PlayBrainTalkStealthLost // (Final|Native|Public|BlueprintCallable) // @ game+0x118a820
	bool IsForceBattle(); // Function BattlePrototype.BattleManager.IsForceBattle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118a2e0
	bool IsBattleMode(); // Function BattlePrototype.BattleManager.IsBattleMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1189c50
	struct UBattleSituationComponent* GetSituation(); // Function BattlePrototype.BattleManager.GetSituation // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	struct UBattleSettingComponent* GetBattleSetting(); // Function BattlePrototype.BattleManager.GetBattleSetting // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	struct TArray<struct ARSCharacterBase*> GetBattleActorList(); // Function BattlePrototype.BattleManager.GetBattleActorList // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11893d0
	void ForceEndRecordBattleLog(); // Function BattlePrototype.BattleManager.ForceEndRecordBattleLog // (Final|Native|Public|BlueprintCallable) // @ game+0x11893b0
	void EndRecordBattleLog(bool bBattleField); // Function BattlePrototype.BattleManager.EndRecordBattleLog // (Final|Native|Public|BlueprintCallable) // @ game+0x1189300
	void ClearBattleActor(); // Function BattlePrototype.BattleManager.ClearBattleActor // (Final|Native|Public|BlueprintCallable) // @ game+0x1189100
	bool CheckBattleLog_StealthLost(); // Function BattlePrototype.BattleManager.CheckBattleLog_StealthLost // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11890b0
	void BeginRecordBattleLog(bool bBattleField); // Function BattlePrototype.BattleManager.BeginRecordBattleLog // (Final|Native|Public|BlueprintCallable) // @ game+0x1188f60
	void AddBattleActor(struct ARSCharacterBase* Actor); // Function BattlePrototype.BattleManager.AddBattleActor // (Final|Native|Public|BlueprintCallable) // @ game+0x1188e10
};

// Class BattlePrototype.BattlePrototypeUtility
// Size: 0x28 (Inherited: 0x28)
struct UBattlePrototypeUtility : UObject {

	void SetNotSaveLoadDebugingParameter(bool Flag); // Function BattlePrototype.BattlePrototypeUtility.SetNotSaveLoadDebugingParameter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x118f0a0
	void SetDebugAreaSceneSelectable(bool Flag); // Function BattlePrototype.BattlePrototypeUtility.SetDebugAreaSceneSelectable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x118f0a0
	bool IsNotSaveLoadDebugingParameter(); // Function BattlePrototype.BattlePrototypeUtility.IsNotSaveLoadDebugingParameter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x7af460
	bool IsMasterReleaseVersion(); // Function BattlePrototype.BattlePrototypeUtility.IsMasterReleaseVersion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x7b7230
	bool IsEnableUserReview202005EOM(); // Function BattlePrototype.BattlePrototypeUtility.IsEnableUserReview202005EOM // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xad4510
	bool IsDebugSoundSpawnDisable(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugSoundSpawnDisable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e270
	bool IsDebugSASInfinity(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugSASInfinity // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e240
	bool IsDebugSASBetaEnable(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugSASBetaEnable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e210
	bool IsDebugPlayerInvincible(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugPlayerInvincible // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e1e0
	bool IsDebugParticleSpawnDisable(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugParticleSpawnDisable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e1b0
	bool IsDebugEnemyParameter(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugEnemyParameter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e180
	bool IsDebugEnemyInvincible(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugEnemyInvincible // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e150
	bool IsDebugEnemyDrawData(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugEnemyDrawData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e120
	bool IsDebugEnemyDamagePartHitPrint(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugEnemyDamagePartHitPrint // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e0f0
	bool IsDebugDrawTargetSearch(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugDrawTargetSearch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e0c0
	bool IsDebugDrawPrintString(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugDrawPrintString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e090
	bool IsDebugDrawNonLockonTargetSearch(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugDrawNonLockonTargetSearch // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e060
	bool IsDebugDrawAttackCollision(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugDrawAttackCollision // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e030
	bool IsDebugDrawAI(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugDrawAI // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118e000
	bool IsDebugDirectPause(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugDirectPause // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118dfd0
	bool IsDebugBrainCrashOpend(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugBrainCrashOpend // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118dfa0
	bool IsDebugAreaSceneSelectable(); // Function BattlePrototype.BattlePrototypeUtility.IsDebugAreaSceneSelectable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x7b7230
	int32_t GetMasterReleaseVersion(); // Function BattlePrototype.BattlePrototypeUtility.GetMasterReleaseVersion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118dea0
	int32_t GetDebugBadState(); // Function BattlePrototype.BattlePrototypeUtility.GetDebugBadState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118ddc0
	void getCallStackBP(struct FString Output); // Function BattlePrototype.BattlePrototypeUtility.getCallStackBP // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x118f1b0
	void getCallStack(struct FString Output); // Function BattlePrototype.BattlePrototypeUtility.getCallStack // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x118f1b0
	struct FIntPoint GetAppBaseResolution(); // Function BattlePrototype.BattlePrototypeUtility.GetAppBaseResolution // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x118d640
	void DrawDebugPrintString(struct UObject* CallingObj, struct FString inString, float ScreenX, float ScreenY, struct AActor* TargetActor, struct FLinearColor TextColor, float Scale); // Function BattlePrototype.BattlePrototypeUtility.DrawDebugPrintString // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x118d320
};

// Class BattlePrototype.BattleSettingComponent
// Size: 0xd8 (Inherited: 0xc0)
struct UBattleSettingComponent : UActorComponent {
	float AttackExPsychicRateForArmor; // 0xc0(0x04)
	int32_t EnemyLockOnMax; // 0xc4(0x04)
	int32_t EnemyAttackActionMax; // 0xc8(0x04)
	float WinceAccumulationStopSeconds; // 0xcc(0x04)
	float KnockBackAccumulationStopSeconds; // 0xd0(0x04)
	float DownAccumulationStopSeconds; // 0xd4(0x04)

	void SetAttackExPsychicRateForArmor(float Value); // Function BattlePrototype.BattleSettingComponent.SetAttackExPsychicRateForArmor // (Final|Native|Public|BlueprintCallable) // @ game+0x118eee0
	float GetWinceAccumationStopSeconds(); // Function BattlePrototype.BattleSettingComponent.GetWinceAccumationStopSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118def0
	float GetKnockBackAccumationStopSeconds(); // Function BattlePrototype.BattleSettingComponent.GetKnockBackAccumationStopSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118de70
	int32_t GetEnemyLockOnMax(); // Function BattlePrototype.BattleSettingComponent.GetEnemyLockOnMax // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118de40
	int32_t GetEnemyAttackActionMax(); // Function BattlePrototype.BattleSettingComponent.GetEnemyAttackActionMax // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118de10
	float GetDownAccumationStopSeconds(); // Function BattlePrototype.BattleSettingComponent.GetDownAccumationStopSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118dde0
	float GetAttackExPsychicRateForArmor(); // Function BattlePrototype.BattleSettingComponent.GetAttackExPsychicRateForArmor // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x118d680
};

// Class BattlePrototype.BattleSituationComponent
// Size: 0xf8 (Inherited: 0xc0)
struct UBattleSituationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnChangeSituation; // 0xc0(0x10)
	float IgnoreChangeSituationRemainTimer; // 0xd0(0x04)
	float NormalSituationRemainTimer; // 0xd4(0x04)
	float IgnoreChangeSituationTime; // 0xd8(0x04)
	float ChangeSituationTime; // 0xdc(0x04)
	enum class EBattleSituationType SituationType; // 0xe0(0x01)
	char pad_E1[0x17]; // 0xe1(0x17)

	void OnAction(struct FActionParameter Parameter); // Function BattlePrototype.BattleSituationComponent.OnAction // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x118e2a0
	void GetSituationParameter(enum class EBattleSituationActionType ActionType, float RemainTime, int32_t Priority); // Function BattlePrototype.BattleSituationComponent.GetSituationParameter // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1685580
	enum class EBattleSituationType GetSituation(); // Function BattlePrototype.BattleSituationComponent.GetSituation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x118ded0
	void ChangeSituation(enum class EBattleSituationType Type); // Function BattlePrototype.BattleSituationComponent.ChangeSituation // (Final|Native|Public|BlueprintCallable) // @ game+0x118d2a0
};

// Class BattlePrototype.BlendableVolume
// Size: 0x288 (Inherited: 0x268)
struct ABlendableVolume : AVolume {
	char pad_268[0xc]; // 0x268(0x0c)
	float Priority; // 0x274(0x04)
	float BlendRadius; // 0x278(0x04)
	float BlendWeight; // 0x27c(0x04)
	char bEnabled : 1; // 0x280(0x01)
	char bUnbound : 1; // 0x280(0x01)
	char pad_280_2 : 6; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
};

// Class BattlePrototype.BlendableVolumeManager
// Size: 0x248 (Inherited: 0x230)
struct ABlendableVolumeManager : AActor {
	char pad_230[0x18]; // 0x230(0x18)

	void BlueprintAddCalcVolume(struct ABlendableVolume* Volume, float Weight); // Function BattlePrototype.BlendableVolumeManager.BlueprintAddCalcVolume // (Event|Protected|BlueprintEvent) // @ game+0x1685580
};

// Class BattlePrototype.BlownAwayComponent
// Size: 0xd8 (Inherited: 0xc0)
struct UBlownAwayComponent : UActorComponent {
	bool _isBlowOnDamage; // 0xc0(0x01)
	char pad_C1[0x3]; // 0xc1(0x03)
	float _guardBlowPowerRate; // 0xc4(0x04)
	char pad_C8[0x10]; // 0xc8(0x10)

	void SetIsBlowOnDamage(bool blowEnable); // Function BattlePrototype.BlownAwayComponent.SetIsBlowOnDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x118f120
	struct UBlownAwayComponent* GetBlownAwayComponentFromActor(struct AActor* Actor); // Function BattlePrototype.BlownAwayComponent.GetBlownAwayComponentFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x118dd40
	struct FVector GetBlowImpulse(struct AActor* attackActor, struct FRotator blowAngle, float blowPower); // Function BattlePrototype.BlownAwayComponent.GetBlowImpulse // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x118dc00
	void AddDamageBlowImpulse(struct FHCHitResult HitResult, bool IsGuard); // Function BattlePrototype.BlownAwayComponent.AddDamageBlowImpulse // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x118d150
};

// Class BattlePrototype.BrainCrashFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBrainCrashFunctionLibrary : UBlueprintFunctionLibrary {

	void SetBCSafePointAllowRotationBit(struct FBrainCrashSafePoint RefSafePoint, int32_t EnemyIndex, int32_t AllowRotateBit); // Function BattlePrototype.BrainCrashFunctionLibrary.SetBCSafePointAllowRotationBit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x118ef60
	void SearchBCSafePointList(bool HitNearLocation, struct FTransform NearLocationTransform, float NearLocationLength, bool HitNearAngle, struct FTransform NearAngleTransform, float NearAngleLength, struct TArray<struct FBrainCrashSafePoint> SafePoints, struct TArray<struct USplineMeshComponent*> BattleFieldMeshComps, struct UBrainCrashParam* Param, struct FBrainCrashSequenceSettings SequencerSetting, int32_t RotationAngle, int32_t EnemyIndex, struct FVector Location, struct FVector SequencerCenterLocation, float TargetRawDir, float TargetNormalizedDir); // Function BattlePrototype.BrainCrashFunctionLibrary.SearchBCSafePointList // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x118e880
	void SearchBCSafePoint(bool HitNearLocation, struct FTransform NearLocationTransform, float NearLocationLength, bool HitNearAngle, struct FTransform NearAngleTransform, float NearAngleLength, float NearAngleAngle, struct FBrainCrashSafePoint SafePoints, struct UBrainCrashParam* Param, int32_t RotationAngle, int32_t EnemyIndex, struct FVector Location, struct FVector SequencerCenterLocation, float TargetRawDir, float TargetNormalizedDir); // Function BattlePrototype.BrainCrashFunctionLibrary.SearchBCSafePoint // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x118e320
	bool IsBCSafePointAllowAllRotation(int32_t RotationBit); // Function BattlePrototype.BrainCrashFunctionLibrary.IsBCSafePointAllowAllRotation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x118df20
	struct FTransform GetBCSafePointCylinderTransform(struct FVector Location, struct FBrainCrashSequenceSettingsData SeqenceSetting, float HeightFloating, float Scale); // Function BattlePrototype.BrainCrashFunctionLibrary.GetBCSafePointCylinderTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x118da20
	struct FTransform GetBCSafePointBoxTransform(struct FVector Location, struct FBrainCrashSequenceSettingsData SeqenceSetting, float RotationYaw, float HeightFloating, float Scale); // Function BattlePrototype.BrainCrashFunctionLibrary.GetBCSafePointBoxTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x118d800
	int32_t GetBCSafePointAllowRotationBit(struct FBrainCrashSafePoint SafePoint, int32_t EnemyIndex); // Function BattlePrototype.BrainCrashFunctionLibrary.GetBCSafePointAllowRotationBit // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x118d6e0
	int32_t GetBCSafePointAllowAllRotation(); // Function BattlePrototype.BrainCrashFunctionLibrary.GetBCSafePointAllowAllRotation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x118d6b0
	void EditorSetBCSequenceSettingsFromJSONString(struct UDataTable* DataTable, struct FString JsonString); // Function BattlePrototype.BrainCrashFunctionLibrary.EditorSetBCSequenceSettingsFromJSONString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x118d570
};

// Class BattlePrototype.BrainCrashManager
// Size: 0x300 (Inherited: 0x230)
struct ABrainCrashManager : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	bool bEmptyTriggerTransform; // 0x238(0x01)
	char pad_239[0x7]; // 0x239(0x07)
	struct FTransform LastTriggerTransform; // 0x240(0x30)
	char pad_270[0x90]; // 0x270(0x90)

	void SetupSafePointGroup(struct UBrainCrashLocationSettings* LocationSettings, bool ForceUpdate); // Function BattlePrototype.BrainCrashManager.SetupSafePointGroup // (Final|Native|Public|BlueprintCallable) // @ game+0x11935f0
	bool SearchUniqueFinishEnemyLocation(struct FTransform OutEnmeyTransform, struct FTransform SeqeuncerEnemyTransform, struct FTransform SeqeuncerPlayerTransform, struct FTransform PlayerTransform, struct TArray<struct FVector> CollisionCheckOffset, int32_t CollisionCheckRadius, struct TArray<enum class EObjectTypeQuery> CollisionObjectTypes, enum class EDrawDebugTrace CollisionDebugType); // Function BattlePrototype.BrainCrashManager.SearchUniqueFinishEnemyLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1192dc0
	struct ABrainCrashSettingVolume* GetTriggerTransformVolume(); // Function BattlePrototype.BrainCrashManager.GetTriggerTransformVolume // (Final|Native|Public|BlueprintCallable) // @ game+0x8519c0
	bool GetTriggerTransform(struct FTransform TriggerTransform); // Function BattlePrototype.BrainCrashManager.GetTriggerTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11929f0
	struct TArray<struct FBrainCrashSafePoint> GetSafePointGroupPointsFromUnbound(struct UBrainCrashLocationSettings* LocationSettings); // Function BattlePrototype.BrainCrashManager.GetSafePointGroupPointsFromUnbound // (Final|Native|Public|BlueprintCallable) // @ game+0x1192910
	struct TArray<struct FBrainCrashSafePoint> GetSafePointGroupPointsFromID(struct UBrainCrashLocationSettings* LocationSettings, int32_t SafePointID); // Function BattlePrototype.BrainCrashManager.GetSafePointGroupPointsFromID // (Final|Native|Public|BlueprintCallable) // @ game+0x1192800
	struct TArray<struct FBrainCrashSafePoint> GetSafePointGroupPoints(struct UBrainCrashLocationSettings* LocationSettings); // Function BattlePrototype.BrainCrashManager.GetSafePointGroupPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x1192720
	int32_t GetSafePointGroupPlayerID(struct UBrainCrashLocationSettings* LocationSettings); // Function BattlePrototype.BrainCrashManager.GetSafePointGroupPlayerID // (Final|Native|Public|BlueprintCallable) // @ game+0x1192690
	bool CheckUseCutin(); // Function BattlePrototype.BrainCrashManager.CheckUseCutin // (Final|Native|Public|BlueprintCallable) // @ game+0x11919e0
};

// Class BattlePrototype.BrainCrashParam
// Size: 0x70 (Inherited: 0x30)
struct UBrainCrashParam : UDataAsset {
	float CameraInterpStartTime; // 0x30(0x04)
	enum class EViewTargetBlendFunction CameraInterpStartFunc; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float CameraInterpStartEaseExp; // 0x38(0x04)
	float CameraInterpFinishTime; // 0x3c(0x04)
	enum class EViewTargetBlendFunction CameraInterpFinishFunc; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float CameraInterpFinishEaseExp; // 0x44(0x04)
	float DitherHiddenSeconds; // 0x48(0x04)
	float SafePointPriorityAngleLength; // 0x4c(0x04)
	float SafePointPriorityAngle; // 0x50(0x04)
	float SafePointLimitLength; // 0x54(0x04)
	float SafePointLimitAngle; // 0x58(0x04)
	float SafePointLimitHeight; // 0x5c(0x04)
	float GeneralDamageSeconds; // 0x60(0x04)
	float GeneralDamageMaxIntervalSeconds; // 0x64(0x04)
	float UniqueWaitSecdons; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class BattlePrototype.BrainCrashLocationSettings
// Size: 0x40 (Inherited: 0x30)
struct UBrainCrashLocationSettings : UDataAsset {
	struct TArray<struct FBrainCrashSafePoint> SafePoints; // 0x30(0x10)
};

// Class BattlePrototype.BrainCrashPointGroupVolume
// Size: 0x288 (Inherited: 0x268)
struct ABrainCrashPointGroupVolume : AVolume {
	int32_t GroupID; // 0x268(0x04)
	int32_t Priority; // 0x26c(0x04)
	bool bEnabled; // 0x270(0x01)
	bool bUnbound; // 0x271(0x01)
	char pad_272[0x16]; // 0x272(0x16)

	void OnActorEndOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.BrainCrashPointGroupVolume.OnActorEndOverlapFunc // (Final|Native|Public) // @ game+0x1192d00
	void OnActorBeginOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.BrainCrashPointGroupVolume.OnActorBeginOverlapFunc // (Final|Native|Public) // @ game+0x1192c40
};

// Class BattlePrototype.BrainCrashSafePointConfigVolume
// Size: 0x270 (Inherited: 0x268)
struct ABrainCrashSafePointConfigVolume : AVolume {
	bool bDisableMakePoint; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
};

// Class BattlePrototype.BrainCrashSettingVolume
// Size: 0x2b0 (Inherited: 0x268)
struct ABrainCrashSettingVolume : AVolume {
	char pad_268[0x8]; // 0x268(0x08)
	struct FTransform TriggerTransform; // 0x270(0x30)
	int32_t Priority; // 0x2a0(0x04)
	bool bEnabled; // 0x2a4(0x01)
	bool bUnbound; // 0x2a5(0x01)
	char pad_2A6[0xa]; // 0x2a6(0x0a)

	struct FTransform GetTriggerTransformWS(); // Function BattlePrototype.BrainCrashSettingVolume.GetTriggerTransformWS // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1192ad0
	void FitGroundTriggerTransform(); // Function BattlePrototype.BrainCrashSettingVolume.FitGroundTriggerTransform // (Final|Native|Public|BlueprintCallable) // @ game+0x8518d0
};

// Class BattlePrototype.BrainFieldEnemyLocation
// Size: 0x238 (Inherited: 0x230)
struct ABrainFieldEnemyLocation : AActor {
	int32_t LocationNo; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
};

// Class BattlePrototype.BrainFieldEnemyLocationWave
// Size: 0x238 (Inherited: 0x230)
struct ABrainFieldEnemyLocationWave : AActor {
	int32_t LocationNo; // 0x230(0x04)
	bool LongAway; // 0x234(0x01)
	char pad_235[0x3]; // 0x235(0x03)
};

// Class BattlePrototype.BrainFieldManager
// Size: 0xba0 (Inherited: 0x230)
struct ABrainFieldManager : AActor {
	char pad_230[0x8]; // 0x230(0x08)
	int32_t MaxTrainEnemy; // 0x238(0x04)
	bool DebugCollisionMode; // 0x23c(0x01)
	char pad_23D[0x953]; // 0x23d(0x953)
	struct FMulticastInlineDelegate m_EDBrainFieldBattleEndNativeEvent; // 0xb90(0x10)

	void VisibleNormalActorsNative(bool IsVisible, int32_t ObjectNum, int32_t VisibleSplitIndex, struct TArray<struct AActor*> ActorList, struct TArray<struct FBrainFieldRestoreFlag> SettingFlags); // Function BattlePrototype.BrainFieldManager.VisibleNormalActorsNative // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11936c0
	void SetupEnemyWaveTransformNative(struct TArray<struct ARSCharacterBase*> Enemies, struct TArray<struct FBrainFieldWaveEnemyFlag> EnemyFlags, struct FTransform PlayerTransform); // Function BattlePrototype.BrainFieldManager.SetupEnemyWaveTransformNative // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1193440
	void SelectJumpBrainFieldTrainEnemy(struct TArray<struct AActor*> TrainList, struct TArray<struct AActor*> NoTrainList, struct TArray<struct AActor*> TargetEnemyListBattleField, struct TArray<struct AActor*> TargetEnemyListBattleFieldWave, struct TArray<struct AActor*> TargetEnemyListNormal, struct FVector NormalFieldPlayerLocation); // Function BattlePrototype.BrainFieldManager.SelectJumpBrainFieldTrainEnemy // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11931a0
	void IsValidEventCommandTypeAtBrainField(enum class EEventTriggerCheckType EventCommandType, bool CheckBrainTalkEvent, bool IsValid); // Function BattlePrototype.BrainFieldManager.IsValidEventCommandTypeAtBrainField // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1192b30
	bool IsPerformanceSequencer_FromNative(); // Function BattlePrototype.BrainFieldManager.IsPerformanceSequencer_FromNative // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	bool IsInvokeBrainField_FromNative(); // Function BattlePrototype.BrainFieldManager.IsInvokeBrainField_FromNative // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	bool InBranField_FromNative(); // Function BattlePrototype.BrainFieldManager.InBranField_FromNative // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	bool GetUserIsPlayer(); // Function BattlePrototype.BrainFieldManager.GetUserIsPlayer // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void GetNormalLevelActorListNative(struct FBrainFieldNormalLevelActorListInput Inputs, struct TArray<struct AActor*> NormalLevelActors, struct TArray<struct AActor*> Characters, struct TArray<struct AActor*> Weapons, struct TArray<struct AActor*> PsychicObjects, struct TArray<struct AActor*> PsychicGrabs, struct TArray<struct AActor*> EffectBackround, struct TArray<struct AActor*> EffectBackroundMother); // Function BattlePrototype.BrainFieldManager.GetNormalLevelActorListNative // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11922f0
	bool GetLocationSettings(struct TArray<struct AActor*> TrainEnemyList, struct FBrainFieldSettingsLocation OutSettings); // Function BattlePrototype.BrainFieldManager.GetLocationSettings // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11921d0
	int32_t GetEnemyLocationWaveNum(bool LongAway); // Function BattlePrototype.BrainFieldManager.GetEnemyLocationWaveNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1192140
	bool GetEnemyLocationWaveFromNo(struct FTransform EnemyTransform, int32_t LocationNo); // Function BattlePrototype.BrainFieldManager.GetEnemyLocationWaveFromNo // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1192020
	bool GetEnemyLocationWave(struct FTransform EnemyTransform, int32_t Index, bool LongAway); // Function BattlePrototype.BrainFieldManager.GetEnemyLocationWave // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1191ec0
	int32_t GetEnemyLocationNum(); // Function BattlePrototype.BrainFieldManager.GetEnemyLocationNum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1191e90
	bool GetEnemyLocation(struct FTransform EnemyTransform, int32_t Index); // Function BattlePrototype.BrainFieldManager.GetEnemyLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1191d70
	struct TArray<struct AActor*> GetBrainFieldActors(struct ULevelStreaming* Level); // Function BattlePrototype.BrainFieldManager.GetBrainFieldActors // (Final|Native|Public|BlueprintCallable) // @ game+0x1191c90
	void DebugCheckEnemyWaveTransformNativeCollision(struct FTransform PlayerTransform, struct FTransform EnemyTransform, bool ValidIndex, bool UseCollision, int32_t Index, bool LongAway); // Function BattlePrototype.BrainFieldManager.DebugCheckEnemyWaveTransformNativeCollision // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1191a10
	void CalcJumpBrainFieldTransformEnemyCustomCollision2(struct TArray<struct FTransform> OutTransforms, struct TArray<struct AActor*> Enemies, struct FBrainFieldSettingsLocation LocationSetting, float BrainFieldPlayerHeight, bool UserPlayer, struct AActor* UserActor); // Function BattlePrototype.BrainFieldManager.CalcJumpBrainFieldTransformEnemyCustomCollision2 // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1191560
	void CalcJumpBrainFieldTransformEnemyCustomCollision(struct TArray<struct FTransform> OutTransforms, struct TArray<struct AActor*> Enemies, struct TArray<struct FTransform> NormalFieldTransforms, struct FVector CustomCollisionPlayerLocation, float BrainFieldPlayerHeight); // Function BattlePrototype.BrainFieldManager.CalcJumpBrainFieldTransformEnemyCustomCollision // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11917d0
	void CalcJumpBrainFieldTransformEnemy(struct TArray<struct FTransform> OutTransforms, struct TArray<struct AActor*> Enemies, struct TArray<struct FTransform> NormalFieldTransforms, struct TArray<bool> IsWaves, struct FVector NormalFieldPlayerLocation); // Function BattlePrototype.BrainFieldManager.CalcJumpBrainFieldTransformEnemy // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1191320
	void Broadcast_EDBrainFieldBattleEndNativeEvent(enum class EBrainFieldEndType EndType); // Function BattlePrototype.BrainFieldManager.Broadcast_EDBrainFieldBattleEndNativeEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x1191290
};

// Class BattlePrototype.BrainFieldSettingsActor
// Size: 0x460 (Inherited: 0x230)
struct ABrainFieldSettingsActor : AActor {
	struct FBrainFieldSettings Settings; // 0x230(0x28)
	bool bUseCollisionLocationOrigin; // 0x258(0x01)
	bool bUseDefaultPlayerStartLeftRight; // 0x259(0x01)
	char pad_25A[0x6]; // 0x25a(0x06)
	struct FTransform PlayerStartMain; // 0x260(0x30)
	struct FTransform PlayerStartLeft; // 0x290(0x30)
	struct FTransform PlayerStartRight; // 0x2c0(0x30)
	bool bEnemyRelativeJump; // 0x2f0(0x01)
	char pad_2F1[0xf]; // 0x2f1(0x0f)
	struct FTransform EnemyStart01; // 0x300(0x30)
	struct FTransform EnemyStart02; // 0x330(0x30)
	struct FTransform EnemyStart03; // 0x360(0x30)
	struct FTransform EnemyStart04; // 0x390(0x30)
	bool bUseRestoreTransform; // 0x3c0(0x01)
	char pad_3C1[0xf]; // 0x3c1(0x0f)
	struct FTransform PlayerRestoreMain; // 0x3d0(0x30)
	struct FTransform PlayerRestoreLeft; // 0x400(0x30)
	struct FTransform PlayerRestoreRight; // 0x430(0x30)
};

// Class BattlePrototype.BrainMessageData
// Size: 0x30 (Inherited: 0x28)
struct UBrainMessageData : UObject {
	struct UBrainMessageDBAsset* brainMessageDataAsset_; // 0x28(0x08)

	bool LoadDataAsset(struct FString dtPath); // Function BattlePrototype.BrainMessageData.LoadDataAsset // (Final|Native|Public|BlueprintCallable) // @ game+0x1196d50
	struct FBrainMessageDBDataCell GetBrainMessageDataCellFromAsset(struct FName RowName, bool isFound); // Function BattlePrototype.BrainMessageData.GetBrainMessageDataCellFromAsset // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11963b0
	struct UBrainMessageDBAsset* GetBrainMessageDataAsset(); // Function BattlePrototype.BrainMessageData.GetBrainMessageDataAsset // (Final|Native|Public|BlueprintCallable) // @ game+0x1196380
	int32_t GetAllThreadNum(); // Function BattlePrototype.BrainMessageData.GetAllThreadNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1196230
};

// Class BattlePrototype.BrainMessageDBAsset
// Size: 0x78 (Inherited: 0x28)
struct UBrainMessageDBAsset : UObject {
	struct TMap<struct FName, struct FBrainMessageDBDataCell> brainMessageDBMap_; // 0x28(0x50)

	void ConvertArray(struct FBrainMessageContentData bMesData, struct FBrainMessageRowDataCell rowCell); // Function BattlePrototype.BrainMessageDBAsset.ConvertArray // (Final|Native|Private|HasOutParms) // @ game+0x1196040
	void Convert(); // Function BattlePrototype.BrainMessageDBAsset.Convert // (Final|Native|Public) // @ game+0x8518d0
};

// Class BattlePrototype.BrainMessageParamManager
// Size: 0x90 (Inherited: 0x28)
struct UBrainMessageParamManager : UObject {
	struct FMulticastInlineDelegate OnChangeNoticeUiStateDelegate; // 0x28(0x10)
	struct URSGameInstance* gameInst_; // 0x38(0x08)
	struct UBrainMessageData* brainMessageData_; // 0x40(0x08)
	struct ALevelManager* levelManager_; // 0x48(0x08)
	struct TArray<struct FThreadData> threadDatas_; // 0x50(0x10)
	char pad_60[0x28]; // 0x60(0x28)
	bool bUseDebugReplyTime_DEBUG; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	float debugReplyTime_DEBUG; // 0x8c(0x04)

	void UpdateMessageIndication_BindInner(int32_t threadNum); // Function BattlePrototype.BrainMessageParamManager.UpdateMessageIndication_BindInner // (Final|Native|Public) // @ game+0x11972b0
	void UpdateMessageIndication_Bind(); // Function BattlePrototype.BrainMessageParamManager.UpdateMessageIndication_Bind // (Final|Native|Public) // @ game+0x1197290
	void UpdateMessageIndication(int32_t threadNum, int32_t messageNum, bool isReply, bool isNoticeEnable); // Function BattlePrototype.BrainMessageParamManager.UpdateMessageIndication // (Final|Native|Public|BlueprintCallable) // @ game+0x1197150
	void StopThreadTimer(); // Function BattlePrototype.BrainMessageParamManager.StopThreadTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x1197130
	void SetStopUpdatingMessageFlag(bool bStop); // Function BattlePrototype.BrainMessageParamManager.SetStopUpdatingMessageFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x11970a0
	void SetIsOpenThred(int32_t threadNum, bool IsOpen); // Function BattlePrototype.BrainMessageParamManager.SetIsOpenThred // (Final|Native|Public|BlueprintCallable) // @ game+0x1196fe0
	void SetAlreadyLookNum(int32_t threadNum, int32_t lookNum); // Function BattlePrototype.BrainMessageParamManager.SetAlreadyLookNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1196f20
	void SetAlreadyEmergenceNum(int32_t threadNum, int32_t lookNum); // Function BattlePrototype.BrainMessageParamManager.SetAlreadyEmergenceNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1196e60
	void ResumeThreadTimer(); // Function BattlePrototype.BrainMessageParamManager.ResumeThreadTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x1196e40
	bool IsReadyToReply(int32_t threadNum, int32_t messageNum, bool ignoreCommonTimming); // Function BattlePrototype.BrainMessageParamManager.IsReadyToReply // (Final|Native|Public|BlueprintCallable) // @ game+0x1196c50
	bool IsBanToReply(int32_t threadNum, int32_t messageNum); // Function BattlePrototype.BrainMessageParamManager.IsBanToReply // (Final|Native|Public|BlueprintCallable) // @ game+0x1196b90
	bool IsActiveThreadTimer(int32_t threadNum); // Function BattlePrototype.BrainMessageParamManager.IsActiveThreadTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x1196b00
	void InitData(struct URSGameInstance* gameInst); // Function BattlePrototype.BrainMessageParamManager.InitData // (Final|Native|Public|BlueprintCallable) // @ game+0x1196a80
	void InitAtExNewGame(enum class EPlayerID MainPlayerID); // Function BattlePrototype.BrainMessageParamManager.InitAtExNewGame // (Final|Native|Public|BlueprintCallable) // @ game+0x1196a00
	bool GetTiedBondsEPID(int32_t threadNum, int32_t messageNum, struct FString bondsBPReference); // Function BattlePrototype.BrainMessageParamManager.GetTiedBondsEPID // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11968e0
	int32_t GetThreadNumFromThreadID(struct FName threadID); // Function BattlePrototype.BrainMessageParamManager.GetThreadNumFromThreadID // (Final|Native|Public|BlueprintCallable) // @ game+0x1196850
	void GetSortedIndexArray(enum class EBrainMesSortType SortType, struct TArray<int32_t> sortedIndexArray); // Function BattlePrototype.BrainMessageParamManager.GetSortedIndexArray // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1196760
	int32_t GetNextMessageNum(int32_t threadNum); // Function BattlePrototype.BrainMessageParamManager.GetNextMessageNum // (Final|Native|Public|BlueprintCallable) // @ game+0x11966d0
	bool GetIsOpenThread(int32_t threadNum); // Function BattlePrototype.BrainMessageParamManager.GetIsOpenThread // (Final|Native|Public|BlueprintCallable) // @ game+0x1196640
	struct TArray<int32_t> GetEmergenceMessageNum(int32_t threadNum); // Function BattlePrototype.BrainMessageParamManager.GetEmergenceMessageNum // (Final|Native|Public|BlueprintCallable) // @ game+0x11965a0
	int32_t GetAlreadyLookNum(int32_t threadNum); // Function BattlePrototype.BrainMessageParamManager.GetAlreadyLookNum // (Final|Native|Public|BlueprintCallable) // @ game+0x11962f0
	int32_t GetAlreadyEmergenceNum(int32_t threadNum); // Function BattlePrototype.BrainMessageParamManager.GetAlreadyEmergenceNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1196260
	void FinishWork(struct URSGameInstance* gameInst); // Function BattlePrototype.BrainMessageParamManager.FinishWork // (Final|Native|Public|BlueprintCallable) // @ game+0x79d490
	void CheckMessageConditions(int32_t threadNum, int32_t messageNum, bool isReply, bool isNoticeEnable); // Function BattlePrototype.BrainMessageParamManager.CheckMessageConditions // (Final|Native|Public) // @ game+0x1195f00
	bool CheckAppropriateThreadFromTitleID(struct FName TitleID, enum class EPlayerID MainPlayerID); // Function BattlePrototype.BrainMessageParamManager.CheckAppropriateThreadFromTitleID // (Final|Native|Public|BlueprintCallable) // @ game+0x1195e40
	void AllOpenMessageIgnorConditionsAndLock(int32_t targetThread); // Function BattlePrototype.BrainMessageParamManager.AllOpenMessageIgnorConditionsAndLock // (Final|Native|Public|BlueprintCallable) // @ game+0x1195dc0
	void AddMessageIgnorConditions(int32_t targetThread, int32_t messageNum); // Function BattlePrototype.BrainMessageParamManager.AddMessageIgnorConditions // (Final|Native|Public|BlueprintCallable) // @ game+0x1195d00
};

// Class BattlePrototype.BrainTalkBattleManager
// Size: 0x9a8 (Inherited: 0x28)
struct UBrainTalkBattleManager : UObject {
	struct URSGameInstance* _gameInstance; // 0x28(0x08)
	struct TArray<struct FSystemBrainTalkManageStructParam> m_BrainTalkSystemConditionManageList; // 0x30(0x10)
	struct TArray<struct FSystemBrainTalkManageStructParam> m_BrainTalkEnemyConditionManageList; // 0x40(0x10)
	struct TArray<struct FSystemBrainTalkManageStructParam> m_BrainTalkTutorialConditionManageList; // 0x50(0x10)
	struct TArray<struct FSystemBrainTalkManageStructParam> m_BrainTalkGimmickConditionManageList; // 0x60(0x10)
	struct FBrainTalkOnceCheck_Category m_BrainTalkOnceCheck; // 0x70(0x10)
	struct TArray<struct FBrainTalkBt_WataruHarukaExistenceProgressID> m_BrainTalkBt_WataruHarukaNoExistenceProgressIDList; // 0x80(0x10)
	struct TArray<struct FBrainTalkBt_InvalidProgressID> m_BrainTalkBt_InvalidProgressIDList; // 0x90(0x10)
	struct TArray<struct FBrainTalkCh_InvalidProgressID> m_BrainTalkCh_InvalidProgressIDList; // 0xa0(0x10)
	struct TArray<enum class EBrainTalkChGroup> m_BrainTalkCharacterGroup; // 0xb0(0x10)
	struct TArray<struct FBrainTalkBt_Hp30p> m_BrainTalkBt_Hp30pList; // 0xc0(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_Hp30pList_Param; // 0xd0(0x10)
	struct TArray<struct FBrainTalkBt_KillByEn> m_BrainTalkBt_KillByEnList; // 0xe0(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillByEnList_Param; // 0xf0(0x10)
	struct TArray<struct FBrainTalkBt_BrainCrashByEn> m_BrainTalkBt_BrainCrashByEnList; // 0x100(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_BrainCrashByEnList_Param; // 0x110(0x10)
	struct TArray<struct FBrainTalkBt_BadStateByEn> m_BrainTalkBt_BadStateByEnList; // 0x120(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_BadStateByEnList_Param; // 0x130(0x10)
	struct TArray<struct FBrainTalkBt_BadStateForEn> m_BrainTalkBt_BadStateForEnList; // 0x140(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_BadStateForEnList_Param; // 0x150(0x10)
	struct TArray<struct FBrainTalkBt_Recovery> m_BrainTalkBt_RecoveryList; // 0x160(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_RecoveryList_Param; // 0x170(0x10)
	struct TArray<struct FBrainTalkBt_Revival> m_BrainTalkBt_RevivalList; // 0x180(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_RevivalList_Param; // 0x190(0x10)
	struct TArray<struct FBrainTalkBt_BFActivate> m_BrainTalkBt_BFActivateList; // 0x1a0(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_BFActivateList_Param; // 0x1b0(0x10)
	struct TArray<struct FBrainTalkBt_SasCombo> m_BrainTalkBt_SasComboList; // 0x1c0(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_SasComboList_Param; // 0x1d0(0x10)
	struct TArray<struct FBrainTalkBt_PsychicCombo> m_BrainTalkBt_PsychicComboList; // 0x1e0(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_PsychicComboList_Param; // 0x1f0(0x10)
	struct TArray<struct FBrainTalkBt_DriveActive> m_BrainTalkBt_DriveActiveList; // 0x200(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DriveActiveList_Param; // 0x210(0x10)
	struct TArray<struct FBrainTalkBt_HiKizunaEffect> m_BrainTalkBt_HiKizunaEffectList; // 0x220(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_HiKizunaEffectList_Param; // 0x230(0x10)
	struct TArray<struct FBrainTalkBt_TouchBFWall> m_BrainTalkBt_TouchBFWallList; // 0x240(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_TouchBFWallList_Param; // 0x250(0x10)
	struct TArray<struct FBrainTalkBt_NearCC> m_BrainTalkBt_NearCCList; // 0x260(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_NearCCList_Param; // 0x270(0x10)
	struct TArray<struct FBrainTalkBt_BattleEscape> m_BrainTalkBt_BattleEscapeList; // 0x280(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_BattleEscapeList_Param; // 0x290(0x10)
	struct TArray<struct FBrainTalkBt_KizunaLvUp> m_BrainTalkBt_KizunaLvUpList; // 0x2a0(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KizunaLvUpList_Param; // 0x2b0(0x10)
	enum class EBrainTalkKizunaLvUpFlow m_KizunaLvUpFlow; // 0x2c0(0x01)
	char pad_2C1[0x3]; // 0x2c1(0x03)
	int32_t m_KizunaLvUpReplayTime; // 0x2c4(0x04)
	struct TArray<enum class EPlayerID> m_KizunaLvUpReplayPlayerList; // 0x2c8(0x10)
	struct TArray<struct FBrainTalkBt_DamageTakeOver> m_BrainTalkBt_DamageTakeOverList; // 0x2d8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DamageTakeOverList_Param; // 0x2e8(0x10)
	struct TArray<struct FBrainTalkBt_LvUp> m_BrainTalkBt_LvUpList; // 0x2f8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_LvUpList_Param; // 0x308(0x10)
	struct TArray<struct FBrainTalkBt_DeadInarow> m_BrainTalkBt_DeadInarowList; // 0x318(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DeadInarowList_Param; // 0x328(0x10)
	struct TArray<struct FBrainTalkBt_SallyTimes> m_BrainTalkBt_SallyTimesList; // 0x338(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_SallyTimesList_Param; // 0x348(0x10)
	struct TArray<struct FBrainTalkBt_NoSallyTimes> m_BrainTalkBt_NoSallyTimesList; // 0x358(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_NoSallyTimesList_Param; // 0x368(0x10)
	struct TArray<struct FBrainTalkBt_JumpOff> m_BrainTalkBt_JumpOffList; // 0x378(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_JumpOffList_Param; // 0x388(0x10)
	struct TArray<struct FBrainTalkBt_PLChangeAttachment> m_BrainTalkBt_PLChangeAttachmentList; // 0x398(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_PLChangeAttachmentList_Param; // 0x3a8(0x10)
	struct TArray<struct FBrainTalkBt_PLDead> m_BrainTalkBt_PLDeadList; // 0x3b8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_PLDeadList_Param; // 0x3c8(0x10)
	struct TArray<struct FBrainTalkBt_KillEnRest> m_BrainTalkBt_KillEnRestList; // 0x3d8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillEnRestList_Param; // 0x3e8(0x10)
	struct TArray<struct FBrainTalkBt_KillAllEnForPT> m_BrainTalkBt_KillAllEnForPTList; // 0x3f8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillAllEnForPTList_Param; // 0x408(0x10)
	struct TArray<struct FBrainTalkBt_KillAllEnForPL> m_BrainTalkBt_KillAllEnForPLList; // 0x418(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillAllEnForPLList_Param; // 0x428(0x10)
	struct TArray<struct FBrainTalkBt_KillAllEnShortTime> m_BrainTalkBt_KillAllEnShortTimeList; // 0x438(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillAllEnShortTimeList_Param; // 0x448(0x10)
	struct TArray<struct FBrainTalkBt_KillAllEnStrEn> m_BrainTalkBt_KillAllEnStrEnList; // 0x458(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillAllEnStrEnList_Param; // 0x468(0x10)
	struct TArray<struct FBrainTalkBt_KillAllEnManyEn> m_BrainTalkBt_KillAllEnManyEnList; // 0x478(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillAllEnManyEnList_Param; // 0x488(0x10)
	struct TArray<struct FBrainTalkBt_KillAllEnManyWeakEn> m_BrainTalkBt_KillAllEnManyWeakEnList; // 0x498(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillAllEnManyWeakEnList_Param; // 0x4a8(0x10)
	struct TArray<struct FBrainTalkBt_KillEnStrategy> m_BrainTalkBt_KillEnStrategyList; // 0x4b8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillEnStrategyList_Param; // 0x4c8(0x10)
	struct TArray<struct FBrainTalkBt_DiscStrEn> m_BrainTalkBt_DiscStrEnList; // 0x4d8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DiscStrEnList_Param; // 0x4e8(0x10)
	struct TArray<struct FBrainTalkBt_DestroyShell> m_BrainTalkBt_DestroyShellList; // 0x4f8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DestroyShellList_Param; // 0x508(0x10)
	struct TArray<struct FBrainTalkBt_EnemyDown> m_BrainTalkBt_EnemyDownList; // 0x518(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_EnemyDownList_Param; // 0x528(0x10)
	struct TArray<struct FBrainTalkBt_DiscEn> m_BrainTalkBt_DiscEnList; // 0x538(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DiscEnList_Param; // 0x548(0x10)
	struct TArray<struct FBrainTalkBt_DispCrashTrg> m_BrainTalkBt_DispCrashTrgList; // 0x558(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DispCrashTrgList_Param; // 0x568(0x10)
	struct TArray<struct FBrainTalkBt_KillEnemyBC> m_BrainTalkBt_KillEnemyBCList; // 0x578(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillEnemyBCList_Param; // 0x588(0x10)
	struct TArray<struct FBrainTalkBt_EnBerserkSign> m_BrainTalkBt_EnBerserkSignList; // 0x598(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_EnBerserkSignList_Param; // 0x5a8(0x10)
	struct TArray<struct FBrainTalkBt_EnBerserk> m_BrainTalkBt_EnBerserkList; // 0x5b8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_EnBerserkList_Param; // 0x5c8(0x10)
	struct TArray<struct FBrainTalkBt_AttackEnShell> m_BrainTalkBt_AttackEnShellList; // 0x5d8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_AttackEnShellList_Param; // 0x5e8(0x10)
	struct TArray<struct FBrainTalkBt_AttackEnWeak> m_BrainTalkBt_AttackEnWeakList; // 0x5f8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_AttackEnWeakList_Param; // 0x608(0x10)
	struct TArray<struct FBrainTalkBt_FirstStrike> m_BrainTalkBt_FirstStrikeList; // 0x618(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_FirstStrikeList_Param; // 0x628(0x10)
	struct TArray<struct FBrainTalkBt_OilEnAtkFire> m_BrainTalkBt_OilEnAtkFireList; // 0x638(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_OilEnAtkFireList_Param; // 0x648(0x10)
	struct TArray<struct FBrainTalkBt_WaterEnAtkElectric> m_BrainTalkBt_WaterEnAtkElectricList; // 0x658(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_WaterEnAtkElectricList_Param; // 0x668(0x10)
	struct TArray<struct FBrainTalkBt_DiscStealth> m_BrainTalkBt_DiscStealthList; // 0x678(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DiscStealthList_Param; // 0x688(0x10)
	struct TArray<struct FBrainTalkBt_DiscSasValidEn> m_BrainTalkBt_DiscSasValidEnList; // 0x698(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DiscSasValidEnList_Param; // 0x6a8(0x10)
	struct TArray<struct FBrainTalkBt_StealthLosePL> m_BrainTalkBt_StealthLosePLList; // 0x6b8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_StealthLosePLList_Param; // 0x6c8(0x10)
	struct TArray<struct FBrainTalkBt_SasNoUse> m_BrainTalkBt_SasNoUseList; // 0x6d8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_SasNoUseList_Param; // 0x6e8(0x10)
	struct TArray<struct FBrainTalkBt_SasContinuity> m_BrainTalkBt_SasContinuityList; // 0x6f8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_SasContinuityList_Param; // 0x708(0x10)
	struct TArray<struct FBrainTalkBt_SasHoloPossible> m_BrainTalkBt_SasHoloPossibleList; // 0x718(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_SasHoloPossibleList_Param; // 0x728(0x10)
	struct TArray<struct FBrainTalkBt_SasHoloPursuit> m_BrainTalkBt_SasHoloPursuitList; // 0x738(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_SasHoloPursuitList_Param; // 0x748(0x10)
	struct TArray<struct FBrainTalkBt_GetItem> m_BrainTalkBt_GetItemList; // 0x758(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_GetItemList_Param; // 0x768(0x10)
	struct TArray<struct FBrainTalkBt_EnemyDrop> m_BrainTalkBt_EnemyDropList; // 0x778(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_EnemyDropList_Param; // 0x788(0x10)
	struct TArray<struct FBrainTalkBt_UnopenedTreasure> m_BrainTalkBt_UnopenedTreasureList; // 0x798(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_UnopenedTreasureList_Param; // 0x7a8(0x10)
	struct TArray<struct FBrainTalkBt_GatherPoint> m_BrainTalkBt_GatherPointList; // 0x7b8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_GatherPointList_Param; // 0x7c8(0x10)
	struct TArray<struct FBrainTalkBt_RecoveryItemZero> m_BrainTalkBt_RecoveryItemZeroList; // 0x7d8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_RecoveryItemZeroList_Param; // 0x7e8(0x10)
	struct TArray<struct FBrainTalkBt_DiscQuestEnemy> m_BrainTalkBt_DiscQuestEnemyList; // 0x7f8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DiscQuestEnemyList_Param; // 0x808(0x10)
	struct TArray<struct FBrainTalkBt_ClearQuest> m_BrainTalkBt_ClearQuestList; // 0x818(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_ClearQuestList_Param; // 0x828(0x10)
	struct TArray<struct FBrainTalkBt_BirthKizunaEp> m_BrainTalkBt_BirthKizunaEpList; // 0x838(0x10)
	struct TArray<enum class EPlayerID> m_BrainTalkBt_BirthKizunaEp_FadePlayList; // 0x848(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_BirthKizunaEpList_Param; // 0x858(0x10)
	struct TArray<struct FBrainTalkBt_KillQuestTgtEn> m_BrainTalkBt_KillQuestTgtEnList; // 0x868(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_KillQuestTgtEnList_Param; // 0x878(0x10)
	struct TArray<struct FBrainTalkBt_GetQuestTgtItem> m_BrainTalkBt_GetQuestTgtItemList; // 0x888(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_GetQuestTgtItemList_Param; // 0x898(0x10)
	struct TArray<struct FBrainTalkBt_PTChangeAttachment> m_BrainTalkBt_PTChangeAttachmentList; // 0x8a8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_PTChangeAttachmentList_Param; // 0x8b8(0x10)
	struct TArray<struct FBrainTalkBt_DriveGaugeMax> m_BrainTalkBt_DriveGaugeMaxList; // 0x8c8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_DriveGaugeMaxList_Param; // 0x8d8(0x10)
	struct TArray<struct FBrainTalkBt_EquipStrongestWeapon> m_BrainTalkBt_EquipStrongestWeaponList; // 0x8e8(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_EquipStrongestWeaponList_Param; // 0x8f8(0x10)
	struct TArray<struct FBrainTalkBt_WaitingVoice> m_BrainTalkBt_WaitingVoiceList; // 0x908(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_WaitingVoiceList_Param; // 0x918(0x10)
	struct TArray<struct FBrainTalkBt_RecoveryHpToPL> m_BrainTalkBt_RecoveryHpToPLList; // 0x928(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_RecoveryHpToPLList_Param; // 0x938(0x10)
	struct TArray<struct FBrainTalkBt_RecoveryAbToPL> m_BrainTalkBt_RecoveryAbToPLList; // 0x948(0x10)
	struct FBrainTalkBattle_ConditionsParam m_BrainTalkBt_RecoveryAbToPLList_Param; // 0x958(0x10)
	struct TArray<struct FBrainTalkEm_ConditionParam> m_BrainTalkEm_ConditionParamList; // 0x968(0x10)
	struct TArray<struct FBrainTalkTutorial_ConditionParam> m_BrainTalkTutorial_ConditionParamList; // 0x978(0x10)
	struct TArray<struct FBrainTalkGimmick_ConditionParam> m_BrainTalkGimmick_ConditionParamList; // 0x988(0x10)
	char pad_998[0x10]; // 0x998(0x10)
};

// Class BattlePrototype.BrainTalkManager
// Size: 0x2d8 (Inherited: 0x230)
struct ABrainTalkManager : ARSActorSystemBase {
	char pad_230[0x8]; // 0x230(0x08)
	struct URSGameInstance* _gameInstance; // 0x238(0x08)
	char pad_240[0x10]; // 0x240(0x10)
	struct UBrainTalkBattleManager* m_pBrainTalkBattleManager; // 0x250(0x08)
	struct TArray<struct FBrainTalk_CategoryDatatable> m_BrainTalkMasterDataQueCategoryDatatableList; // 0x258(0x10)
	struct TArray<struct FBrainTalkMasterData> m_BrainTalkMasterDataQueList; // 0x268(0x10)
	char pad_278[0x8]; // 0x278(0x08)
	struct TArray<int32_t> m_StrongestWeaponIdList; // 0x280(0x10)
	bool m_isUpdateEquipIdList; // 0x290(0x01)
	char pad_291[0x7]; // 0x291(0x07)
	struct TArray<struct FPlayerInfo> m_OpenMenuWindowEquipIdList; // 0x298(0x10)
	struct UDataTable* m_dataTable; // 0x2a8(0x08)
	enum class EBrainTalkPriority m_Priority; // 0x2b0(0x01)
	char pad_2B1[0x3]; // 0x2b1(0x03)
	int32_t m_ReferenceIndex; // 0x2b4(0x04)
	float m_massageWaitTime; // 0x2b8(0x04)
	bool m_isPauseBrainTalk; // 0x2bc(0x01)
	bool m_isFinishBrainTalk; // 0x2bd(0x01)
	bool m_isNoStopBrainTalk; // 0x2be(0x01)
	char pad_2BF[0x1]; // 0x2bf(0x01)
	struct TArray<struct FBrainTalkBt_PlayInfo> m_BrainTalkBt_PlayReqList; // 0x2c0(0x10)
	bool m_isStartTalkEventPauseBT; // 0x2d0(0x01)
	bool m_isStartTalkEventKeepPlayingBT; // 0x2d1(0x01)
	bool m_DebbugBrainTalkAllInvalidFlag; // 0x2d2(0x01)
	bool m_DebbugBrainTalkBTInvalidFlag; // 0x2d3(0x01)
	bool m_DebugDispBrainTalkLogFlag; // 0x2d4(0x01)
	char pad_2D5[0x3]; // 0x2d5(0x03)

	void StopBrainTalkVoice(); // Function BattlePrototype.BrainTalkManager.StopBrainTalkVoice // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3d80
	void StopBrainTalk_BPFL_FromNative(); // Function BattlePrototype.BrainTalkManager.StopBrainTalk_BPFL_FromNative // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void StopBrainTalk(); // Function BattlePrototype.BrainTalkManager.StopBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3d60
	void StartBrainTalk_FromNative2(struct FName BrainTalkID, enum class EBrainTalkCategory Category); // Function BattlePrototype.BrainTalkManager.StartBrainTalk_FromNative2 // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void StartBrainTalk_FromNative(struct FBrainTalkMasterData BrainTalkData, struct FBrainTalk_CategoryDatatable categoryDatatable); // Function BattlePrototype.BrainTalkManager.StartBrainTalk_FromNative // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void StartBrainTalk(); // Function BattlePrototype.BrainTalkManager.StartBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3d40
	void SetStrongestWeaponId(enum class EPlayerID Player, int32_t ID); // Function BattlePrototype.BrainTalkManager.SetStrongestWeaponId // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3c80
	void SetReferenceIndex(int32_t Num); // Function BattlePrototype.BrainTalkManager.SetReferenceIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3c00
	void SetOpenMenuWindowEquipWeaponIdList(); // Function BattlePrototype.BrainTalkManager.SetOpenMenuWindowEquipWeaponIdList // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3be0
	void SetNewRowBrainTalk(float WaitTime); // Function BattlePrototype.BrainTalkManager.SetNewRowBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3b60
	void SetMassageWaitTime(float sec); // Function BattlePrototype.BrainTalkManager.SetMassageWaitTime // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3ae0
	void SetIsStartTalkEventPauseBT(bool Flag); // Function BattlePrototype.BrainTalkManager.SetIsStartTalkEventPauseBT // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3a60
	void SetIsStartTalkEventKeepPlayingBT(bool Flag); // Function BattlePrototype.BrainTalkManager.SetIsStartTalkEventKeepPlayingBT // (Final|Native|Public|BlueprintCallable) // @ game+0x11a39e0
	void SetIsNoStopBrainTalk(bool Flag); // Function BattlePrototype.BrainTalkManager.SetIsNoStopBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3960
	void SetIsFinishBrainTalk(bool Flag); // Function BattlePrototype.BrainTalkManager.SetIsFinishBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a38e0
	void SetDebugDispBrainTalkLogFlag(bool Flag); // Function BattlePrototype.BrainTalkManager.SetDebugDispBrainTalkLogFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3860
	void SetDebbugBrainTalkBTInvalidFlag(bool Flag); // Function BattlePrototype.BrainTalkManager.SetDebbugBrainTalkBTInvalidFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x11a37e0
	void SetDebbugBrainTalkAllInvalidFlag(bool Flag); // Function BattlePrototype.BrainTalkManager.SetDebbugBrainTalkAllInvalidFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3760
	void PlaySystemBrainTalk(enum class EBrainTalkSystemType Type, int32_t Index, enum class EPlayerID player1); // Function BattlePrototype.BrainTalkManager.PlaySystemBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3660
	void PauseBrainTalk(bool IsPause); // Function BattlePrototype.BrainTalkManager.PauseBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a35d0
	void OpenBrainTalkUI(int32_t characterId, int32_t ExpressionID, struct FString messageID, float DrawSecond); // Function BattlePrototype.BrainTalkManager.OpenBrainTalkUI // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3470
	void LoadBrainTalkDatatable(struct FBrainTalkMasterData BrainTalkData); // Function BattlePrototype.BrainTalkManager.LoadBrainTalkDatatable // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3360
	bool IsTimingEnableCheck(); // Function BattlePrototype.BrainTalkManager.IsTimingEnableCheck // (Final|Native|Private|BlueprintCallable) // @ game+0x11a3330
	bool IsSysInvalidProgressIDCheck(enum class EBrainTalkBtGroup Group); // Function BattlePrototype.BrainTalkManager.IsSysInvalidProgressIDCheck // (Final|Native|Public|BlueprintCallable) // @ game+0x11a32a0
	bool IsStartTalkEventPauseBT(); // Function BattlePrototype.BrainTalkManager.IsStartTalkEventPauseBT // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3280
	bool IsStartTalkEventKeepPlayingBT(); // Function BattlePrototype.BrainTalkManager.IsStartTalkEventKeepPlayingBT // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3260
	bool IsNoStopBrainTalk(); // Function BattlePrototype.BrainTalkManager.IsNoStopBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3240
	bool IsLowerPriority(); // Function BattlePrototype.BrainTalkManager.IsLowerPriority // (Final|Native|Public|BlueprintCallable) // @ game+0x11a3210
	bool IsGameOverCheck(); // Function BattlePrototype.BrainTalkManager.IsGameOverCheck // (Final|Native|Public|BlueprintCallable) // @ game+0x11a31e0
	bool IsFinishLoad(); // Function BattlePrototype.BrainTalkManager.IsFinishLoad // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a31b0
	bool IsFinishBrainTalk(); // Function BattlePrototype.BrainTalkManager.IsFinishBrainTalk // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a3190
	bool IsFindBrainTalkOnceCheck_LoadReset(enum class EBrainTalkCategory _Category, struct FName _ID); // Function BattlePrototype.BrainTalkManager.IsFindBrainTalkOnceCheck_LoadReset // (Final|Native|Public|BlueprintCallable) // @ game+0x11a30d0
	bool IsEnableCheck(bool isPlaySuppressionCheck, bool isPlayerHPCheck); // Function BattlePrototype.BrainTalkManager.IsEnableCheck // (Final|Native|Private|BlueprintCallable) // @ game+0x11a2ff0
	bool IsDoEventCheck(); // Function BattlePrototype.BrainTalkManager.IsDoEventCheck // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2fc0
	void InitializeStrongestWeaponIdList(); // Function BattlePrototype.BrainTalkManager.InitializeStrongestWeaponIdList // (Event|Public|BlueprintEvent) // @ game+0x1685580
	int32_t GetReferenceIndex(); // Function BattlePrototype.BrainTalkManager.GetReferenceIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1164520
	enum class EBrainTalkPriorityCheckResult GetPriorityCheck(enum class EBrainTalkPriority playReqPriority); // Function BattlePrototype.BrainTalkManager.GetPriorityCheck // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2f30
	enum class EBrainTalkPriority GetPriority(); // Function BattlePrototype.BrainTalkManager.GetPriority // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1166da0
	float GetMassageWaitTime(); // Function BattlePrototype.BrainTalkManager.GetMassageWaitTime // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a2f10
	bool GetDebugDispBrainTalkLogFlag(); // Function BattlePrototype.BrainTalkManager.GetDebugDispBrainTalkLogFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2ef0
	struct UDataTable* GetDataTable(); // Function BattlePrototype.BrainTalkManager.GetDataTable // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a2ed0
	bool GetCategoryDataTableRow(enum class EBrainTalkCategory Category, struct FName BrainTalkID, struct FBrainTalkMasterData RowData); // Function BattlePrototype.BrainTalkManager.GetCategoryDataTableRow // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11a2d70
	struct UDataTable* GetCategoryDataTable(enum class EBrainTalkCategory Category); // Function BattlePrototype.BrainTalkManager.GetCategoryDataTable // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2ce0
	bool GetBrainTalkParam(struct FName BrainTalkID, enum class EBrainTalkCategory Category, float OccurRate, bool IsOnce); // Function BattlePrototype.BrainTalkManager.GetBrainTalkParam // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11a2b60
	struct FMessageDataCell GetBrainTalkMessage(struct FString messageID); // Function BattlePrototype.BrainTalkManager.GetBrainTalkMessage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a2990
	struct TArray<struct FBrainTalkMasterData> GetBrainTalkMasterDataQueList(); // Function BattlePrototype.BrainTalkManager.GetBrainTalkMasterDataQueList // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a27f0
	int32_t GetBrainTalkMapGimmickWaitTime(enum class EBrainTalkGimmickCondition Type, struct FString conditionLabel); // Function BattlePrototype.BrainTalkManager.GetBrainTalkMapGimmickWaitTime // (Final|Native|Public|BlueprintCallable) // @ game+0x11a26c0
	void CloseBrainTalkUI(); // Function BattlePrototype.BrainTalkManager.CloseBrainTalkUI // (Final|Native|Public|BlueprintCallable) // @ game+0x11a26a0
	void ClearBrainTalkMasterDataQueList(); // Function BattlePrototype.BrainTalkManager.ClearBrainTalkMasterDataQueList // (Final|Native|Public|BlueprintCallable) // @ game+0x11a25d0
	bool CheckEquipChangeBrainTalk(); // Function BattlePrototype.BrainTalkManager.CheckEquipChangeBrainTalk // (Final|Native|Public|BlueprintCallable) // @ game+0x11a25a0
	void CallbackFinishBrainTalk(); // Function BattlePrototype.BrainTalkManager.CallbackFinishBrainTalk // (Event|Public|BlueprintEvent) // @ game+0x1685580
	bool BrainTalkTuto_tutorial_m_J(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_m_J // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2570
	bool BrainTalkTuto_tutorial_m_I(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_m_I // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2540
	bool BrainTalkTuto_tutorial_m_H(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_m_H // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2510
	bool BrainTalkTuto_tutorial_m_G(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_m_G // (Final|Native|Public|BlueprintCallable) // @ game+0x11a24e0
	bool BrainTalkTuto_tutorial_m_F(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_m_F // (Final|Native|Public|BlueprintCallable) // @ game+0x11a24b0
	bool BrainTalkTuto_tutorial_f_J(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_f_J // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2480
	bool BrainTalkTuto_tutorial_f_I(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_f_I // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2450
	bool BrainTalkTuto_tutorial_f_H(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_f_H // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2420
	bool BrainTalkTuto_tutorial_f_G(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_f_G // (Final|Native|Public|BlueprintCallable) // @ game+0x11a23f0
	bool BrainTalkTuto_tutorial_f_F(); // Function BattlePrototype.BrainTalkManager.BrainTalkTuto_tutorial_f_F // (Final|Native|Public|BlueprintCallable) // @ game+0x11a23c0
	bool BrainTalkMapGimmick(enum class EBrainTalkGimmickCondition Type, struct FString conditionLabel); // Function BattlePrototype.BrainTalkManager.BrainTalkMapGimmick // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2290
	void BrainTalkLoadWork(); // Function BattlePrototype.BrainTalkManager.BrainTalkLoadWork // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2270
	bool BrainTalkEm_WaterCharge_WaterAttack(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_WaterCharge_WaterAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x11a13d0
	bool BrainTalkEm_OilCharge_OilAttack(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_OilCharge_OilAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x11a13a0
	bool BrainTalkEm_np1100_06(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_np1100_06 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2240
	bool BrainTalkEm_np1100_05(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_np1100_05 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2210
	bool BrainTalkEm_np1100_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_np1100_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a21e0
	bool BrainTalkEm_np1100_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_np1100_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a21b0
	bool BrainTalkEm_np1100_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_np1100_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2180
	bool BrainTalkEm_np1100_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_np1100_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2150
	bool BrainTalkEm_FlameCharge_OilMember(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_FlameCharge_OilMember // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1370
	bool BrainTalkEm_FlameCharge_FlameAttack(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_FlameCharge_FlameAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1340
	bool BrainTalkEm_em8300_06(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8300_06 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2120
	bool BrainTalkEm_em8300_05(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8300_05 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a20f0
	bool BrainTalkEm_em8300_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8300_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a20c0
	bool BrainTalkEm_em8300_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8300_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2090
	bool BrainTalkEm_em8300_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8300_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2060
	bool BrainTalkEm_em8300_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8300_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2030
	bool BrainTalkEm_em8200_08(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8200_08 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a2000
	bool BrainTalkEm_em8200_07(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8200_07 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1fd0
	bool BrainTalkEm_em8200_05(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8200_05 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1fa0
	bool BrainTalkEm_em8200_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8200_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1f70
	bool BrainTalkEm_em8200_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8200_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1f40
	bool BrainTalkEm_em8200_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8200_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1f10
	bool BrainTalkEm_em8200_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8200_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1ee0
	bool BrainTalkEm_em8000_06(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8000_06 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1eb0
	bool BrainTalkEm_em8000_05(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8000_05 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1e80
	bool BrainTalkEm_em8000_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8000_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1e50
	bool BrainTalkEm_em8000_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8000_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1e20
	bool BrainTalkEm_em8000_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8000_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1df0
	bool BrainTalkEm_em8000_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em8000_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1dc0
	bool BrainTalkEm_em1430_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1430_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1d90
	bool BrainTalkEm_em1430_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1430_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1d60
	bool BrainTalkEm_em1420_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1420_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1d30
	bool BrainTalkEm_em1420_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1420_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1d00
	bool BrainTalkEm_em1420_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1420_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1cd0
	bool BrainTalkEm_em1420_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1420_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1ca0
	bool BrainTalkEm_em1410_05(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1410_05 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1c70
	bool BrainTalkEm_em1410_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1410_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1c40
	bool BrainTalkEm_em1410_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1410_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1c10
	bool BrainTalkEm_em1410_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1410_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1be0
	bool BrainTalkEm_em1410_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1410_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1bb0
	bool BrainTalkEm_em1400_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1400_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1b80
	bool BrainTalkEm_em1300_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1300_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1b50
	bool BrainTalkEm_em1300_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1300_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1b20
	bool BrainTalkEm_em1300_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1300_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1af0
	bool BrainTalkEm_em1210_05(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1210_05 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1ac0
	bool BrainTalkEm_em1210_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1210_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1a90
	bool BrainTalkEm_em1210_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1210_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1a60
	bool BrainTalkEm_em1210_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1210_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1a30
	bool BrainTalkEm_em1210_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1210_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1a00
	bool BrainTalkEm_em1200_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1200_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a19d0
	bool BrainTalkEm_em1200_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1200_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a19a0
	bool BrainTalkEm_em1200_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1200_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1970
	bool BrainTalkEm_em1120_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1120_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1940
	bool BrainTalkEm_em1100_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1100_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1910
	bool BrainTalkEm_em1020_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1020_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a18e0
	bool BrainTalkEm_em1010_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em1010_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a18b0
	bool BrainTalkEm_em0830_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0830_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1880
	bool BrainTalkEm_em0820_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0820_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1850
	bool BrainTalkEm_em0800_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0800_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1820
	bool BrainTalkEm_em0700_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0700_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a17f0
	bool BrainTalkEm_em0620_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0620_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a17c0
	bool BrainTalkEm_em0500_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0500_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1790
	bool BrainTalkEm_em0330_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0330_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1760
	bool BrainTalkEm_em0330_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0330_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1730
	bool BrainTalkEm_em0330_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0330_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1700
	bool BrainTalkEm_em0320_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0320_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a16d0
	bool BrainTalkEm_em0320_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0320_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a16a0
	bool BrainTalkEm_em0310_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0310_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1670
	bool BrainTalkEm_em0310_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0310_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1640
	bool BrainTalkEm_em0310_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0310_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1610
	bool BrainTalkEm_em0310_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0310_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a15e0
	bool BrainTalkEm_em0300_04(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0300_04 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a15b0
	bool BrainTalkEm_em0300_03(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0300_03 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1580
	bool BrainTalkEm_em0300_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0300_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1550
	bool BrainTalkEm_em0300_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0300_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1520
	bool BrainTalkEm_em0210_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0210_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a14f0
	bool BrainTalkEm_em0120_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_em0120_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a14c0
	bool BrainTalkEm_ElectricCharge_WaterMember(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_ElectricCharge_WaterMember // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1310
	bool BrainTalkEm_ElectricCharge_ElectricAttack(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_ElectricCharge_ElectricAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x11a12e0
	bool BrainTalkEm_ConfusionCharge_ConfusionAttack(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_ConfusionCharge_ConfusionAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x11a12b0
	bool BrainTalkEm_ch0200_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_ch0200_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1490
	bool BrainTalkEm_ch0200_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_ch0200_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1460
	bool BrainTalkEm_ch0100_02(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_ch0100_02 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1430
	bool BrainTalkEm_ch0100_01(); // Function BattlePrototype.BrainTalkManager.BrainTalkEm_ch0100_01 // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1400
	bool BrainTalkBt_WaterEnAtkElectric(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_WaterEnAtkElectric // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1280
	bool BrainTalkBt_WaitingVoice(enum class EPlayerID WaitCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_WaitingVoice // (Final|Native|Public|BlueprintCallable) // @ game+0x11a11f0
	bool BrainTalkBt_UnopenedTreasure(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_UnopenedTreasure // (Final|Native|Public|BlueprintCallable) // @ game+0x11a11c0
	bool BrainTalkBt_TouchBFWall(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_TouchBFWall // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1190
	bool BrainTalkBt_StealthLosePL(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_StealthLosePL // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1160
	bool BrainTalkBt_SasNoUse(enum class EPlayerID TargetCharacter, enum class E_SASKindNative SasEffect, int32_t lastSasProgressTime, int32_t lastSasBTProgressTime); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_SasNoUse // (Final|Native|Public|BlueprintCallable) // @ game+0x11a1020
	bool BrainTalkBt_SasHoloPursuit(enum class EPlayerID HoloCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_SasHoloPursuit // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0f90
	bool BrainTalkBt_SasHoloPossible(enum class EPlayerID HoloCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_SasHoloPossible // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0f00
	bool BrainTalkBt_SasContinuity(enum class E_SASKindNative SasEffect, int32_t Num); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_SasContinuity // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0e40
	bool BrainTalkBt_SasCombo(int32_t comboNum); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_SasCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0db0
	bool BrainTalkBt_SallyTimes(enum class EPlayerID TargetCharacter, int32_t SallyMinutes, int32_t BeforeBTMinutes); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_SallyTimes // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0cb0
	bool BrainTalkBt_Revival(enum class EPlayerID RevivalFrom, enum class EPlayerID RevivalTo); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_Revival // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0be0
	bool BrainTalkBt_RecoveryItemZero(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_RecoveryItemZero // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0bb0
	bool BrainTalkBt_RecoveryHpToPL(enum class EPlayerID RecoveryFrom); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_RecoveryHpToPL // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0b20
	bool BrainTalkBt_RecoveryAbToPL(enum class EPlayerID RecoveryFrom); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_RecoveryAbToPL // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0a90
	bool BrainTalkBt_Recovery(enum class EPlayerID RecoveryTo); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_Recovery // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0a00
	bool BrainTalkBt_PTChangeAttachment(enum class EPlayerID ChangeAttachmentCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_PTChangeAttachment // (Final|Native|Public|BlueprintCallable) // @ game+0x11a08e0
	bool BrainTalkBt_PsychicCombo(int32_t comboNum); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_PsychicCombo // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0970
	bool BrainTalkBt_PLDead(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_PLDead // (Final|Native|Public|BlueprintCallable) // @ game+0x11a08b0
	bool BrainTalkBt_PLChangeAttachment(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_PLChangeAttachment // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0880
	bool BrainTalkBt_OilEnAtkFire(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_OilEnAtkFire // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0850
	bool BrainTalkBt_NoSallyTimes(enum class EPlayerID TargetCharacter, int32_t NoSallyMinutes, int32_t BeforeBTMinutes); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_NoSallyTimes // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0750
	bool BrainTalkBt_NearCC(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_NearCC // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0720
	bool BrainTalkBt_LvUp(enum class EPlayerID LvUpCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_LvUp // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0690
	bool BrainTalkBt_KizunaLvUp(enum class EPlayerID KizunaLvUpCharacter, bool isRetry); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KizunaLvUp // (Final|Native|Public|BlueprintCallable) // @ game+0x11a05c0
	bool BrainTalkBt_KillQuestTgtEn(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillQuestTgtEn // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0590
	bool BrainTalkBt_KillEnStrategy(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillEnStrategy // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0530
	bool BrainTalkBt_KillEnRest(enum class EPlayerID KillCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillEnRest // (Final|Native|Public|BlueprintCallable) // @ game+0x11a04a0
	bool BrainTalkBt_KillEnemyBC(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillEnemyBC // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0560
	bool BrainTalkBt_KillByEn(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillByEn // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0470
	bool BrainTalkBt_KillAllEnStrEn(enum class EPlayerID KillCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillAllEnStrEn // (Final|Native|Public|BlueprintCallable) // @ game+0x11a03e0
	bool BrainTalkBt_KillAllEnShortTime(enum class EPlayerID KillCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillAllEnShortTime // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0350
	bool BrainTalkBt_KillAllEnManyWeakEn(enum class EPlayerID KillCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillAllEnManyWeakEn // (Final|Native|Public|BlueprintCallable) // @ game+0x11a02c0
	bool BrainTalkBt_KillAllEnManyEn(enum class EPlayerID KillCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillAllEnManyEn // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0230
	bool BrainTalkBt_KillAllEnForPT(enum class EPlayerID KillCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillAllEnForPT // (Final|Native|Public|BlueprintCallable) // @ game+0x11a01a0
	bool BrainTalkBt_KillAllEnForPL(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_KillAllEnForPL // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0170
	bool BrainTalkBt_JumpOff(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_JumpOff // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0140
	bool BrainTalkBt_Hp30p(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_Hp30p // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0110
	bool BrainTalkBt_HiKizunaEffect(enum class EPlayerID hologramPlayerID); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_HiKizunaEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0080
	bool BrainTalkBt_GetQuestTgtItem(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_GetQuestTgtItem // (Final|Native|Public|BlueprintCallable) // @ game+0x11a0050
	bool BrainTalkBt_GetItem(enum class EItemRarity rarity); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_GetItem // (Final|Native|Public|BlueprintCallable) // @ game+0x119ffc0
	bool BrainTalkBt_GatherPoint(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_GatherPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x119ff90
	bool BrainTalkBt_FirstStrike(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_FirstStrike // (Final|Native|Public|BlueprintCallable) // @ game+0x119ff60
	bool BrainTalkBt_EquipStrongestWeapon(enum class EPlayerID EquiCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_EquipStrongestWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x119fed0
	bool BrainTalkBt_EnemyDrop(enum class EItemRarity rarity); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_EnemyDrop // (Final|Native|Public|BlueprintCallable) // @ game+0x119fe40
	bool BrainTalkBt_EnemyDown(enum class EPlayerID DownCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_EnemyDown // (Final|Native|Public|BlueprintCallable) // @ game+0x119fdb0
	bool BrainTalkBt_EnBerserkSign(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_EnBerserkSign // (Final|Native|Public|BlueprintCallable) // @ game+0x119fd80
	bool BrainTalkBt_EnBerserk(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_EnBerserk // (Final|Native|Public|BlueprintCallable) // @ game+0x119fd50
	bool BrainTalkBt_DriveGaugeMax(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DriveGaugeMax // (Final|Native|Public|BlueprintCallable) // @ game+0x119fd20
	bool BrainTalkBt_DriveActive(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DriveActive // (Final|Native|Public|BlueprintCallable) // @ game+0x119fcf0
	bool BrainTalkBt_DispCrashTrg(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DispCrashTrg // (Final|Native|Public|BlueprintCallable) // @ game+0x119fcc0
	bool BrainTalkBt_DiscStrEn(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DiscStrEn // (Final|Native|Public|BlueprintCallable) // @ game+0x119fc90
	bool BrainTalkBt_DiscStealth(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DiscStealth // (Final|Native|Public|BlueprintCallable) // @ game+0x119fc60
	bool BrainTalkBt_DiscSasValidEn(enum class E_SASKindNative SasEffect); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DiscSasValidEn // (Final|Native|Public|BlueprintCallable) // @ game+0x119fbd0
	bool BrainTalkBt_DiscQuestEnemy(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DiscQuestEnemy // (Final|Native|Public|BlueprintCallable) // @ game+0x119fba0
	bool BrainTalkBt_DiscEn(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DiscEn // (Final|Native|Public|BlueprintCallable) // @ game+0x119fb70
	bool BrainTalkBt_DestroyShell(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DestroyShell // (Final|Native|Public|BlueprintCallable) // @ game+0x119fb40
	bool BrainTalkBt_DeadInarow(int32_t DeadNum); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DeadInarow // (Final|Native|Public|BlueprintCallable) // @ game+0x119fab0
	bool BrainTalkBt_DamageTakeOver(enum class EPlayerID TakeOverCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_DamageTakeOver // (Final|Native|Public|BlueprintCallable) // @ game+0x119fa20
	bool BrainTalkBt_ClearQuest(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_ClearQuest // (Final|Native|Public|BlueprintCallable) // @ game+0x119f9f0
	bool BrainTalkBt_BrainCrashByEn(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_BrainCrashByEn // (Final|Native|Public|BlueprintCallable) // @ game+0x119f9c0
	bool BrainTalkBt_BirthKizunaEp(enum class EPlayerID EpCharacter); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_BirthKizunaEp // (Final|Native|Public|BlueprintCallable) // @ game+0x119f930
	bool BrainTalkBt_BFActivate(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_BFActivate // (Final|Native|Public|BlueprintCallable) // @ game+0x119f730
	bool BrainTalkBt_BattleEscape(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_BattleEscape // (Final|Native|Public|BlueprintCallable) // @ game+0x119f900
	bool BrainTalkBt_BadStateForEn(enum class EPlayerID BadStateMember, enum class HCSkillAttribute BadState); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_BadStateForEn // (Final|Native|Public|BlueprintCallable) // @ game+0x119f830
	bool BrainTalkBt_BadStateByEn(enum class EPlayerID BadStateMember, enum class HCSkillAttribute BadState); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_BadStateByEn // (Final|Native|Public|BlueprintCallable) // @ game+0x119f760
	bool BrainTalkBt_AttackEnWeak(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_AttackEnWeak // (Final|Native|Public|BlueprintCallable) // @ game+0x119f700
	bool BrainTalkBt_AttackEnShell(); // Function BattlePrototype.BrainTalkManager.BrainTalkBt_AttackEnShell // (Final|Native|Public|BlueprintCallable) // @ game+0x119f6d0
	void BPFL_PauseBrainTalkAtStartTalkEventBefore(); // Function BattlePrototype.BrainTalkManager.BPFL_PauseBrainTalkAtStartTalkEventBefore // (Final|Native|Public|BlueprintCallable) // @ game+0x119f6b0
	void BPFL_PauseBrainTalkAtEndTalkEventAfter(); // Function BattlePrototype.BrainTalkManager.BPFL_PauseBrainTalkAtEndTalkEventAfter // (Final|Native|Public|BlueprintCallable) // @ game+0x119f690
	void AddBrainTalkMasterDataQueList(struct FBrainTalkMasterData Data, struct FBrainTalk_CategoryDatatable categoryDatatable); // Function BattlePrototype.BrainTalkManager.AddBrainTalkMasterDataQueList // (Final|Native|Public|BlueprintCallable) // @ game+0x119f450
};

// Class BattlePrototype.BSPBlockBase
// Size: 0x238 (Inherited: 0x230)
struct ABSPBlockBase : ARSActorSystemBase {
	struct UBrushComponent* BrushComponent; // 0x230(0x08)
};

// Class BattlePrototype.BSPBlockVolume
// Size: 0x310 (Inherited: 0x2b8)
struct ABSPBlockVolume : AAudioVolume {
	struct FMulticastInlineDelegate OnBSPVolumeBeginOverlap; // 0x2b8(0x10)
	struct FMulticastInlineDelegate OnBSPVolumeEndOverlap; // 0x2c8(0x10)
	struct FMulticastInlineDelegate OnBSPVolumeHit; // 0x2d8(0x10)
	struct TArray<struct ABSPPortalBase*> Portals; // 0x2e8(0x10)
	float CurSoundAttenuationRate; // 0x2f8(0x04)
	float TargetSoundAttenuationRate; // 0x2fc(0x04)
	float SoundSettingInterporateSpeed; // 0x300(0x04)
	float TotalDistanceFromPlayer; // 0x304(0x04)
	int32_t UpdateID; // 0x308(0x04)
	char pad_30C[0x4]; // 0x30c(0x04)

	void UpdateSoundAttenuation(float DeltaSeconds); // Function BattlePrototype.BSPBlockVolume.UpdateSoundAttenuation // (Final|Native|Public|BlueprintCallable) // @ game+0x11a9480
	void SetDistanceFromPlayer(float Distance); // Function BattlePrototype.BSPBlockVolume.SetDistanceFromPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x11a90f0
	void ResetAttenuation(); // Function BattlePrototype.BSPBlockVolume.ResetAttenuation // (Final|Native|Public|BlueprintCallable) // @ game+0x11a90d0
	void PrepareUpdateSoundAttenuation(); // Function BattlePrototype.BSPBlockVolume.PrepareUpdateSoundAttenuation // (Final|Native|Public|BlueprintCallable) // @ game+0x11a90b0
	void OnActorHitFunc(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult Hit); // Function BattlePrototype.BSPBlockVolume.OnActorHitFunc // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x11a8bd0
	void OnActorEndOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.BSPBlockVolume.OnActorEndOverlapFunc // (Final|Native|Public) // @ game+0x11a8b10
	void OnActorBeginOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.BSPBlockVolume.OnActorBeginOverlapFunc // (Final|Native|Public) // @ game+0x11a8b10
	bool IsInVolume(struct FVector Point, float SphereRadius); // Function BattlePrototype.BSPBlockVolume.IsInVolume // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a88f0
};

// Class BattlePrototype.BSPManager
// Size: 0x268 (Inherited: 0x230)
struct ABSPManager : ARSActorSystemBase {
	char pad_230[0x8]; // 0x230(0x08)
	struct FMulticastInlineDelegate OnBlockBeginOverlap; // 0x238(0x10)
	struct FMulticastInlineDelegate OnBlockEndOverlap; // 0x248(0x10)
	struct FMulticastInlineDelegate OnBlockHit; // 0x258(0x10)

	void UpdateBSPAttenuation_Native(float DeltaSeconds, bool isPlayerInBlock, struct TArray<struct ABSPBlockVolume*> areaBlocks, struct TArray<struct ABSPBlockVolume*> BlockWithPlayer, int32_t BlockUpdateID, float MaxSoundDistance); // Function BattlePrototype.BSPManager.UpdateBSPAttenuation_Native // (Final|Native|Public|BlueprintCallable) // @ game+0x11a9210
	void UpdateAllAtomBSPAttenuation_Native(); // Function BattlePrototype.BSPManager.UpdateAllAtomBSPAttenuation_Native // (Final|Native|Public|BlueprintCallable) // @ game+0x11a91f0
	void OnBlockHitFunc(struct AActor* SelfActor, struct AActor* OtherActor, struct FVector NormalImpulse, struct FHitResult Hit); // Function BattlePrototype.BSPManager.OnBlockHitFunc // (Native|Public|HasOutParms|HasDefaults) // @ game+0x11a8f10
	void OnBlockEndOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.BSPManager.OnBlockEndOverlapFunc // (Native|Public) // @ game+0x11a8e40
	void OnBlockBeginOverlapFunc(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function BattlePrototype.BSPManager.OnBlockBeginOverlapFunc // (Native|Public) // @ game+0x11a8d70
	struct ABSPBlockVolume* IsPosInAnyBlock_Native(struct TArray<struct ABSPBlockVolume*> areaBlocks, struct FVector Pos); // Function BattlePrototype.BSPManager.IsPosInAnyBlock_Native // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x11a89d0
	void GetSoundAttenuationRate_Native(struct TArray<struct ABSPBlockVolume*> areaBlocks, struct FVector Pos, bool isPlayerInBlock, float AttenuationRate, struct ABSPBlockVolume* bLock); // Function BattlePrototype.BSPManager.GetSoundAttenuationRate_Native // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11a86b0
	void GetSoundAttenuationRate_Call(struct FVector Pos, float AttenuationRate); // Function BattlePrototype.BSPManager.GetSoundAttenuationRate_Call // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x1685580
	void CalcBSPAttenuationFirstFromPlayer_Native(struct ABSPBlockVolume* pFromBSPVolume, struct TArray<struct ABSPPortalBase*> Portals, struct FVector BasePos, int32_t BlockUpdateID, float MaxSoundDistance); // Function BattlePrototype.BSPManager.CalcBSPAttenuationFirstFromPlayer_Native // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x11a83f0
};

// Class BattlePrototype.BSPPortalBase
// Size: 0x258 (Inherited: 0x230)
struct ABSPPortalBase : ARSActorSystemBase {
	struct TArray<struct ABSPBlockVolume*> NearVolumes; // 0x230(0x10)
	float AttenuationBaseRate; // 0x240(0x04)
	float DistanceAttenuationRate; // 0x244(0x04)
	float TotalDistanceFromPlayer; // 0x248(0x04)
	float OpenRate; // 0x24c(0x04)
	int32_t UpdateID; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)

	void SetDistanceFromPlayer(float Distance); // Function BattlePrototype.BSPPortalBase.SetDistanceFromPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x11a9170
	float GetTotalAttenuationRate(); // Function BattlePrototype.BSPPortalBase.GetTotalAttenuationRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a88c0
	void CheckAndSetUpdateID(int32_t ID, bool IsFirstTime); // Function BattlePrototype.BSPPortalBase.CheckAndSetUpdateID // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11a85e0
	void AddNearVolume(struct ABSPBlockVolume* BlockVolume); // Function BattlePrototype.BSPPortalBase.AddNearVolume // (Final|Native|Public|BlueprintCallable) // @ game+0x11a8370
};

// Class BattlePrototype.BTDecoratorEnemyBase
// Size: 0xa8 (Inherited: 0x68)
struct UBTDecoratorEnemyBase : UBTDecorator {
	struct AAIController* _AIOwner; // 0x68(0x08)
	struct AActor* _ActorOwner; // 0x70(0x08)
	struct UEnemyScriptComponent* _EnemyScript; // 0x78(0x08)
	struct TArray<struct FName> ObservedKeyNames; // 0x80(0x10)
	char pad_90[0x10]; // 0x90(0x10)
	char bCheckConditionOnlyBlackBoardChanges : 1; // 0xa0(0x01)
	char bIsObservingBB : 1; // 0xa0(0x01)
	char pad_A0_2 : 6; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class BattlePrototype.BTD_DistanceAngleCheck_Native
// Size: 0xd8 (Inherited: 0xa8)
struct UBTD_DistanceAngleCheck_Native : UBTDecoratorEnemyBase {
	struct FBlackboardKeySelector Target; // 0xa8(0x28)
	float Distance; // 0xd0(0x04)
	float Angle; // 0xd4(0x04)
};

// Class BattlePrototype.BTD_Enemy_EnableActionTimer_Native
// Size: 0xd0 (Inherited: 0xa8)
struct UBTD_Enemy_EnableActionTimer_Native : UBTDecoratorEnemyBase {
	struct FBlackboardKeySelector ActionTimerKey; // 0xa8(0x28)
};

// Class BattlePrototype.BTD_Enemy_EnableLostAction_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_EnableLostAction_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_FormType_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_Enemy_FormType_Native : UBTDecoratorEnemyBase {
	enum class EEnemyFormType FormType; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_Enemy_IsAlive_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_Enemy_IsAlive_Native : UBTDecoratorEnemyBase {
	enum class EnemyAliveAnimKind EnemyAliveAnimKind; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_Enemy_IsBadStatus_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_Enemy_IsBadStatus_Native : UBTDecoratorEnemyBase {
	enum class EHCBadState BadStatus; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_Enemy_IsBattle_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsBattle_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_IsCanFlyModeChange_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsCanFlyModeChange_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_IsDead_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsDead_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_IsEnableWander_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsEnableWander_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_IsForceBreak_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsForceBreak_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_IsNotWallHit_Native
// Size: 0xb8 (Inherited: 0xa8)
struct UBTD_Enemy_IsNotWallHit_Native : UBTDecoratorEnemyBase {
	float _tmpDistance; // 0xa8(0x04)
	struct FGameTimer _tmpGameTimer; // 0xac(0x0c)
};

// Class BattlePrototype.BTD_Enemy_IsRandom_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_Enemy_IsRandom_Native : UBTDecoratorEnemyBase {
	int32_t Num; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class BattlePrototype.BTD_Enemy_IsSpawnNow_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsSpawnNow_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_IsSpawnState_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_Enemy_IsSpawnState_Native : UBTDecoratorEnemyBase {
	enum class Enum_EnemySpawnStateNative State; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_Enemy_IsTickEnable_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsTickEnable_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_Enemy_IsWander_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_Enemy_IsWander_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_IsEnemyBattleStart_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_IsEnemyBattleStart_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_IsEnemyDamageAnimKind_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_IsEnemyDamageAnimKind_Native : UBTDecoratorEnemyBase {
	enum class EnemyDamageAnimKind damageKind; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_IsEnemyDamageDownAnimKind_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_IsEnemyDamageDownAnimKind_Native : UBTDecoratorEnemyBase {
	enum class EnemyDamageDownAnimKind DamageDownKind; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_IsEnemyDamageStopAnimKind_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_IsEnemyDamageStopAnimKind_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_IsEnemyKind_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_IsEnemyKind_Native : UBTDecoratorEnemyBase {
	enum class EnemyKind _EnemyKind; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_IsEnemyStopAnimKind_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_IsEnemyStopAnimKind_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_IsEnemyTargetNearRange_Native
// Size: 0xd8 (Inherited: 0xa8)
struct UBTD_IsEnemyTargetNearRange_Native : UBTDecoratorEnemyBase {
	char pad_A8[0x28]; // 0xa8(0x28)
	float NearRange; // 0xd0(0x04)
	bool IsInRange; // 0xd4(0x01)
	char pad_D5[0x3]; // 0xd5(0x03)
};

// Class BattlePrototype.BTD_IsEnemyWait_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_IsEnemyWait_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_IsFlyEnemy_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_IsFlyEnemy_Native : UBTDecoratorEnemyBase {
	bool bIsFlying; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_IsFlyType_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_IsFlyType_Native : UBTDecoratorEnemyBase {
	bool bIsFlying; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTD_IsInitLayout_Native
// Size: 0xa8 (Inherited: 0xa8)
struct UBTD_IsInitLayout_Native : UBTDecoratorEnemyBase {
};

// Class BattlePrototype.BTD_IsMoveAnim_Native
// Size: 0xb0 (Inherited: 0xa8)
struct UBTD_IsMoveAnim_Native : UBTDecoratorEnemyBase {
	enum class EnemyMoveAnimKind _MoveAnimKind; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class BattlePrototype.BTDecorator_RSPlayerBase
// Size: 0xa0 (Inherited: 0x68)
struct UBTDecorator_RSPlayerBase : UBTDecorator {
	struct AAIController* _AIOwner; // 0x68(0x08)
	struct UPlayerScriptComponent* _PlayerScript; // 0x70(0x08)
	struct TArray<struct FName> ObservedKeyNames; // 0x78(0x10)
	char pad_88[0x10]; // 0x88(0x10)
	char bCheckConditionOnlyBlackBoardChanges : 1; // 0x98(0x01)
	char bIsObservingBB : 1; // 0x98(0x01)
	char pad_98_2 : 6; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class BattlePrototype.BTDecorator_RSPlayerCheckDistanceToPlayer
// Size: 0xa8 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerCheckDistanceToPlayer : UBTDecorator_RSPlayerBase {
	float Distance; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class BattlePrototype.BTDecorator_RSPlayerIsAssist
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsAssist : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsAttackAble
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsAttackAble : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsBattleMode
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsBattleMode : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsBattleThink
// Size: 0xa8 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsBattleThink : UBTDecorator_RSPlayerBase {
	enum class EPlayerAIBattleThinkTypeCPP ThinkTypeCPP; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class BattlePrototype.BTDecorator_RSPlayerIsBattleThinkParam
// Size: 0xa8 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsBattleThinkParam : UBTDecorator_RSPlayerBase {
	enum class EPlayerAIBattleThinkParamCPP ThinkParamCPP; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class BattlePrototype.BTDecorator_RSPlayerIsBrainField
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsBrainField : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsDamage
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsDamage : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsDead
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsDead : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsDodgeAble
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsDodgeAble : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsDown
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsDown : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsEvent
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsEvent : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsEventMove
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsEventMove : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsEventWait
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsEventWait : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsJump
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsJump : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsMoveAble
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsMoveAble : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsNoThink
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsNoThink : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsPlayerRevive
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsPlayerRevive : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsPsychicAble
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsPsychicAble : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsResetBehaviorTree
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsResetBehaviorTree : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsReviveNpc
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsReviveNpc : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTDecorator_RSPlayerIsUseCppFunc
// Size: 0xa8 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsUseCppFunc : UBTDecorator_RSPlayerBase {
	bool bEnable; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
};

// Class BattlePrototype.BTDecorator_RSPlayerIsUseItem
// Size: 0xa0 (Inherited: 0xa0)
struct UBTDecorator_RSPlayerIsUseItem : UBTDecorator_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSNativeBase
// Size: 0xa0 (Inherited: 0x70)
struct UBTTask_RSNativeBase : UBTTaskNode {
	struct AAIController* _AIOwner; // 0x70(0x08)
	struct FIntervalCountdown TickInterval; // 0x78(0x08)
	char pad_80[0x18]; // 0x80(0x18)
	char ReceiveTickImplementations : 1; // 0x98(0x01)
	char pad_98_1 : 7; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class BattlePrototype.BTTask_RSPlayerBase
// Size: 0xa8 (Inherited: 0xa0)
struct UBTTask_RSPlayerBase : UBTTask_RSNativeBase {
	struct UPlayerScriptComponent* _PlayerScript; // 0xa0(0x08)
};

// Class BattlePrototype.BTTask_RSPlayerBattleStart
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerBattleStart : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerBrainField
// Size: 0xb8 (Inherited: 0xa8)
struct UBTTask_RSPlayerBrainField : UBTTask_RSPlayerBase {
	struct FGameTimer Timer; // 0xa8(0x0c)
	char pad_B4[0x4]; // 0xb4(0x04)
};

// Class BattlePrototype.BTTask_RSPlayerDamage
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerDamage : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerDead
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerDead : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerDown
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerDown : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerEvent
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerEvent : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerEventWait
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerEventWait : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerJump
// Size: 0xb8 (Inherited: 0xa8)
struct UBTTask_RSPlayerJump : UBTTask_RSPlayerBase {
	bool bPress; // 0xa8(0x01)
	char pad_A9[0x3]; // 0xa9(0x03)
	struct FGameTimer Timer; // 0xac(0x0c)
};

// Class BattlePrototype.BTTask_RSPlayerMoveToBase
// Size: 0xe0 (Inherited: 0xa8)
struct UBTTask_RSPlayerMoveToBase : UBTTask_RSPlayerBase {
	float AcceptionRadius; // 0xa8(0x04)
	bool bJumpCheck; // 0xac(0x01)
	bool bWallBackCheck; // 0xad(0x01)
	bool bExit; // 0xae(0x01)
	bool bInputMoveMode; // 0xaf(0x01)
	struct FGameTimer Timer; // 0xb0(0x0c)
	int32_t Step; // 0xbc(0x04)
	struct FGameTimer CheckWallTimer; // 0xc0(0x0c)
	float CheckJumpInterval; // 0xcc(0x04)
	struct FGameTimer BackInputTimer; // 0xd0(0x0c)
	enum class EPlayerAIMoveWallCPP WallTypeCPP; // 0xdc(0x01)
	char pad_DD[0x3]; // 0xdd(0x03)
};

// Class BattlePrototype.BTTask_RSPlayerMoveRoute
// Size: 0xe0 (Inherited: 0xe0)
struct UBTTask_RSPlayerMoveRoute : UBTTask_RSPlayerMoveToBase {
};

// Class BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase
// Size: 0x170 (Inherited: 0xa8)
struct UBTTask_RSPlayerMoveTo_BlueprintBase : UBTTask_BlueprintBase {
	struct ARSCharacterBase* OwnerCharacter; // 0xa8(0x08)
	struct UPlayerScriptComponent* OwnerPlayerScript; // 0xb0(0x08)
	struct UPlayerAIBaseComponent* OwnerPlayerAIComponent; // 0xb8(0x08)
	float AcceptionRadius; // 0xc0(0x04)
	float AcceptionHeight; // 0xc4(0x04)
	bool bExit; // 0xc8(0x01)
	bool bInputMoveMode; // 0xc9(0x01)
	char pad_CA[0x2]; // 0xca(0x02)
	struct FGameTimer ResetAIMoveToTimer; // 0xcc(0x0c)
	int32_t Step; // 0xd8(0x04)
	bool bJumpCheck; // 0xdc(0x01)
	bool bNeedsJumpCheckCurrent; // 0xdd(0x01)
	char pad_DE[0x2]; // 0xde(0x02)
	float JumpCheckMoveSpeedRatioThreshold; // 0xe0(0x04)
	struct FGameTimer CheckWallTimer; // 0xe4(0x0c)
	float CheckJumpInterval; // 0xf0(0x04)
	struct FGameTimer BackInputTimer; // 0xf4(0x0c)
	struct FGameTimer DetourInputTimer; // 0x100(0x0c)
	float DetourInputDuration; // 0x10c(0x04)
	float DetourInputBeginYawAngle; // 0x110(0x04)
	float DetourInputDurationShort; // 0x114(0x04)
	float DetourInputBeginYawAngleShort; // 0x118(0x04)
	float DetourInputDurationRateWalk; // 0x11c(0x04)
	float DetourInputDurationRateRun; // 0x120(0x04)
	float DetourInputDurationRateSprint; // 0x124(0x04)
	float DetourInputRotateDirection; // 0x128(0x04)
	float DetourInputBeginYawAngleCurrent; // 0x12c(0x04)
	enum class EPlayerAIMoveWallCPP WallTypeCPP; // 0x130(0x01)
	bool bWallBackCheck; // 0x131(0x01)
	char pad_132[0x2]; // 0x132(0x02)
	float ForceWallBackNotMovedTime; // 0x134(0x04)
	bool bWallDetourCheck; // 0x138(0x01)
	bool bAIMoving; // 0x139(0x01)
	bool bEnemyCheck; // 0x13a(0x01)
	bool bWarpCheck; // 0x13b(0x01)
	struct FVector2D MovedDistanceCurrent; // 0x13c(0x08)
	struct FVector2D MovedDistancePrevLocation; // 0x144(0x08)
	float MovedDistanceCheckTimer; // 0x14c(0x04)
	float MovedDistanceCheckInterval; // 0x150(0x04)
	float MovedDistanceThreshold; // 0x154(0x04)
	float NotMovedElapsedTime; // 0x158(0x04)
	float ForceWarpThresholdTime; // 0x15c(0x04)
	bool bForceWarpRequest; // 0x160(0x01)
	bool bChangeWalkOrRun; // 0x161(0x01)
	char pad_162[0x2]; // 0x162(0x02)
	float WalkingDistanceMax; // 0x164(0x04)
	float RunningDistanceMin; // 0x168(0x04)
	bool bWalking; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)

	void TickMoveCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.TickMoveCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11ad9a0
	void StopAIMoveToCPP(bool bRechargeResetAIMoveTimer); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.StopAIMoveToCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11ad7e0
	void SetAIMoveTo_CallFromCPP(struct AAIController* OwnerController, struct APawn* ControlledPawn); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.SetAIMoveTo_CallFromCPP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	struct UPlayerScriptComponent* GetOwnerPlayerScript(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.GetOwnerPlayerScript // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ad2c0
	struct UPlayerAIBaseComponent* GetOwnerPlayerAI(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.GetOwnerPlayerAI // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ad290
	struct ARSCharacterBase* GetOwnerCharacter(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.GetOwnerCharacter // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ad260
	void ForceWarpCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.ForceWarpCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11ad0d0
	void ExitCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.ExitCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11ad0b0
	void Exit_CallFromCPP(struct AAIController* OwnerController, struct APawn* ControlledPawn); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.Exit_CallFromCPP // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CheckWallCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckWallCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11ad060
	bool CheckStickMoveEndCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckStickMoveEndCPP // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ad030
	bool CheckPlayerIsRun(struct ARSCharacterBase* Character); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckPlayerIsRun // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11acfa0
	bool CheckMoveDistance_IsEndCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckMoveDistance_IsEndCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11aced0
	void CheckMovedDistance_TickCPP(float DeltaSeconds); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckMovedDistance_TickCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11acf20
	void CheckMovedDistance_InitializeCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckMovedDistance_InitializeCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11acf00
	bool CheckDistanceXY_Z_CPP(struct FVector Location1, struct FVector Location2, float DistanceXY, float DistanceZ); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckDistanceXY_Z_CPP // (Final|Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x11acd40
	bool CheckDistanceXY_CPP(struct FVector Location1, struct FVector Location2, float DistanceXY); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckDistanceXY_CPP // (Final|Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x11acc10
	bool CheckAvoidWallOrWarpCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckAvoidWallOrWarpCPP // (Final|Native|Protected|BlueprintCallable) // @ game+0x11acbe0
	bool CheckArrivedGoalCPP(); // Function BattlePrototype.BTTask_RSPlayerMoveTo_BlueprintBase.CheckArrivedGoalCPP // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11acbb0
};

// Class BattlePrototype.BTTask_RSPlayerMoveToHero
// Size: 0xe0 (Inherited: 0xe0)
struct UBTTask_RSPlayerMoveToHero : UBTTask_RSPlayerMoveToBase {
};

// Class BattlePrototype.BTTask_RSPlayerMoveToRevive
// Size: 0xe0 (Inherited: 0xe0)
struct UBTTask_RSPlayerMoveToRevive : UBTTask_RSPlayerMoveToBase {
};

// Class BattlePrototype.BTTask_RSPlayerNextBattleThink
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerNextBattleThink : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerPlayerRevive
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerPlayerRevive : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerResetBehaviorTree
// Size: 0xa8 (Inherited: 0xa8)
struct UBTTask_RSPlayerResetBehaviorTree : UBTTask_RSPlayerBase {
};

// Class BattlePrototype.BTTask_RSPlayerUseItem
// Size: 0xb0 (Inherited: 0xa8)
struct UBTTask_RSPlayerUseItem : UBTTask_RSPlayerBase {
	int32_t Step; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class BattlePrototype.CalcMemoryManager
// Size: 0xa8 (Inherited: 0x28)
struct UCalcMemoryManager : UObject {
