// BlueprintGeneratedClass BP_BrainFieldManager.BP_BrainFieldManager_C
// Size: 0x1325 (Inherited: 0xba0)
struct ABP_BrainFieldManager_C : ABrainFieldManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xba0(0x08)
	struct UStaticMeshComponent* SM_BG; // 0xba8(0x08)
	struct URSSceneCaptureComponent2D* RSSceneCaptureComponent2D; // 0xbb0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0xbb8(0x08)
	struct TArray<struct FTransform> RestorePlayerTransform; // 0xbc0(0x10)
	struct TArray<struct FName> BrainFieldLevelName; // 0xbd0(0x10)
	bool UserIsPlayer; // 0xbe0(0x01)
	char pad_BE1[0x7]; // 0xbe1(0x07)
	struct TArray<struct ULevelStreaming*> BrainFieldLevelLists; // 0xbe8(0x10)
	struct TArray<struct AActor*> PlayerLists; // 0xbf8(0x10)
	struct TArray<struct AActor*> EnemyLists; // 0xc08(0x10)
	struct TArray<struct FTransform> RestoreEnemyTransform; // 0xc18(0x10)
	struct TArray<struct FName> BrainFieldPlayerLevelName; // 0xc28(0x10)
	struct FVector LevelLocation; // 0xc38(0x0c)
	char pad_C44[0x4]; // 0xc44(0x04)
	struct AActor* BrainFieldUser; // 0xc48(0x08)
	bool InvokeBrainField; // 0xc50(0x01)
	char pad_C51[0x7]; // 0xc51(0x07)
	struct TArray<struct AActor*> NormalLevelActorLists; // 0xc58(0x10)
	struct TArray<struct UBP_RSParticleBackgroundComponent_C*> NormalLevelParticleLists; // 0xc68(0x10)
	struct TArray<struct FBrainFieldRestoreFlag> NormalLevelActorFlagLists; // 0xc78(0x10)
	int32_t SwitchVisibleActorSplitIndex; // 0xc88(0x04)
	bool UseVisibilityActorSplitFrame; // 0xc8c(0x01)
	char pad_C8D[0x3]; // 0xc8d(0x03)
	int32_t VisibilityActorSplitFrame; // 0xc90(0x04)
	char pad_C94[0x4]; // 0xc94(0x04)
	struct ABP_BrainFieldSequenceActor_C* SequenceActor; // 0xc98(0x08)
	bool InBrainField; // 0xca0(0x01)
	char pad_CA1[0x7]; // 0xca1(0x07)
	struct TArray<struct AActor*> EnemyFarLists; // 0xca8(0x10)
	struct TArray<struct APsychicGrabAttachment_C*> GrabAttachmentList; // 0xcb8(0x10)
	struct TArray<struct FTransform> RestorePsychicAttachmentTransform; // 0xcc8(0x10)
	struct FMulticastInlineDelegate ED_BrainFieldBattleStart; // 0xcd8(0x10)
	struct FMulticastInlineDelegate ED_BrainFieldBattleEnd; // 0xce8(0x10)
	struct FMulticastInlineDelegate ED_BrainFieldSwitchBG; // 0xcf8(0x10)
	struct UPostProcessComponent* PostProcess; // 0xd08(0x08)
	struct UMaterialInstanceDynamic* ReleaseBFMaterial; // 0xd10(0x08)
	bool DebugForceEnd; // 0xd18(0x01)
	char pad_D19[0x3]; // 0xd19(0x03)
	int32_t LoadLevelCounter; // 0xd1c(0x04)
	struct TArray<struct ULevelStreaming*> BrainFieldLevelPlayerList; // 0xd20(0x10)
	struct TArray<struct ULevelStreaming*> BrainFieldLevelEnemyList; // 0xd30(0x10)
	struct TArray<struct AActor*> BrainFieldActorLists; // 0xd40(0x10)
	struct AActor* SystemRoot; // 0xd50(0x08)
	int32_t SequencerIndex; // 0xd58(0x04)
	char pad_D5C[0x4]; // 0xd5c(0x04)
	struct TArray<struct AActor*> BrainFieldActorPlayerList; // 0xd60(0x10)
	struct TArray<struct AActor*> BrainFieldActorEnemyList; // 0xd70(0x10)
	struct TArray<struct FBrainFieldRestoreFlag> BrainFieldActorFlagLists; // 0xd80(0x10)
	struct TArray<struct FBrainFieldRestoreFlag> BrainFieldActorUserFlagLists; // 0xd90(0x10)
	struct TArray<struct UParticleSystemComponent*> BrainFieldParticleComponentLists; // 0xda0(0x10)
	struct TArray<struct ADirectionalLight*> BrainFieldLightLists; // 0xdb0(0x10)
	struct TArray<struct FTransform> BrainFieldPlayerTransform; // 0xdc0(0x10)
	bool CallCloseEventEnd; // 0xdd0(0x01)
	char pad_DD1[0xf]; // 0xdd1(0x0f)
	struct FTransform BFUserLastTransform; // 0xde0(0x30)
	bool SpawnPsychicObject; // 0xe10(0x01)
	char pad_E11[0x7]; // 0xe11(0x07)
	struct AActor* MonitorActor; // 0xe18(0x08)
	struct FMulticastInlineDelegate ED_ChangeMonitorState; // 0xe20(0x10)
	bool LevelLoadEnd; // 0xe30(0x01)
	char pad_E31[0x7]; // 0xe31(0x07)
	struct AActor* BrainFieldUserSub; // 0xe38(0x08)
	enum class EBrainFieldEndType EndType; // 0xe40(0x01)
	char pad_E41[0x7]; // 0xe41(0x07)
	struct TSoftObjectPtr<UMaterialInstance> ReleaseBFMaterialAsset; // 0xe48(0x28)
	struct TSoftClassPtr<UObject> MonitorActorClassAsset; // 0xe70(0x28)
	struct TSoftObjectPtr<UStaticMesh> BGStaticMeshAsset; // 0xe98(0x28)
	bool OverrideBF; // 0xec0(0x01)
	bool IsPerformance; // 0xec1(0x01)
	char pad_EC2[0x6]; // 0xec2(0x06)
	struct TArray<struct FName> BrainFieldEnemyLevelName; // 0xec8(0x10)
	bool IsEventStart; // 0xed8(0x01)
	char pad_ED9[0x7]; // 0xed9(0x07)
	struct TArray<struct FFlagListStruct> EnemyComponentRestoreFlags; // 0xee0(0x10)
	struct FFlagListStruct EnemyRestoreFlags; // 0xef0(0x10)
	struct ACameraActor* WatchCamera; // 0xf00(0x08)
	struct FVector WatchBaseLocation; // 0xf08(0x0c)
	struct FVector WatchLocation; // 0xf14(0x0c)
	bool FreeCameraWatchMode; // 0xf20(0x01)
	char pad_F21[0x7]; // 0xf21(0x07)
	struct UCurveFloat* FieldTimeColorCurve; // 0xf28(0x08)
	struct AActor* BrainCrashAttacker; // 0xf30(0x08)
	bool PlayerCameraWatchMode; // 0xf38(0x01)
	char pad_F39[0x3]; // 0xf39(0x03)
	struct FVector PlayerCameraWatchTargetOffset; // 0xf3c(0x0c)
	float PlayerCameraWatchPitch; // 0xf48(0x04)
	struct FRotator PlayerCameraWatchBaseRotation; // 0xf4c(0x0c)
	float PlayerCameraWatchEaseTime; // 0xf58(0x04)
	float PlayerCameraWatchEaseTimeMax; // 0xf5c(0x04)
	bool IsPlayerHidden; // 0xf60(0x01)
	bool DebugForceBrainCrashENPCOverwrite; // 0xf61(0x01)
	bool DebugForceFieldColor; // 0xf62(0x01)
	char pad_F63[0x1]; // 0xf63(0x01)
	float DebugForceFieldColorSide; // 0xf64(0x04)
	float DebugForceFieldColorGrayScale; // 0xf68(0x04)
	char pad_F6C[0x4]; // 0xf6c(0x04)
	struct AActor* BrainCrashAttackerSub; // 0xf70(0x08)
	char pad_F78[0x8]; // 0xf78(0x08)
	struct FTransform ENPCStartTransform; // 0xf80(0x30)
	struct TArray<struct AActor*> BrainFieldUserList; // 0xfb0(0x10)
	struct TArray<struct AActor*> OverrideLastBrainFieldUserList; // 0xfc0(0x10)
	struct TArray<struct UBP_RSParticleBackgroundComponent_C*> BrainFieldBGEffect; // 0xfd0(0x10)
	struct FBrainFieldRestoreFlag NormalLevelParticleFlag; // 0xfe0(0x28)
	bool IsEnemyHidden; // 0x1008(0x01)
	char pad_1009[0x7]; // 0x1009(0x07)
	struct TSoftObjectPtr<UMaterialInstance> TimeBFMaterialAsset; // 0x1010(0x28)
	struct UMaterialInstanceDynamic* TimeBFMaterial; // 0x1038(0x08)
	struct TArray<struct UPrimitiveComponent*> HiddenBGPrimitives; // 0x1040(0x10)
	struct FName BrainFieldNaviLevelName; // 0x1050(0x08)
	struct FName BrainFieldCollisionCommonLevelName; // 0x1058(0x08)
	struct FName CollisionLevelPath; // 0x1060(0x08)
	struct FName NavimeshLevelPath; // 0x1068(0x08)
	bool UseCustomCollision; // 0x1070(0x01)
	char pad_1071[0xf]; // 0x1071(0x0f)
	struct FBrainFieldSettingsLocation CustomCollisionSettings; // 0x1080(0x220)
	struct TArray<struct FTransform> EventEnemyTransforms; // 0x12a0(0x10)
	struct TArray<struct FTransform> ENPCSequencerTransform; // 0x12b0(0x10)
	bool DebugDispEnemyWave; // 0x12c0(0x01)
	char pad_12C1[0x7]; // 0x12c1(0x07)
	struct ABP_BrainFieldCollisions_C* PackageRefCollision; // 0x12c8(0x08)
	struct FName BrainFieldNavimeshCommonLevelName; // 0x12d0(0x08)
	bool RequestCollisionLevelVisible; // 0x12d8(0x01)
	bool FiniashCollisionLevelVisible; // 0x12d9(0x01)
	bool RequestNavimeshVisible; // 0x12da(0x01)
	char pad_12DB[0x5]; // 0x12db(0x05)
	struct TArray<int32_t> ENPCCustomStencils; // 0x12e0(0x10)
	bool DelayedBattleFieldOut; // 0x12f0(0x01)
	char pad_12F1[0x3]; // 0x12f1(0x03)
	int32_t DelayedBattleFieldOutGroupId; // 0x12f4(0x04)
	struct TArray<bool> RestorePlayerTransformValid; // 0x12f8(0x10)
	struct TArray<bool> PlayerHIdden; // 0x1308(0x10)
	struct FName InvalidDamageNameENPCClose; // 0x1318(0x08)
	bool SetInvalidDamageENPCClose; // 0x1320(0x01)
	enum class EPlayerID ENPCLoadPlayerID; // 0x1321(0x01)
	bool InSetupMenu; // 0x1322(0x01)
	bool DelayedBattleFieldOutIsBoss; // 0x1323(0x01)
	bool RestoreENPCPlayerLockOn; // 0x1324(0x01)

	void PrivateAdjustPlayerOpenSequenceLocation(); // Function BP_BrainFieldManager.BP_BrainFieldManager_C.PrivateAdjustPlayerOpenSequenceLocation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EventENPCWhiteoutEnd(); // Function BP_BrainFieldManager.BP_BrainFieldManager_C.EventENPCWhiteoutEnd // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetupMenu(bool InMenu); // Function BP_BrainFieldManager.BP_BrainFieldManager_C.SetupMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetCustomCollisionSettings(struct FBrainFieldSettingsLocation Settings, bool UseCustomCollision); // Function BP_BrainFieldManager.BP_BrainFieldManager_C.GetCustomCollisionSettings // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
