// BlueprintGeneratedClass BP_ch0100.BP_ch0100_C
// Size: 0x22e0 (Inherited: 0x1def)
struct ABP_ch0100_C : ARsBattleHero_C {
	char pad_1DEF[0x1]; // 0x1def(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1df0(0x08)
	struct UBP_ch0100_Attack_rush_circle_Fire_aerial_C* BP_ch0100_Attack_rush_circle_Fire_aerial1; // 0x1df8(0x08)
	struct UBP_ch0100_Attack_rush_circle_Electric_aerial_C* BP_ch0100_Attack_rush_circle_Electric_aerial1; // 0x1e00(0x08)
	struct UBP_ch0100_Attack_rush_circle_Electric_C* BP_ch0100_Attack_rush_circle_Electric1; // 0x1e08(0x08)
	struct UBP_ch0100_Attack_rush_circle_aerial_C* BP_ch0100_Attack_rush_circle_aerial1; // 0x1e10(0x08)
	struct UBP_ch0100_Attack_rush_circle_Fire_aerial_C* BP_ch0100_Attack_rush_circle_Fire_aerial; // 0x1e18(0x08)
	struct UBP_ch0100_Attack_rush_circle_Electric_aerial_C* BP_ch0100_Attack_rush_circle_Electric_aerial; // 0x1e20(0x08)
	struct UBP_ch0100_Attack_rush_circle_aerial_C* BP_ch0100_Attack_rush_circle_aerial; // 0x1e28(0x08)
	struct UBP_ch0100_CombinationVisionCh1000_C* BP_ch0100_CombinationVisionCh10001; // 0x1e30(0x08)
	struct UBP_ch0100_CombinationVisionCh0900_C* BP_ch0100_CombinationVisionCh09001; // 0x1e38(0x08)
	struct UBP_ch0100_CombinationVisionCh0800_C* BP_ch0100_CombinationVisionCh08001; // 0x1e40(0x08)
	struct UBP_ch0100_CombinationVisionCh0700_C* BP_ch0100_CombinationVisionCh07001; // 0x1e48(0x08)
	struct UBP_ch0100_CombinationVisionCh0600_C* BP_ch0100_CombinationVisionCh06001; // 0x1e50(0x08)
	struct UBP_ch0100_CombinationVisionCh0500_C* BP_ch0100_CombinationVisionCh05001; // 0x1e58(0x08)
	struct UBP_ch0100_CombinationVisionCh0400_C* BP_ch0100_CombinationVisionCh04001; // 0x1e60(0x08)
	struct UBP_ch0100_CombinationVisionCh0300_C* BP_ch0100_CombinationVisionCh03001; // 0x1e68(0x08)
	struct UBP_ch0100_CombinationVisionCh0200_C* BP_ch0100_CombinationVisionCh02001; // 0x1e70(0x08)
	struct UBP_ch0100_CombinationVisionCh1000_C* BP_ch0100_CombinationVisionCh1000; // 0x1e78(0x08)
	struct UBP_ch0100_CombinationVisionCh0900_C* BP_ch0100_CombinationVisionCh0900; // 0x1e80(0x08)
	struct UBP_ch0100_CombinationVisionCh0800_C* BP_ch0100_CombinationVisionCh0800; // 0x1e88(0x08)
	struct UBP_ch0100_CombinationVisionCh0700_C* BP_ch0100_CombinationVisionCh0700; // 0x1e90(0x08)
	struct UBP_ch0100_CombinationVisionCh0600_C* BP_ch0100_CombinationVisionCh0600; // 0x1e98(0x08)
	struct UBP_ch0100_CombinationVisionCh0500_C* BP_ch0100_CombinationVisionCh0500; // 0x1ea0(0x08)
	struct UBP_ch0100_CombinationVisionCh0400_C* BP_ch0100_CombinationVisionCh0400; // 0x1ea8(0x08)
	struct UBP_ch0100_CombinationVisionCh0300_C* BP_ch0100_CombinationVisionCh0300; // 0x1eb0(0x08)
	struct UBP_ch0100_CombinationVisionCh0200_C* BP_ch0100_CombinationVisionCh0200; // 0x1eb8(0x08)
	struct UBP_ch0100_PsychicAttack_Flying1_C* BP_ch0100_PsychicAttack_Flying2; // 0x1ec0(0x08)
	struct UBP_ch0100_Attack_TelepoRush_C* BP_ch0100_Attack_TelepoRush; // 0x1ec8(0x08)
	struct UBP_ch0100_Attack_ChargeOnly_C* BP_ch0100_Attack_ChargeOnly; // 0x1ed0(0x08)
	struct UBP_ch0100_PsychicField_C* BP_ch0100_PsychicField_second; // 0x1ed8(0x08)
	struct UBP_ch0100_PsychicField_C* BP_ch0100_PsychicField; // 0x1ee0(0x08)
	struct UBP_ch0100_BrainFieldChargeAttack_C* BP_ch0100_BrainFieldChargeAttack; // 0x1ee8(0x08)
	struct UBP_ch0100_BrainFieldThrow2_C* BP_ch0100_BrainFieldThrow2; // 0x1ef0(0x08)
	struct UBP_ch0100_BrainFieldThrow1_C* BP_ch0100_BrainFieldThrow1; // 0x1ef8(0x08)
	struct UBP_ch0100_BrainFieldFinishAttack_C* BP_ch0100_BrainFieldFinishAttack; // 0x1f00(0x08)
	struct UBP_ch0100_BrainFieldFallAttack_C* BP_ch0100_BrainFieldFallAttack; // 0x1f08(0x08)
	struct UBP_ch0100_BrainFieldChaseAttack_C* BP_ch0100_BrainFieldChaseAttack; // 0x1f10(0x08)
	struct UBP_ch0100_BrainFieldChargeAttack3_C* BP_ch0100_BrainFieldChargeAttack3; // 0x1f18(0x08)
	struct UBP_ch0100_BrainFieldChargeAttack2_C* BP_ch0100_BrainFieldChargeAttack2; // 0x1f20(0x08)
	struct UBP_ch0100_BrainFieldChargeAttack1_C* BP_ch0100_BrainFieldChargeAttack1; // 0x1f28(0x08)
	struct UBP_ch0100_BrainFieldBackStepAttack3_C* BP_ch0100_BrainFieldBackStepAttack3; // 0x1f30(0x08)
	struct UBP_ch0100_BrainFieldBackStepAttack2_C* BP_ch0100_BrainFieldBackStepAttack2; // 0x1f38(0x08)
	struct UBP_ch0100_BrainFieldBackStepAttack1_C* BP_ch0100_BrainFieldBackStepAttack1; // 0x1f40(0x08)
	struct UBP_ch0100_BrainFieldAttack3_C* BP_ch0100_BrainFieldAttack3; // 0x1f48(0x08)
	struct UBP_ch0100_BrainFieldAttack2_C* BP_ch0100_BrainFieldAttack2; // 0x1f50(0x08)
	struct UBP_ch0100_BrainFieldAttack1_C* BP_ch0100_BrainFieldAttack1; // 0x1f58(0x08)
	struct UBP_ch0100_BrainFieldAirThrow2_C* BP_ch0100_BrainFieldAirThrow2; // 0x1f60(0x08)
	struct UBP_ch0100_BrainFieldAirThrow1_C* BP_ch0100_BrainFieldAirThrow1; // 0x1f68(0x08)
	struct UBP_ch0100_Attack_AssassinAttack_C* BP_ch0100_Attack_AssassinAttack; // 0x1f70(0x08)
	struct UBP_ch0100_PsychicComboLV1_Flying_C* BP_ch0100_PsychicComboLV1_Flying; // 0x1f78(0x08)
	struct UBP_ch0100_Attack_LaunchChase_Fire_C* BP_ch0100_Attack_LaunchChase_Fire; // 0x1f80(0x08)
	struct UBP_ch0100_Attack_LaunchChase_Electric_C* BP_ch0100_Attack_LaunchChase_Electric; // 0x1f88(0x08)
	struct UBP_ch0100_Attack_JustDodgeAirAttack_Fire_C* BP_ch0100_Attack_JustDodgeAirAttack_Fire; // 0x1f90(0x08)
	struct UBP_ch0100_Attack_JustDodgeAirAttack_Electric_C* BP_ch0100_Attack_JustDodgeAirAttack_Electric; // 0x1f98(0x08)
	struct UBP_ch0100_Attack_FlyingChase_Fire_C* BP_ch0100_Attack_FlyingChase_Fire; // 0x1fa0(0x08)
	struct UBP_ch0100_Attack_FlyingChase_Electric_C* BP_ch0100_Attack_FlyingChase_Electric; // 0x1fa8(0x08)
	struct UBP_ch0100_Attack_JustDodgeAttack_Fire_C* BP_ch0100_Attack_JustDodgeAttack_Fire; // 0x1fb0(0x08)
	struct UBP_ch0100_Attack_JustDodgeAttack_Electric_C* BP_ch0100_Attack_JustDodgeAttack_Electric; // 0x1fb8(0x08)
	struct UBP_ch0100_Attack_FlyingRush_Electric_C* BP_ch0100_Attack_FlyingRush_Electric; // 0x1fc0(0x08)
	struct UBP_ch0100_Attack_FlyingRush_Fire_C* BP_ch0100_Attack_FlyingRush_Fire; // 0x1fc8(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV1_Electric_SAS_C* BP_ch0100_Attack_ChargeAttackLV1_Electric_SAS; // 0x1fd0(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV3_Electric_SAS_C* BP_ch0100_Attack_ChargeAttackLV3_Electric_SAS; // 0x1fd8(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV2_Electric_SAS_C* BP_ch0100_Attack_ChargeAttackLV2_Electric_SAS; // 0x1fe0(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV3_Electric_C* BP_ch0100_Attack_ChargeAttackLV3_Electric; // 0x1fe8(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV2_Electric_C* BP_ch0100_Attack_ChargeAttackLV2_Electric; // 0x1ff0(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV1_Electric_C* BP_ch0100_Attack_ChargeAttackLV1_Electric; // 0x1ff8(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV1_Fire_C* BP_ch0100_Attack_ChargeAttackLV1_Fire; // 0x2000(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV2_Fire_C* BP_ch0100_Attack_ChargeAttackLV2_Fire; // 0x2008(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV3_Fire_C* BP_ch0100_Attack_ChargeAttackLV3_Fire; // 0x2010(0x08)
	struct UBP_ch0100_SASHologramCh0200_C* BP_ch0100_SASHologramCh0200; // 0x2018(0x08)
	struct UBP_ch0100_SASHologramCh1000_C* BP_ch0100_SASHologramCh1000; // 0x2020(0x08)
	struct UBP_ch0100_SASHologramCh0900_C* BP_ch0100_SASHologramCh0900; // 0x2028(0x08)
	struct UBP_ch0100_SASHologramCh0700_C* BP_ch0100_SASHologramCh0700; // 0x2030(0x08)
	struct UBP_ch0100_SASHologramCh0600_C* BP_ch0100_SASHologramCh0600; // 0x2038(0x08)
	struct UBP_ch0100_SASHologramCh0500_C* BP_ch0100_SASHologramCh0500; // 0x2040(0x08)
	struct UBP_ch0100_Attack_Chase4_Fire_C* BP_ch0100_Attack_Chase4_Fire; // 0x2048(0x08)
	struct UBP_ch0100_Attack_Chase4_Electric_C* BP_ch0100_Attack_Chase4_Electric; // 0x2050(0x08)
	struct UBP_ch0100_Attack_Chase3_Fire_C* BP_ch0100_Attack_Chase3_Fire; // 0x2058(0x08)
	struct UBP_ch0100_Attack_Chase3_Electric_C* BP_ch0100_Attack_Chase3_Electric; // 0x2060(0x08)
	struct UBP_ch0100_Attack_Chase2_Fire_C* BP_ch0100_Attack_Chase2_Fire; // 0x2068(0x08)
	struct UBP_ch0100_Attack_Chase2_Electric_C* BP_ch0100_Attack_Chase2_Electric; // 0x2070(0x08)
	struct UBP_ch0100_Attack_Chase1_Fire_C* BP_ch0100_Attack_Chase1_Fire; // 0x2078(0x08)
	struct UBP_ch0100_Attack_Chase1_Electric_C* BP_ch0100_Attack_Chase1_Electric; // 0x2080(0x08)
	struct UBP_ch0100_Attack_rush_circle_Fire_C* BP_ch0100_Attack_rush_circle_Fire; // 0x2088(0x08)
	struct UBP_ch0100_Attack_rush_circle_Electric_C* BP_ch0100_Attack_rush_circle_Electric; // 0x2090(0x08)
	struct UBP_ch0100_SASHologramCh0800_C* BP_ch0100_SASHologramCh0800; // 0x2098(0x08)
	struct UBP_ch0100_SASHologramCh0400_C* BP_ch0100_SASHologramCh0400; // 0x20a0(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV3_C* BP_ch0100_Attack_ChargeAttackLV3; // 0x20a8(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV2_C* BP_ch0100_Attack_ChargeAttackLV2; // 0x20b0(0x08)
	struct UBP_ch0100_Attack_ChargeAttackLV1_C* BP_ch0100_Attack_ChargeAttackLV1; // 0x20b8(0x08)
	struct UBP_ch0100_SASHologramCh0300_C* BP_ch0100_SASHologramCh0300; // 0x20c0(0x08)
	struct UBP_ch0100_Attack_LaunchChase_C* BP_ch0100_Attack_LaunchChase; // 0x20c8(0x08)
	struct UBP_ch0100_Attack_Electric_a5_2_C* BP_ch0100_Attack_Electric_a5_3; // 0x20d0(0x08)
	struct UBP_ch0100_Attack_Fire_a5_2_C* BP_ch0100_Attack_Fire_a5_3; // 0x20d8(0x08)
	struct UBP_ch0100_Attack_FlyingChase_C* BP_ch0100_Attack_FlyingChase; // 0x20e0(0x08)
	struct UBP_ch0100_Attack_JustDodgePsychic_C* BP_ch0100_Attack_JustDodgePsychic; // 0x20e8(0x08)
	struct UBP_ch0100_Attack_Chase4_C* BP_ch0100_Attack_Chase4; // 0x20f0(0x08)
	struct UBP_ch0100_Attack_Chase3_C* BP_ch0100_Attack_Chase3; // 0x20f8(0x08)
	struct UBP_ch0100_Attack_Chase2_C* BP_ch0100_Attack_Chase2; // 0x2100(0x08)
	struct UBP_ch0100_Attack_Chase1_C* BP_ch0100_Attack_Chase1; // 0x2108(0x08)
	struct UBP_ch0100_Attack_JustDodgeAirAttack_C* BP_ch0100_Attack_JustDodgeAirAttack; // 0x2110(0x08)
	struct UBP_ch0100_Attack_JustDodgeAttack_C* BP_ch0100_Attack_JustDodgeAttack; // 0x2118(0x08)
	struct UBP_ch0100_Attack_FlyingRush_C* BP_ch0100_Attack_FlyingRush; // 0x2120(0x08)
	struct UBP_ch0100_Attack_rush_circle_C* BP_ch0100_Attack_rush_circle; // 0x2128(0x08)
	struct UBP_ch0100_PsychicAttack_Flying1_C* BP_ch0100_PsychicAttack_Flying1; // 0x2130(0x08)
	struct UBP_ch0100_PsychicComboLV4_C* BP_ch0100_PsychicComboLV4; // 0x2138(0x08)
	struct UBP_ch0100_PsychicComboLV3_C* BP_ch0100_PsychicComboLV3; // 0x2140(0x08)
	struct UBP_ch0100_PsychicComboLV2_C* BP_ch0100_PsychicComboLV2; // 0x2148(0x08)
	struct UBP_ch0100_PsychicComboLV1_C* BP_ch0100_PsychicComboLV1; // 0x2150(0x08)
	struct UBP_ch0100_PsychicUniqueAttack_C* BP_ch0100_PsychicUniqueAttack_second; // 0x2158(0x08)
	struct UBP_ch0100_PsychicUniqueAttack_C* BP_ch0100_PsychicUniqueAttack; // 0x2160(0x08)
	struct UBP_ch0100_Attack_TelepoRush_Fire_C* BP_ch0100_Attack_TelepoRush_Fire; // 0x2168(0x08)
	struct UBP_ch0100_Attack_TelepoRush_Electric_C* BP_ch0100_Attack_TelepoRush_Electric; // 0x2170(0x08)
	struct UBP_ch0100_Attack_TelepoAirRush_Fire_C* BP_ch0100_Attack_TelepoAirRush_Fire; // 0x2178(0x08)
	struct UBP_ch0100_Attack_TelepoAirRush_Electric_C* BP_ch0100_Attack_TelepoAirRush_Electric; // 0x2180(0x08)
	struct UBP_ch0100_Attack_TelepoAirRush_C* BP_ch0100_Attack_TelepoAirRush; // 0x2188(0x08)
	struct UBP_ch0100_Attack_Fire_a5_C* BP_ch0100_Attack_Fire_a5; // 0x2190(0x08)
	struct UBP_ch0100_Attack_Fire_d1_C* BP_ch0100_Attack_Fall_Fire2; // 0x2198(0x08)
	struct UBP_ch0100_Attack_Fire_a4_C* BP_ch0100_Attack_Fire_a4; // 0x21a0(0x08)
	struct UBP_ch0100_Attack_Electric_b5_C* BP_ch0100_Attack_Electric_b5; // 0x21a8(0x08)
	struct UBP_ch0100_Attack_Electric_a4_C* BP_ch0100_Attack_Electric_a4; // 0x21b0(0x08)
	struct UBP_ch0100_Attack_rush_Fire_C* BP_ch0100_Attack_rush_Fire; // 0x21b8(0x08)
	struct UBP_ch0100_Attack_Jump_Fire_b2_C* BP_ch0100_Attack_Fall_Fire; // 0x21c0(0x08)
	struct UBP_ch0100_Attack_Jump_Fire_a2_C* BP_ch0100_Attack_Jump_Fire_a2; // 0x21c8(0x08)
	struct UBP_ch0100_Attack_Jump_Fire_a1_C* BP_ch0100_Attack_Jump_Fire_a1; // 0x21d0(0x08)
	struct UBP_ch0100_Attack_Fire_b2_C* BP_ch0100_Attack_Launch_Fire; // 0x21d8(0x08)
	struct UBP_ch0100_Attack_Fire_a3_C* BP_ch0100_Attack_Fire_a3; // 0x21e0(0x08)
	struct UBP_ch0100_Attack_Fire_a2_C* BP_ch0100_Attack_Fire_a2; // 0x21e8(0x08)
	struct UBP_ch0100_Attack_Fire_a1_C* BP_ch0100_Attack_Fire_a1; // 0x21f0(0x08)
	struct UPlayerAnimControllerComponent* PlayerAnimController; // 0x21f8(0x08)
	struct UBP_ch0100_Attack_rush_Electric_C* BP_ch0100_Attack_rush_Electric; // 0x2200(0x08)
	struct UBP_ch0100_Attack_Jump_Electric_b2_C* BP_ch0100_Attack_Fall_Electric; // 0x2208(0x08)
	struct UBP_ch0100_Attack_Jump_Electric_a2_C* BP_ch0100_Attack_Jump_Electric_a2; // 0x2210(0x08)
	struct UBP_ch0100_Attack_Jump_Electric_a1_C* BP_ch0100_Attack_Jump_Electric_a1; // 0x2218(0x08)
	struct UBP_ch0100_Attack_Jump_b2_C* BP_ch0100_Attack_Fall; // 0x2220(0x08)
	struct UBP_ch0100_Attack_Jump_a2_C* BP_ch0100_Attack_Jump_a2; // 0x2228(0x08)
	struct UBP_ch0100_Attack_Jump_a1_C* BP_ch0100_Attack_Jump_a1; // 0x2230(0x08)
	struct UBP_ch0100_Attack_Electric_a2_C* BP_ch0100_Attack_Electric_a2; // 0x2238(0x08)
	struct UBP_ch0100_Attack_Electric_a3_C* BP_ch0100_Attack_Electric_a3; // 0x2240(0x08)
	struct UBP_ch0100_Attack_Electric_b2_C* BP_ch0100_Attack_Launch_Electric; // 0x2248(0x08)
	struct UBP_ch0100_Attack_Electric_a1_C* BP_ch0100_Attack_Electric_a1; // 0x2250(0x08)
	struct UBP_ch0100_Attack_a5_C* BP_ch0100_Attack_a5; // 0x2258(0x08)
	struct UBP_ch0100_Attack_a4_C* BP_ch0100_Attack_a4; // 0x2260(0x08)
	struct UBP_ch0100_Attack_b2_C* BP_ch0100_Attack_Launch; // 0x2268(0x08)
	struct UBP_ch0100_Attack_rush_C* BP_ch0100_Attack_rush; // 0x2270(0x08)
	struct UBP_ch0100_Attack_a1_C* BP_ch0100_Attack_a1; // 0x2278(0x08)
	struct UBP_ch0100_Attack_a2_C* BP_ch0100_Attack_a2; // 0x2280(0x08)
	struct UBP_ch0100_Attack_a3_C* BP_ch0100_Attack_a3; // 0x2288(0x08)
	float FlyingComboInterval; // 0x2290(0x04)
	char pad_2294[0x4]; // 0x2294(0x04)
	struct TArray<int32_t> LunaticIBTD_LV1; // 0x2298(0x10)
	struct TArray<int32_t> LunaticIBTD_LV2; // 0x22a8(0x10)
	struct TArray<int32_t> LunaticIBTD_LV3; // 0x22b8(0x10)
	struct TArray<int32_t> LunaticIBTD_First; // 0x22c8(0x10)
	int32_t LastLunaticID; // 0x22d8(0x04)
	float RollingMoveAttackInterval; // 0x22dc(0x04)

	void GetBrainFieldLunaticBrainTalkID(enum class EPlayerBrainFieldDanger DangerLV, bool bFirst, struct FName BrainTalkID); // Function BP_ch0100.BP_ch0100_C.GetBrainFieldLunaticBrainTalkID // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ApplySkillAttack(); // Function BP_ch0100.BP_ch0100_C.ApplySkillAttack // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OpenBrainFieldSetting(bool bDummy); // Function BP_ch0100.BP_ch0100_C.OpenBrainFieldSetting // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IsWeaponAttachMode(bool bBattle); // Function BP_ch0100.BP_ch0100_C.IsWeaponAttachMode // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void GetDriveParameterName(struct FName Name); // Function BP_ch0100.BP_ch0100_C.GetDriveParameterName // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void OnBrainFieldMoveNormalField(bool bDummy); // Function BP_ch0100.BP_ch0100_C.OnBrainFieldMoveNormalField // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnBrainFieldMoveBrainField(bool bDummy); // Function BP_ch0100.BP_ch0100_C.OnBrainFieldMoveBrainField // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ComboSettingAI(); // Function BP_ch0100.BP_ch0100_C.ComboSettingAI // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetReviveCableSocketName(int32_t Index, struct FName SocketName); // Function BP_ch0100.BP_ch0100_C.GetReviveCableSocketName // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1685580
	void CreateWeapon(bool bDummy); // Function BP_ch0100.BP_ch0100_C.CreateWeapon // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnDestroy(bool bDummy); // Function BP_ch0100.BP_ch0100_C.OnDestroy // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CreateCopy(); // Function BP_ch0100.BP_ch0100_C.CreateCopy // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetWeaponSocketName(int32_t Index, bool bBattle, bool ForceBattle, struct FName SocketName); // Function BP_ch0100.BP_ch0100_C.GetWeaponSocketName // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void OnChangeBattleReady(bool bBattle, bool bDummy); // Function BP_ch0100.BP_ch0100_C.OnChangeBattleReady // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IsNoBattleWeaponDispOff(bool bOff); // Function BP_ch0100.BP_ch0100_C.IsNoBattleWeaponDispOff // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void ComboSetting(enum class EPlayerComboPattern first, enum class EPlayerComboPattern second, bool dummy); // Function BP_ch0100.BP_ch0100_C.ComboSetting // (Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UserConstructionScript(); // Function BP_ch0100.BP_ch0100_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnInitialize(); // Function BP_ch0100.BP_ch0100_C.OnInitialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_BP_ch0100(int32_t EntryPoint); // Function BP_ch0100.BP_ch0100_C.ExecuteUbergraph_BP_ch0100 // (Final|UbergraphFunction) // @ game+0x1685580
};

