// BlueprintGeneratedClass BP_ch0200.BP_ch0200_C
// Size: 0x22f9 (Inherited: 0x1def)
struct ABP_ch0200_C : ARsBattleHero_C {
	char pad_1DEF[0x1]; // 0x1def(0x01)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1df0(0x08)
	struct UBP_ch0200_Attack_BackStepAir_fire_C* BP_ch0200_Attack_BackStepAir_fire1; // 0x1df8(0x08)
	struct UBP_ch0200_Attack_BackStepAir_electric_C* BP_ch0200_Attack_BackStepAir_electric1; // 0x1e00(0x08)
	struct UBP_ch0200_Attack_BackStepAir_C* BP_ch0200_Attack_BackStepAir1; // 0x1e08(0x08)
	struct UBP_ch0200_CombinationVisionCh1000_C* BP_ch0200_CombinationVisionCh10001; // 0x1e10(0x08)
	struct UBP_ch0200_CombinationVisionCh0900_C* BP_ch0200_CombinationVisionCh09001; // 0x1e18(0x08)
	struct UBP_ch0200_CombinationVisionCh0800_C* BP_ch0200_CombinationVisionCh08001; // 0x1e20(0x08)
	struct UBP_ch0200_CombinationVisionCh0700_C* BP_ch0200_CombinationVisionCh07001; // 0x1e28(0x08)
	struct UBP_ch0200_CombinationVisionCh0600_C* BP_ch0200_CombinationVisionCh06001; // 0x1e30(0x08)
	struct UBP_ch0200_CombinationVisionCh0500_C* BP_ch0200_CombinationVisionCh05001; // 0x1e38(0x08)
	struct UBP_ch0200_CombinationVisionCh0400_C* BP_ch0200_CombinationVisionCh04001; // 0x1e40(0x08)
	struct UBP_ch0200_CombinationVisionCh0300_C* BP_ch0200_CombinationVisionCh03001; // 0x1e48(0x08)
	struct UBP_ch0200_CombinationVisionCh0100_C* BP_ch0200_CombinationVisionCh01001; // 0x1e50(0x08)
	struct UBP_ch0200_CombinationVisionCh1000_C* BP_ch0200_CombinationVisionCh1000; // 0x1e58(0x08)
	struct UBP_ch0200_CombinationVisionCh0900_C* BP_ch0200_CombinationVisionCh0900; // 0x1e60(0x08)
	struct UBP_ch0200_CombinationVisionCh0800_C* BP_ch0200_CombinationVisionCh0800; // 0x1e68(0x08)
	struct UBP_ch0200_CombinationVisionCh0700_C* BP_ch0200_CombinationVisionCh0700; // 0x1e70(0x08)
	struct UBP_ch0200_CombinationVisionCh0600_C* BP_ch0200_CombinationVisionCh0600; // 0x1e78(0x08)
	struct UBP_ch0200_CombinationVisionCh0500_C* BP_ch0200_CombinationVisionCh0500; // 0x1e80(0x08)
	struct UBP_ch0200_CombinationVisionCh0400_C* BP_ch0200_CombinationVisionCh0400; // 0x1e88(0x08)
	struct UBP_ch0200_CombinationVisionCh0300_C* BP_ch0200_CombinationVisionCh0300; // 0x1e90(0x08)
	struct UBP_ch0200_CombinationVisionCh0100_C* BP_ch0200_CombinationVisionCh0100; // 0x1e98(0x08)
	struct UBP_ch0200_PsychicAttack_Flying1_C* BP_ch0200_PsychicAttack_Flying2; // 0x1ea0(0x08)
	struct UBP_ch0200_PsychicField_C* BP_ch0200_PsychicField_second; // 0x1ea8(0x08)
	struct UBP_ch0200_PsychicField_C* BP_ch0200_PsychicField; // 0x1eb0(0x08)
	struct UBP_ch0200_Attack_LaunchChase_C* BP_ch0200_Attack_LaunchChase; // 0x1eb8(0x08)
	struct UBP_ch0200_Attack_LaunchChase_electric_C* BP_ch0200_Attack_LaunchChase_electric; // 0x1ec0(0x08)
	struct UBP_ch0200_Attack_LaunchChase_fire_C* BP_ch0200_Attack_LaunchChase_fire; // 0x1ec8(0x08)
	struct UBP_ch0200_Attack_JustDodgePsychic_C* BP_ch0200_Attack_JustDodgePsychic; // 0x1ed0(0x08)
	struct UBP_ch0200_Attack_AssassinAttack_C* BP_ch0200_Attack_AssassinAttack; // 0x1ed8(0x08)
	struct UBP_ch0200_BrainFieldAirThrow1_C* BP_ch0200_BrainFieldAirThrow1; // 0x1ee0(0x08)
	struct UBP_ch0200_BrainFieldAirThrow2_C* BP_ch0200_BrainFieldAirThrow2; // 0x1ee8(0x08)
	struct UBP_ch0200_BrainFieldThrow1_C* BP_ch0200_BrainFieldThrow1; // 0x1ef0(0x08)
	struct UBP_ch0200_BrainFieldThrow2_C* BP_ch0200_BrainFieldThrow2; // 0x1ef8(0x08)
	struct UBP_ch0200_BrainFieldFinishAttack_C* BP_ch0200_BrainFieldFinishAttack; // 0x1f00(0x08)
	struct UBP_ch0200_BrainFieldChargeAttack3_C* BP_ch0200_BrainFieldChargeAttack3; // 0x1f08(0x08)
	struct UBP_ch0200_BrainFieldChargeAttack2_C* BP_ch0200_BrainFieldChargeAttack2; // 0x1f10(0x08)
	struct UBP_ch0200_BrainFieldChargeAttack1_C* BP_ch0200_BrainFieldChargeAttack1; // 0x1f18(0x08)
	struct UBP_ch0200_BrainFieldChargeAttack_C* BP_ch0200_BrainFieldChargeAttack; // 0x1f20(0x08)
	struct UBP_ch0200_BrainFieldBackStepAttack3_C* BP_ch0200_BrainFieldBackStepAttack3; // 0x1f28(0x08)
	struct UBP_ch0200_BrainFieldBackStepAttack2_C* BP_ch0200_BrainFieldBackStepAttack2; // 0x1f30(0x08)
	struct UBP_ch0200_BrainFieldBackStepAttack1_C* BP_ch0200_BrainFieldBackStepAttack1; // 0x1f38(0x08)
	struct UBP_ch0200_BrainFieldFallAttack_C* BP_ch0200_BrainFieldFallAttack; // 0x1f40(0x08)
	struct UBP_ch0200_BrainFieldChaseAttack_C* BP_ch0200_BrainFieldChaseAttack; // 0x1f48(0x08)
	struct UBP_ch0200_BrainFieldAttack3_C* BP_ch0200_BrainFieldAttack3; // 0x1f50(0x08)
	struct UBP_ch0200_BrainFieldAttack2_C* BP_ch0200_BrainFieldAttack2; // 0x1f58(0x08)
	struct UBP_ch0200_BrainFieldAttack1_C* BP_ch0200_BrainFieldAttack1; // 0x1f60(0x08)
	struct UBP_ch0200_Attack_FlyingChase2_fire_C* BP_ch0200_Attack_FlyingChase2_fire; // 0x1f68(0x08)
	struct UBP_ch0200_Attack_FlyingChase2_electric_C* BP_ch0200_Attack_FlyingChase2_electric; // 0x1f70(0x08)
	struct UBP_ch0200_Attack_FlyingChase1_fire_C* BP_ch0200_Attack_FlyingChase1_fire; // 0x1f78(0x08)
	struct UBP_ch0200_Attack_FlyingChase1_electric_C* BP_ch0200_Attack_FlyingChase1_electric; // 0x1f80(0x08)
	struct UBP_ch0200_Attack_Chase4_fire_C* BP_ch0200_Attack_Chase4_fire; // 0x1f88(0x08)
	struct UBP_ch0200_Attack_Chase4_electric_C* BP_ch0200_Attack_Chase4_electric; // 0x1f90(0x08)
	struct UBP_ch0200_Attack_Chase3_fire_C* BP_ch0200_Attack_Chase3_fire; // 0x1f98(0x08)
	struct UBP_ch0200_Attack_Chase3_electric_C* BP_ch0200_Attack_Chase3_electric; // 0x1fa0(0x08)
	struct UBP_ch0200_Attack_Chase2_fire_C* BP_ch0200_Attack_Chase2_fire; // 0x1fa8(0x08)
	struct UBP_ch0200_Attack_Chase2_electric_C* BP_ch0200_Attack_Chase2_electric; // 0x1fb0(0x08)
	struct UBP_ch0200_Attack_Chase1_fire_C* BP_ch0200_Attack_Chase1_fire; // 0x1fb8(0x08)
	struct UBP_ch0200_Attack_Chase1_electric_C* BP_ch0200_Attack_Chase1_electric; // 0x1fc0(0x08)
	struct UBP_ch0200_Attack_JustDodgeAirAttack_fire_C* BP_ch0200_Attack_JustDodgeAirAttack_fire; // 0x1fc8(0x08)
	struct UBP_ch0200_Attack_JustDodgeAirAttack_electric_C* BP_ch0200_Attack_JustDodgeAirAttack_electric; // 0x1fd0(0x08)
	struct UBP_ch0200_Attack_JustDodgeAttack_fire_C* BP_ch0200_Attack_JustDodgeAttack_fire; // 0x1fd8(0x08)
	struct UBP_ch0200_Attack_JustDodgeAttack_electric_C* BP_ch0200_Attack_JustDodgeAttack_electric; // 0x1fe0(0x08)
	struct UBP_ch0200_Attack_TelepoAirRush_fire_C* BP_ch0200_Attack_TelepoAirRush_fire; // 0x1fe8(0x08)
	struct UBP_ch0200_Attack_TelepoAirRush_electric_C* BP_ch0200_Attack_TelepoAirRush_electric; // 0x1ff0(0x08)
	struct UBP_ch0200_Attack_TelepoRush_electric_C* BP_ch0200_Attack_TelepoRush_electric; // 0x1ff8(0x08)
	struct UBP_ch0200_Attack_TelepoRush_fire_C* BP_ch0200_Attack_TelepoRush_fire; // 0x2000(0x08)
	struct UBP_ch0200_Attack_AirAttack3_electric_sas_C* BP_ch0200_Attack_AirAttack3_electric_sas; // 0x2008(0x08)
	struct UBP_ch0200_Attack_AirAttack3_fire_sas_C* BP_ch0200_Attack_AirAttack3_fire_sas; // 0x2010(0x08)
	struct UBP_ch0200_Attack_AirAttack2_fire_C* BP_ch0200_Attack_AirAttack2_fire; // 0x2018(0x08)
	struct UBP_ch0200_Attack_AirAttack2_electric_C* BP_ch0200_Attack_AirAttack2_electric; // 0x2020(0x08)
	struct UBP_ch0200_Attack_AirAttack1_fire_C* BP_ch0200_Attack_AirAttack1_fire; // 0x2028(0x08)
	struct UBP_ch0200_Attack_AirAttack1_electric_C* BP_ch0200_Attack_AirAttack1_electric; // 0x2030(0x08)
	struct UBP_ch0200_Attack_FallAttack_fire_C* BP_ch0200_Attack_FallAttack_fire; // 0x2038(0x08)
	struct UBP_ch0200_Attack_FallAttack_electric_C* BP_ch0200_Attack_FallAttack_electric; // 0x2040(0x08)
	struct UBP_ch0200_LaunchAttack_fire_C* BP_ch0200_LaunchAttack_fire; // 0x2048(0x08)
	struct UBP_ch0200_LaunchAttack_electirc_C* BP_ch0200_LaunchAttack_electirc; // 0x2050(0x08)
	struct UBP_ch0200_Attack_AirDash_electric_C* BP_ch0200_Attack_AirDash_electric; // 0x2058(0x08)
	struct UBP_ch0200_Attack_AirDash_fire_C* BP_ch0200_Attack_AirDash_fire; // 0x2060(0x08)
	struct UBP_ch0200_Attack_Dash_fire_C* BP_ch0200_Attack_Dash_fire; // 0x2068(0x08)
	struct UBP_ch0200_Attack_Dash_electric_C* BP_ch0200_Attack_Dash_electric; // 0x2070(0x08)
	struct UBP_ch0200_Attack_BackStepAir_electric_C* BP_ch0200_Attack_BackStepAir_electric; // 0x2078(0x08)
	struct UBP_ch0200_Attack_BackStepAir_fire_C* BP_ch0200_Attack_BackStepAir_fire; // 0x2080(0x08)
	struct UBP_ch0200_Attack_BackStep_electric_sas_C* BP_ch0200_Attack_BackStep_electric_sas; // 0x2088(0x08)
	struct UBP_ch0200_Attack_ChargeAttack_electric_C* BP_ch0200_Attack_ChargeAttack_electric; // 0x2090(0x08)
	struct UBP_ch0200_Attack_ChargeAttack_fire_sas_C* BP_ch0200_Attack_ChargeAttack_fire_sas; // 0x2098(0x08)
	struct UBP_ch0200_Attack_TelepoAirRush_C* BP_ch0200_Attack_TelepoAirRush; // 0x20a0(0x08)
	struct UBP_ch0200_Attack_TelepoRush_C* BP_ch0200_Attack_TelepoRush; // 0x20a8(0x08)
	struct UBP_ch0200_Attack_ChargeAttack_fire_C* BP_ch0200_Attack_ChargeAttack_fire; // 0x20b0(0x08)
	struct UBP_ch0200_SASHologramCh1000_C* BP_ch0200_SASHologramCh1000; // 0x20b8(0x08)
	struct UBP_ch0200_SASHologramCh0900_C* BP_ch0200_SASHologramCh0900; // 0x20c0(0x08)
	struct UBP_ch0200_SASHologramCh0800_C* BP_ch0200_SASHologramCh0800; // 0x20c8(0x08)
	struct UBP_ch0200_SASHologramCh0700_C* BP_ch0200_SASHologramCh0700; // 0x20d0(0x08)
	struct UBP_ch0200_SASHologramCh0600_C* BP_ch0200_SASHologramCh0600; // 0x20d8(0x08)
	struct UBP_ch0200_SASHologramCh0500_C* BP_ch0200_SASHologramCh0500; // 0x20e0(0x08)
	struct UBP_ch0200_SASHologramCh0400_C* BP_ch0200_SASHologramCh0400; // 0x20e8(0x08)
	struct UBP_ch0200_SASHologramCh0300_C* BP_ch0200_SASHologramCh0300; // 0x20f0(0x08)
	struct UBP_ch0200_SASHologramCh0100_C* BP_ch0200_SASHologramCh0100; // 0x20f8(0x08)
	struct UBP_ch0200_Attack_BackStep_electric_C* BP_ch0200_Attack_BackStep_electric; // 0x2100(0x08)
	struct UBP_ch0200_Attack_BackStep_fire_C* BP_ch0200_Attack_BackStep_fire; // 0x2108(0x08)
	struct UBP_ch0200_Attack_AirAttack3_fire_C* BP_ch0200_Attack_AirAttack3_fire; // 0x2110(0x08)
	struct UBP_ch0200_Attack_AirAttack3_electric_C* BP_ch0200_Attack_AirAttack3_electric; // 0x2118(0x08)
	struct UBP_ch0200_Attack_a1_electric_C* BP_ch0200_Attack_a1_electric; // 0x2120(0x08)
	struct UBP_ch0200_Attack_a4_electric_C* BP_ch0200_Attack_a4_electric; // 0x2128(0x08)
	struct UBP_ch0200_Attack_a3_electric_C* BP_ch0200_Attack_a3_electric; // 0x2130(0x08)
	struct UBP_ch0200_Attack_a2_electric_C* BP_ch0200_Attack_a2_electric; // 0x2138(0x08)
	struct UBP_ch0200_Attack_a4_fire_C* BP_ch0200_Attack_a4_fire; // 0x2140(0x08)
	struct UBP_ch0200_Attack_a3_fire_C* BP_ch0200_Attack_a3_fire; // 0x2148(0x08)
	struct UBP_ch0200_Attack_a2_fire_C* BP_ch0200_Attack_a2_fire; // 0x2150(0x08)
	struct UBP_ch0200_Attack_a1_fire_C* BP_ch0200_Attack_a1_fire; // 0x2158(0x08)
	struct UBP_ch0200_PsychicAttack_Flying1_C* BP_ch0200_PsychicAttack_Flying1; // 0x2160(0x08)
	struct UBP_ch0200_Attack_BackStepAir_C* BP_ch0200_Attack_BackStepAir; // 0x2168(0x08)
	struct UBP_ch0200_Attack_FlyingChase2_C* BP_ch0200_Attack_FlyingChase2; // 0x2170(0x08)
	struct UBP_ch0200_Attack_FlyingChase1_C* BP_ch0200_Attack_FlyingChase1; // 0x2178(0x08)
	struct UBP_ch0200_Attack_JustDodgeAirAttack_C* BP_ch0200_Attack_JustDodgeAirAttack; // 0x2180(0x08)
	struct UBP_ch0200_PsychicComboLV2_Flying_C* BP_ch0200_PsychicComboLV2_Flying; // 0x2188(0x08)
	struct UBP_ch0200_PsychicComboLV1_Flying_C* BP_ch0200_PsychicComboLV1_Flying; // 0x2190(0x08)
	struct UBP_ch0200_Attack_JustDodgeAttack_C* BP_ch0200_Attack_JustDodgeAttack; // 0x2198(0x08)
	struct UBP_ch0200_Attack_AirDash_C* BP_ch0200_Attack_AirDash; // 0x21a0(0x08)
	struct UBP_ch0200_PsychicUniqueAttack_C* BP_ch0200_PsychicUniqueAttack_second; // 0x21a8(0x08)
	struct UBP_ch0200_PsychicUniqueAttack_C* BP_ch0200_PsychicUniqueAttack; // 0x21b0(0x08)
	struct UBP_ch0200_Attack_FallAttack_C* BP_ch0200_Attack_FallAttack; // 0x21b8(0x08)
	struct UBP_ch0200_Attack_Chase4_C* BP_ch0200_Attack_Chase4; // 0x21c0(0x08)
	struct UBP_ch0200_Attack_Chase3_C* BP_ch0200_Attack_Chase3; // 0x21c8(0x08)
	struct UBP_ch0200_Attack_Chase2_C* BP_ch0200_Attack_Chase2; // 0x21d0(0x08)
	struct UBP_ch0200_Attack_Chase1_C* BP_ch0200_Attack_Chase1; // 0x21d8(0x08)
	struct UBP_ch0200_Attack_Dash_C* BP_ch0200_Attack_Dash; // 0x21e0(0x08)
	struct UBP_ch0200_Attack_BackStep_C* BP_ch0200_Attack_BackStep; // 0x21e8(0x08)
	struct UBP_ch0200_PsychicComboLV4_C* BP_ch0200_PsychicComboLV4; // 0x21f0(0x08)
	struct UBP_ch0200_PsychicComboLV3_C* BP_ch0200_PsychicComboLV3; // 0x21f8(0x08)
	struct UBP_ch0200_PsychicComboLV2_C* BP_ch0200_PsychicComboLV2; // 0x2200(0x08)
	struct UBP_ch0200_PsychicComboLV1_C* BP_ch0200_PsychicComboLV1; // 0x2208(0x08)
	struct UBP_ch0200_LaunchAttack_C* BP_ch0200_LaunchAttack; // 0x2210(0x08)
	struct UBP_ch0200_Attack_ChargeAttack_C* BP_ch0200_Attack_ChargeAttack; // 0x2218(0x08)
	struct UBP_ch0200_Attack_AirAttack3_C* BP_ch0200_Attack_AirAttack3; // 0x2220(0x08)
	struct UBP_ch0200_Attack_AirAttack2_C* BP_ch0200_Attack_AirAttack2; // 0x2228(0x08)
	struct UBP_ch0200_Attack_AirAttack1_C* BP_ch0200_Attack_AirAttack1; // 0x2230(0x08)
	struct UBP_ch0200_Attack_a4_C* BP_ch0200_Attack_a4; // 0x2238(0x08)
	struct UBP_ch0200_Attack_a3_C* BP_ch0200_Attack_a3; // 0x2240(0x08)
	struct UBP_ch0200_Attack_a2_C* BP_ch0200_Attack_a2; // 0x2248(0x08)
	struct UBP_ch0200_Attack_a1_C* BP_ch0200_Attack_a1; // 0x2250(0x08)
	struct UAttackComponentBaseBP_C* AttackComponentBaseBP; // 0x2258(0x08)
	struct UPlayerAnimControllerComponent* PlayerAnimController; // 0x2260(0x08)
	enum class ECh0200WeaponAnimState WeaponAnimState; // 0x2268(0x01)
	char pad_2269[0x7]; // 0x2269(0x07)
	struct UAnimMontage* CurrentWeaponMontage; // 0x2270(0x08)
	struct UAnimMontage* WeaponMontage_Idle; // 0x2278(0x08)
	struct UAnimMontage* WeaponMontage_BeginBattle; // 0x2280(0x08)
	struct UAnimMontage* WeaponMontage_EndBattle; // 0x2288(0x08)
	struct UAnimMontage* WeaponMontage_AttackEnd; // 0x2290(0x08)
	bool bTargetInRange; // 0x2298(0x01)
	char pad_2299[0x3]; // 0x2299(0x03)
	float FlyingComboInterval; // 0x229c(0x04)
	struct FLinearColor GhostTrailColor; // 0x22a0(0x10)
	struct TArray<int32_t> LunaticIBTD_First; // 0x22b0(0x10)
	int32_t LastLunaticID; // 0x22c0(0x04)
	char pad_22C4[0x4]; // 0x22c4(0x04)
	struct TArray<int32_t> LunaticIBTD_LV1; // 0x22c8(0x10)
	struct TArray<int32_t> LunaticIBTD_LV2; // 0x22d8(0x10)
	struct TArray<int32_t> LunaticIBTD_LV3; // 0x22e8(0x10)
	bool bWeaponAnimInterruptDamage; // 0x22f8(0x01)

	void OnEndWakeupFromDead(bool bDummy); // Function BP_ch0200.BP_ch0200_C.OnEndWakeupFromDead // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DamageInterruptWeaponAnim(bool bDummy); // Function BP_ch0200.BP_ch0200_C.DamageInterruptWeaponAnim // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EndBattleWeaponAnimInterface(bool bDummy); // Function BP_ch0200.BP_ch0200_C.EndBattleWeaponAnimInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void BeginBattleWeaponAnimInterface(bool bDummy); // Function BP_ch0200.BP_ch0200_C.BeginBattleWeaponAnimInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IdleWeaponAnimInterface(bool bDummy); // Function BP_ch0200.BP_ch0200_C.IdleWeaponAnimInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetWeaponAnimStateInterface(enum class ECh0200WeaponAnimState State, struct UAnimMontage* Montage, bool bWithCopy, struct FName SectionName, bool bInterruptDamage, bool bDummy); // Function BP_ch0200.BP_ch0200_C.SetWeaponAnimStateInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnDeadPlayerCore(); // Function BP_ch0200.BP_ch0200_C.OnDeadPlayerCore // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnHologramOff(); // Function BP_ch0200.BP_ch0200_C.OnHologramOff // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetRangeParticleTypeByCurrentComboPattern(enum class EPlayerComboPattern ParticleType); // Function BP_ch0200.BP_ch0200_C.GetRangeParticleTypeByCurrentComboPattern // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void CopyPlayerOnIndex(int32_t Index, float AppearTime, bool bAttachOriginal, struct UAnimMontage* Montage, bool bWithSubWeapon, bool bDummy); // Function BP_ch0200.BP_ch0200_C.CopyPlayerOnIndex // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DoBattleSequencerEnd(bool bSetEnemyEvent, bool bDriveSequence, bool bDummy); // Function BP_ch0200.BP_ch0200_C.DoBattleSequencerEnd // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetEventEndWeaponState(); // Function BP_ch0200.BP_ch0200_C.SetEventEndWeaponState // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DoDynamicEventEnd(bool bDummy); // Function BP_ch0200.BP_ch0200_C.DoDynamicEventEnd // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnBrainFieldBattleStart(); // Function BP_ch0200.BP_ch0200_C.OnBrainFieldBattleStart // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void NeedsWeaponVisibility(bool bNeedsVisibility); // Function BP_ch0200.BP_ch0200_C.NeedsWeaponVisibility // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void OnAreaChange(bool bChangeLocation, bool bDummy); // Function BP_ch0200.BP_ch0200_C.OnAreaChange // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void BrainCrashEventStart(); // Function BP_ch0200.BP_ch0200_C.BrainCrashEventStart // (Protected|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool BattleSequencerStart(bool isSetEnemyEvent, bool bDriveSequence); // Function BP_ch0200.BP_ch0200_C.BattleSequencerStart // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetBrainFieldLunaticBrainTalkID(enum class EPlayerBrainFieldDanger DangerLV, bool bFirst, struct FName BrainTalkID); // Function BP_ch0200.BP_ch0200_C.GetBrainFieldLunaticBrainTalkID // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetWeaponSocketName(int32_t Index, bool bBattle, bool ForceBattle, struct FName SocketName); // Function BP_ch0200.BP_ch0200_C.GetWeaponSocketName // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void CreateCopy(); // Function BP_ch0200.BP_ch0200_C.CreateCopy // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ComboSettingAI(); // Function BP_ch0200.BP_ch0200_C.ComboSettingAI // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ApplySkillOther(); // Function BP_ch0200.BP_ch0200_C.ApplySkillOther // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ApplySkillAttack(); // Function BP_ch0200.BP_ch0200_C.ApplySkillAttack // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ApplySkillAction(); // Function BP_ch0200.BP_ch0200_C.ApplySkillAction // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetDriveParameterName(struct FName Name); // Function BP_ch0200.BP_ch0200_C.GetDriveParameterName // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	void DoStaticEventEnd(bool bDummy); // Function BP_ch0200.BP_ch0200_C.DoStaticEventEnd // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DoDynamicEventStart(bool bDummy); // Function BP_ch0200.BP_ch0200_C.DoDynamicEventStart // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DoStaticEventStart(bool bDummy); // Function BP_ch0200.BP_ch0200_C.DoStaticEventStart // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetPlayerWeaponList(enum class EGetPlayerWeaponType Type, struct TArray<struct ABP_WeaponBase_C*> WeaponList); // Function BP_ch0200.BP_ch0200_C.GetPlayerWeaponList // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1685580
	void EndRangeParticle(); // Function BP_ch0200.BP_ch0200_C.EndRangeParticle // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ChangeRangeParticleType(); // Function BP_ch0200.BP_ch0200_C.ChangeRangeParticleType // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetTargetInRange(bool bInRange); // Function BP_ch0200.BP_ch0200_C.SetTargetInRange // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateTargetInRangeCheck(); // Function BP_ch0200.BP_ch0200_C.UpdateTargetInRangeCheck // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetWeaponAnimState(enum class ECh0200WeaponAnimState State, struct UAnimMontage* Montage, bool bWithCopy, struct FName SectionName, bool bInterruptDamage); // Function BP_ch0200.BP_ch0200_C.SetWeaponAnimState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void MainTick(float DeltaSeconds, bool dummy); // Function BP_ch0200.BP_ch0200_C.MainTick // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateWeaponAnimState(); // Function BP_ch0200.BP_ch0200_C.UpdateWeaponAnimState // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CreateWeapon(bool bDummy); // Function BP_ch0200.BP_ch0200_C.CreateWeapon // (Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnChangeBattleReady(bool bBattle, bool bDummy); // Function BP_ch0200.BP_ch0200_C.OnChangeBattleReady // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ComboSetting(enum class EPlayerComboPattern first, enum class EPlayerComboPattern second, bool dummy); // Function BP_ch0200.BP_ch0200_C.ComboSetting // (Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UserConstructionScript(); // Function BP_ch0200.BP_ch0200_C.UserConstructionScript // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UnregisterCombo(enum class EPlayerComboPattern Pattern); // Function BP_ch0200.BP_ch0200_C.UnregisterCombo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void RegisterCombo(enum class EPlayerComboPattern Pattern); // Function BP_ch0200.BP_ch0200_C.RegisterCombo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnGhostOneShot(float AliveTime); // Function BP_ch0200.BP_ch0200_C.OnGhostOneShot // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void BrainFieldOpenEnd(struct AActor* BrainFieldUser, bool IsAttacker); // Function BP_ch0200.BP_ch0200_C.BrainFieldOpenEnd // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnInitialize(); // Function BP_ch0200.BP_ch0200_C.OnInitialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void BrainFieldCloseEnd(struct AActor* BrainFieldUser, bool IsAttacker, enum class EBrainFieldEndType EndType); // Function BP_ch0200.BP_ch0200_C.BrainFieldCloseEnd // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_BP_ch0200(int32_t EntryPoint); // Function BP_ch0200.BP_ch0200_C.ExecuteUbergraph_BP_ch0200 // (Final|UbergraphFunction) // @ game+0x1685580
};

