// UserDefinedStruct BP_en_Sky_TimeOfDayData.BP_en_Sky_TimeOfDayData
// Size: 0x90 (Inherited: 0x00)
struct FBP_en_Sky_TimeOfDayData {
	struct FLinearColor SkyUpperColor_36_F574B1FF4C660D607018378D4D29D5D8; // 0x00(0x10)
	struct FLinearColor SkyLowerColor_37_9AE60C56438D767F5189779E892918F6; // 0x10(0x10)
	struct FLinearColor CloudsUpperColor_38_427730AB4B57918C2621AC9E42481B18; // 0x20(0x10)
	struct FLinearColor CloudsLowerColor_39_8C51A73643E77F6D68DF0C9FB66307B7; // 0x30(0x10)
	struct FLinearColor CloudsSecondaryColor_53_DC9F541A4A5DF218D25F3BAEFD108CC9; // 0x40(0x10)
	struct FLinearColor CloudsBackground_40_C26ACFC54FD13F33D88102AE41FC8C47; // 0x50(0x10)
	struct FLinearColor SunColor_41_4127FF7441301541CCC14C97D84E54F5; // 0x60(0x10)
	struct FLinearColor MoonColor_42_A8304BE24B8F8E787E683A8FEA4D486C; // 0x70(0x10)
	struct FLinearColor StarsColor_43_5B3DF4A1431B005F9583B498B90E49FC; // 0x80(0x10)
};

