// UserDefinedStruct BP_en_Sky_WeatherData.BP_en_Sky_WeatherData
// Size: 0x64 (Inherited: 0x00)
struct FBP_en_Sky_WeatherData {
	float CloudsScale_6_46BD2FFD4101E62C58B396AE3DAA8046; // 0x00(0x04)
	float CloudsDensity_8_C959F15B494C31785AB9BDA43B1D7D13; // 0x04(0x04)
	float CloudsHarness_10_C035BB69421FE083D844959BBFE947D1; // 0x08(0x04)
	float CloudsTranslucent_18_6BF1A8914FAA8F67988B9DADC914CBC6; // 0x0c(0x04)
	float CloudsBlend_17_0B0902B849FFF532D0FA73AD750162A7; // 0x10(0x04)
	float CloudsDistotion_19_FF8260554CA3B701D6C62A87A392E3BA; // 0x14(0x04)
	float CloudsScattering_20_EA03A384445C04BBBC4EA2A3A28674D9; // 0x18(0x04)
	float CloudsUpperBrightness_47_80E6F59C44C0E63FF352E1ACA405DEAD; // 0x1c(0x04)
	float CloudsLowerBrightness_48_C275CDC444671D9809D344A043817F24; // 0x20(0x04)
	float CloudsAmbient_26_B3DE5189457AF2F2C9061DAE095629E4; // 0x24(0x04)
	float CloudsShadowSize_32_30070F544C29A5175B4905A3CAA43C9B; // 0x28(0x04)
	float CloudsShadowSoft_33_242397844998748E4CE442A82FABD76E; // 0x2c(0x04)
	float CloudsBackground_34_81AB1CD743507906283E26BC8179CD02; // 0x30(0x04)
	float CloudsHorizonDensity_35_A9DA12E04BD1ACCE877556A07AFC0A81; // 0x34(0x04)
	float CloudsHorizonAlpha_36_B5FE09604EE51B66C6109689DD26A633; // 0x38(0x04)
	float CloudsHorizonScattering_38_96C12A72485C8C653890E983ADECA031; // 0x3c(0x04)
	float HorizonFalloff_41_7ADEA15D4BAFCED09051BDAAB67D0E6E; // 0x40(0x04)
	float WindForceScale_42_494196B04350B9CE2B731E97799FE070; // 0x44(0x04)
	float WindDynamic_45_4BD5C5EC4B00477CD0BAC8857B6087F7; // 0x48(0x04)
	float WindDispersing_46_747C4F2B40612E5FE76792B0CB7C4E90; // 0x4c(0x04)
	float SkylightBrightness_52_D0DC0C2C48095A9468CA2A8ECC6B512B; // 0x50(0x04)
	float SecondLayerColor_71_16427994489B87788D8B02B67E7E863B; // 0x54(0x04)
	float SecondLayerAlpha_72_8759E297465AF80FD8856791526E7414; // 0x58(0x04)
	float SecondLayerScale_77_6F5F9AE84D7C8132AF2BD68DD7F5A018; // 0x5c(0x04)
	float SecondLayerWind_73_58F8ABAE4AE471692F3D53A832B70EC0; // 0x60(0x04)
};

