// BlueprintGeneratedClass BP_EnemyManager.BP_EnemyManager_C
// Size: 0x7e8 (Inherited: 0x4d8)
struct ABP_EnemyManager_C : AEnemyManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4d8(0x08)
	struct UBP_EnemyFixParam_C* BP_EnemyFixParam; // 0x4e0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x4e8(0x08)
	float EnableRange; // 0x4f0(0x04)
	float EnableSpawnRange; // 0x4f4(0x04)
	float EnableViewAngle; // 0x4f8(0x04)
	int32_t CheckEnemyIndex; // 0x4fc(0x04)
	enum class Enum_EnemySound enemySound; // 0x500(0x01)
	enum class Enum_EnemySound EnemySoundCheck; // 0x501(0x01)
	char pad_502[0x6]; // 0x502(0x06)
	struct TArray<struct ARSCharacterBase*> BrainCrashList_Old; // 0x508(0x10)
	struct TArray<struct AActor*> BattleEnemyList; // 0x518(0x10)
	bool IsStealthSee; // 0x528(0x01)
	char pad_529[0x7]; // 0x529(0x07)
	struct FMulticastInlineDelegate OnDeadDispatcher; // 0x530(0x10)
	struct FMulticastInlineDelegate GroupBattleStartDispatcher; // 0x540(0x10)
	struct TArray<struct UActorComponent*> TickEnableComponentArray; // 0x550(0x10)
	int32_t UpdateEnemyCount; // 0x560(0x04)
	int32_t EnemyCountMax; // 0x564(0x04)
	float CheckHeightDistance; // 0x568(0x04)
	int32_t DebugEnemyIndex; // 0x56c(0x04)
	struct FTransform ENPCTriggerTransform; // 0x570(0x30)
	struct FTransform ENPCSpAttackTransform; // 0x5a0(0x30)
	struct TMap<enum class HCSkillAttribute, struct FEnemyStateDataCell> BadStateParams; // 0x5d0(0x50)
	float MaxVisionFogRate; // 0x620(0x04)
	enum class EPlayerHitStopType CurrentHitStopType; // 0x624(0x01)
	char pad_625[0x3]; // 0x625(0x03)
	struct AActor* em8300Manager; // 0x628(0x08)
	bool IsCourtMort; // 0x630(0x01)
	char pad_631[0x7]; // 0x631(0x07)
	struct FMulticastInlineDelegate DebugUniqueEventDispatcher; // 0x638(0x10)
	struct TArray<struct FVisionFogAreaInfo> VisionFogAreaList; // 0x648(0x10)
	bool bVisionFogAction; // 0x658(0x01)
	char pad_659[0x3]; // 0x659(0x03)
	float NotAcceptVisionFogActionTimer; // 0x65c(0x04)
	struct TArray<struct FName> UniqueBrainCrashNotPlayedList; // 0x660(0x10)
	struct AActor* CoutMort_Actor; // 0x670(0x08)
	struct FMulticastInlineDelegate EndDuelPoleDispatcher; // 0x678(0x10)
	struct AActor* em1200_Actor; // 0x688(0x08)
	struct TArray<struct ARSBattleEnemy_C*> AreaCheckWaitList; // 0x690(0x10)
	struct FGameTimer AreaCheckTimer; // 0x6a0(0x0c)
	int32_t MaxEnemyMovingCountRate; // 0x6ac(0x04)
	struct FText DebugText; // 0x6b0(0x18)
	struct TMap<struct FName, struct FCopyCharacterParameterStruct> Backup ParameterList; // 0x6c8(0x50)
	float CheckOutRangeDistance; // 0x718(0x04)
	struct FName RepopOwnerNowLevel; // 0x71c(0x08)
	char pad_724[0x4]; // 0x724(0x04)
	struct AActor* RepopOwnerObj; // 0x728(0x08)
	int32_t NowLocationId; // 0x730(0x04)
	int32_t NowAreaId; // 0x734(0x04)
	struct TArray<struct ARSBattleEnemy_C*> GroundCheckWaitList; // 0x738(0x10)
	struct TArray<struct UBP_EnemyVisionFogComponent_C*> EndVisionFogCompList; // 0x748(0x10)
	bool bStartBattleEm8300; // 0x758(0x01)
	char pad_759[0x7]; // 0x759(0x07)
	struct TArray<struct AActor*> EntryAvatarList; // 0x760(0x10)
	int32_t MaxAvatarNum; // 0x770(0x04)
	char pad_774[0x4]; // 0x774(0x04)
	struct TMap<int32_t, bool> PreCheckOutOfBattleFieldGroupId; // 0x778(0x50)
	struct FName ActorLevelName; // 0x7c8(0x08)
	int32_t ActorLocationID; // 0x7d0(0x04)
	int32_t ActorAreaID; // 0x7d4(0x04)
	struct TArray<struct AActor*> PauseBrainCrashList; // 0x7d8(0x10)

	bool EventManagerEnd(bool RestoreEnableTick, bool RestoreVisibility); // Function BP_EnemyManager.BP_EnemyManager_C.EventManagerEnd // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EventManagerStart(bool EnableTick, bool Visibility); // Function BP_EnemyManager.BP_EnemyManager_C.EventManagerStart // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetBrainCrashDamageLocation(struct FVector WorldLocation); // Function BP_EnemyManager.BP_EnemyManager_C.GetBrainCrashDamageLocation // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CheckPauseBrainCrash(struct AActor* pauseActor); // Function BP_EnemyManager.BP_EnemyManager_C.CheckPauseBrainCrash // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
