// BlueprintGeneratedClass BP_EventRenderingOptionSimCasher.BP_EventRenderingOptionSimCasher_C
// Size: 0x2d8 (Inherited: 0x230)
struct ABP_EventRenderingOptionSimCasher_C : AActor {
	struct USceneComponent* DefaultSceneRoot; // 0x230(0x08)
	struct TArray<struct ASpotLight*> LC01SpotLights; // 0x238(0x10)
	struct TArray<struct ASpotLight*> LC10Komorebi; // 0x248(0x10)
	struct TArray<struct ABP_EffectBackground_C*> LC10KunadoGate; // 0x258(0x10)
	struct TArray<struct ABP_en_Light01_C*> LC17enLight; // 0x268(0x10)
	struct TArray<struct ARSBattleEnemy_C*> LC22em8310ShadowActors; // 0x278(0x10)
	struct TArray<struct UStaticMeshComponent*> LC22em8310ShadowHoldMeshes; // 0x288(0x10)
	struct TArray<struct ARSCharacterBase*> ShadowCharacters; // 0x298(0x10)
	struct TArray<struct ABP_MenuPlayerBase_C*> ShadowMenuPlayers; // 0x2a8(0x10)
	struct TArray<struct ABP_PostProcessController_C*> PPM8310Noise; // 0x2b8(0x10)
	struct TArray<struct AActor*> SelectShadowActors; // 0x2c8(0x10)
};

