// BlueprintGeneratedClass BP_EnemyFixParam.BP_EnemyFixParam_C
// Size: 0x18c (Inherited: 0x128)
struct UBP_EnemyFixParam_C : UEnemyFixParamComponentBase {
	float ChangeCrashHighRate; // 0x128(0x04)
	float CrashDamageTime; // 0x12c(0x04)
	float SensingHeight; // 0x130(0x04)
	float EnableMoveHeight; // 0x134(0x04)
	float AIActionHeight; // 0x138(0x04)
	float LaunchLMotionScale; // 0x13c(0x04)
	float ReactionSWeakCorrectionValue; // 0x140(0x04)
	float ReactionLWeakCorrectionValue; // 0x144(0x04)
	float DownWeakCorrectionValue; // 0x148(0x04)
	float BCChancePlayRate; // 0x14c(0x04)
	float DetectIcon_FindSeconds; // 0x150(0x04)
	float CrashWeakCorrectionValue; // 0x154(0x04)
	float RouteReactionSBonus; // 0x158(0x04)
	float RouteReactionLBonus; // 0x15c(0x04)
	float RouteDownBonus; // 0x160(0x04)
	float DownCrashBonus; // 0x164(0x04)
	float TickPriority_RangeTop; // 0x168(0x04)
	float TickPriority_RangeMiddle; // 0x16c(0x04)
	float TickPriority_HeightTop; // 0x170(0x04)
	float TickPriority_IntervalTop; // 0x174(0x04)
	float TickPriority_LimitTop; // 0x178(0x04)
	float TickPriority_IntervalMiddle; // 0x17c(0x04)
	float TickPriority_LimitMiddle; // 0x180(0x04)
	float TickPriority_IntervalBottom; // 0x184(0x04)
	float TickPriority_LimitBottom; // 0x188(0x04)
};

