// BlueprintGeneratedClass BP_EventManager.BP_EventManager_C
// Size: 0x2cfd (Inherited: 0x330)
struct ABP_EventManager_C : AEventManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x330(0x08)
	struct UBPC_OptimizeSwitchMaterialPlayer_C* BPC_OptimizeSwitchMaterialStaticFace; // 0x338(0x08)
	struct URSFrameGrabberComponent* RSFrameGrabberToStatic; // 0x340(0x08)
	struct URSFrameGrabberComponent* RSFrameGrabberToDynamic; // 0x348(0x08)
	struct URSSceneCaptureComponent2D* SeamlessCaptureComponent2D; // 0x350(0x08)
	struct UBPC_EventBindingPlayers_C* BPC_EventBindingPlayers; // 0x358(0x08)
	struct URSSceneCaptureComponent2D* StaticCutSceneCapture; // 0x360(0x08)
	struct UBP_EventAssetPoolComponent_C* BP_EventAssetPoolComponent; // 0x368(0x08)
	struct UDirectionalLightComponent* CaptureDirectionalLightComp; // 0x370(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x378(0x08)
	float DynamicToInGameInterp_Interp_CE5F0FB44F167C0C66498F890F64A58A; // 0x380(0x04)
	enum class ETimelineDirection DynamicToInGameInterp__Direction_CE5F0FB44F167C0C66498F890F64A58A; // 0x384(0x01)
	char pad_385[0x3]; // 0x385(0x03)
	struct UTimelineComponent* DynamicToInGameInterp; // 0x388(0x08)
	float BGScreenFadeTimeline_Alpha_C3870689477E87E3CCC458AA92AEB318; // 0x390(0x04)
	enum class ETimelineDirection BGScreenFadeTimeline__Direction_C3870689477E87E3CCC458AA92AEB318; // 0x394(0x01)
	char pad_395[0x3]; // 0x395(0x03)
	struct UTimelineComponent* BGScreenFadeTimeline; // 0x398(0x08)
	float StopStreamPPTimeline_Track_8062AEA34AD8F2E88D0C1BBA12F24C12; // 0x3a0(0x04)
	enum class ETimelineDirection StopStreamPPTimeline__Direction_8062AEA34AD8F2E88D0C1BBA12F24C12; // 0x3a4(0x01)
	char pad_3A5[0x3]; // 0x3a5(0x03)
	struct UTimelineComponent* StopStreamPPTimeline; // 0x3a8(0x08)
	float PPMMoveBlurTimeline_Rate_9E44A655488D3CA7FA5FE0AC19441E01; // 0x3b0(0x04)
	enum class ETimelineDirection PPMMoveBlurTimeline__Direction_9E44A655488D3CA7FA5FE0AC19441E01; // 0x3b4(0x01)
	char pad_3B5[0x3]; // 0x3b5(0x03)
	struct UTimelineComponent* PPMMoveBlurTimeline; // 0x3b8(0x08)
	float TransitionStaticToInGameTimeline_Track_98F59090477C1504072378B2FFFCF5A0; // 0x3c0(0x04)
	enum class ETimelineDirection TransitionStaticToInGameTimeline__Direction_98F59090477C1504072378B2FFFCF5A0; // 0x3c4(0x01)
	char pad_3C5[0x3]; // 0x3c5(0x03)
	struct UTimelineComponent* TransitionStaticToInGameTimeline; // 0x3c8(0x08)
	struct FMulticastInlineDelegate ED_Finish; // 0x3d0(0x10)
	struct FMulticastInlineDelegate ED_PlayStart; // 0x3e0(0x10)
	struct UUserWidget* BGScreenWidget; // 0x3f0(0x08)
	enum class EEventType EventType; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct TArray<struct APostProcessVolume*> RestorePPV; // 0x400(0x10)
	struct TArray<struct ABPCaptureActor_C*> CaptureActorList; // 0x410(0x10)
	struct UREDLuaScriptComponent* REDLuaScriptComponent; // 0x420(0x08)
	struct ACineCameraActor* CineCameraActor; // 0x428(0x08)
	int32_t PlayerHiddenFlag; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct TArray<struct ABPSpecialCaptureActor_C*> SpecialCaptureActorList; // 0x438(0x10)
	struct AActor* SpecialStaticNodeActor; // 0x448(0x08)
	struct TArray<struct AActor*> EventActorList; // 0x450(0x10)
	struct UMaterialInstanceDynamic* MoveBlurMaterial; // 0x460(0x08)
	struct UPostProcessComponent* PostProcess; // 0x468(0x08)
	struct FPostProcessSettings DefaultSpecialCaptureActorPPSetting; // 0x470(0x780)
	struct ABP_CaptureBG_C* CaptureBG; // 0xbf0(0x08)
	bool IsRunLua; // 0xbf8(0x01)
	char pad_BF9[0x7]; // 0xbf9(0x07)
	struct FPostProcessSettings DefaultBGCaptureActorPPSetting; // 0xc00(0x780)
	struct TArray<struct FTransform> LastSpecialCaptureCameraTransform; // 0x1380(0x10)
	struct TArray<struct FTransform> LastSpecialCapturePlayerTransform; // 0x1390(0x10)
	int32_t StaticToInGameFinalSpecialIndex; // 0x13a0(0x04)
	struct FVector StaticToInGameCameraLocation; // 0x13a4(0x0c)
	struct FTransform StaticToInGameBeforeCameraTransform; // 0x13b0(0x30)
	struct FTransform StaticToInGamePlayerTransform; // 0x13e0(0x30)
	bool UseStaticToInGameCameraLocation; // 0x1410(0x01)
	bool UseStaticToInGamePlayerTransform; // 0x1411(0x01)
	char pad_1412[0x6]; // 0x1412(0x06)
	struct ACameraActor* StaticToInGameCamera; // 0x1418(0x08)
	bool UseStaticToInGame; // 0x1420(0x01)
	char pad_1421[0xf]; // 0x1421(0x0f)
	struct FTransform TransitionStartCameraTransform; // 0x1430(0x30)
	float TransitionStartCameraFOV; // 0x1460(0x04)
	char pad_1464[0x4]; // 0x1464(0x04)
	struct UDataTable* LightDataTable; // 0x1468(0x08)
	struct ABP_EventSettings_C* EventSettings; // 0x1470(0x08)
	struct AActor* CaptureSkyMesh; // 0x1478(0x08)
	struct AActor* StaticEventSkyMesh; // 0x1480(0x08)
	float AxisRightX; // 0x1488(0x04)
	float AxisRightY; // 0x148c(0x04)
	float MaxRotate; // 0x1490(0x04)
	float CameraDistance; // 0x1494(0x04)
	bool lua; // 0x1498(0x01)
	char pad_1499[0x7]; // 0x1499(0x07)
	struct TSoftClassPtr<UObject> BGScreenWidgetClassAsset; // 0x14a0(0x28)
	struct UUserWidget* BGScreenWidgetClassObject; // 0x14c8(0x08)
	struct TSoftClassPtr<UObject> BossNameWidgetClassAsset; // 0x14d0(0x28)
	struct TSoftClassPtr<UObject> CharaNameWidgetClassAsset; // 0x14f8(0x28)
	struct TSoftObjectPtr<UParticleSystem> StaticCutBGParticleAsset; // 0x1520(0x28)
	struct UUserWidget* BossNameWidgetClassObject; // 0x1548(0x08)
	struct UUserWidget* CharaNameWidgetClassObject; // 0x1550(0x08)
	struct UParticleSystem* StaticCutBGParticleObject; // 0x1558(0x08)
	struct TSoftObjectPtr<UStaticMesh> StaticCapSkyAsset; // 0x1560(0x28)
	struct UStaticMesh* StaticCapSkyObject; // 0x1588(0x08)
	struct TSoftObjectPtr<UTexture2D> VignetteMaskDefaultTextureAsset; // 0x1590(0x28)
	struct UTexture2D* VignetteMaskDefualtTextureObject; // 0x15b8(0x08)
	struct TSoftObjectPtr<UTexture2D> GlitchDefaultTextureAsset; // 0x15c0(0x28)
	struct TSoftClassPtr<UObject> BP_StaticSkyClassAsset; // 0x15e8(0x28)
	struct UTexture2D* GlitchDefualtTextureObject; // 0x1610(0x08)
	struct AActor* BP_StaticSkyClass; // 0x1618(0x08)
	struct TSoftClassPtr<UObject> BPFaceCapSkyClassAsset; // 0x1620(0x28)
	struct TSoftClassPtr<UObject> BP_SpecialStaticNodeActorClassAsset; // 0x1648(0x28)
	struct AActor* BPFaceCapSkyClass; // 0x1670(0x08)
	struct AActor* BP_SpecialStaticNodeActorClass; // 0x1678(0x08)
	struct TSoftObjectPtr<UAnimSequence> AS_ec9999_001_Default_Asset; // 0x1680(0x28)
	struct UAnimSequence* AS_ec9999_001_Default_Object; // 0x16a8(0x08)
	struct TSoftObjectPtr<UMaterialInterface> SepiaMaterialAsset; // 0x16b0(0x28)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMScreenLightAsset; // 0x16d8(0x28)
	struct TSoftObjectPtr<UMaterialInterface> MonoMaterialAsset; // 0x1700(0x28)
	struct TSoftObjectPtr<UMaterialInterface> VignetteMaterialAsset; // 0x1728(0x28)
	struct TSoftObjectPtr<UMaterialInterface> GlitchMaterialAsset; // 0x1750(0x28)
	struct TSoftObjectPtr<UMaterialInterface> LinearToSRGBMaterialAsset; // 0x1778(0x28)
	struct TArray<struct ABP_RedStringMeshSpawner_C*> RedStringsList; // 0x17a0(0x10)
	int32_t CurrentRedStringIndex; // 0x17b0(0x04)
	int32_t MaxRedString; // 0x17b4(0x04)
	enum class EStaticEventType StaticEventType; // 0x17b8(0x01)
	char pad_17B9[0x7]; // 0x17b9(0x07)
	struct TArray<struct ABP_ShowDestinationActor_C*> ArrayShowDestinationActor; // 0x17c0(0x10)
	struct FMulticastInlineDelegate OnChangeDestinationActor; // 0x17d0(0x10)
	struct TSoftObjectPtr<UMaterialInterface> MoveBlurMaterialAsset; // 0x17e0(0x28)
	struct UMaterialInterface* MoveBlurMaterialObject; // 0x1808(0x08)
	struct UDataTable* CaptureDataTable; // 0x1810(0x08)
	struct TMap<struct FName, struct USkeletalMesh*> CaptureDataTableCharaMeshObject; // 0x1818(0x50)
	struct UDataTable* TextureDataTable; // 0x1868(0x08)
	struct TMap<struct FName, struct UTexture*> TextureDataTableTextureObject; // 0x1870(0x50)
	struct TMap<struct FName, struct UManaTexture*> MovieTextureDataTableMovieTextureObject; // 0x18c0(0x50)
	struct UDataTable* MovieTextureDataTable; // 0x1910(0x08)
	struct UUserWidget* BossNameWidget; // 0x1918(0x08)
	struct UUserWidget* CharaNameWidget; // 0x1920(0x08)
	bool UseStaticToInGameBeforeCameraTransform; // 0x1928(0x01)
	char pad_1929[0x3]; // 0x1929(0x03)
	float StaticToInGameBeforeCameraFOV; // 0x192c(0x04)
	struct ABP_CaptureCineCameraActor_C* CutSceneSequencerCamera; // 0x1930(0x08)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMAcceleratorAsset; // 0x1938(0x28)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMSeeThroughAsset; // 0x1960(0x28)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMVisionFogAsset; // 0x1988(0x28)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMRadialBlurAsset; // 0x19b0(0x28)
	struct ABP_SC_BG_C* BP_SC_BG; // 0x19d8(0x08)
	struct FMulticastInlineDelegate EventBoardParamCurveTimeline; // 0x19e0(0x10)
	struct UTextureRenderTarget2D* SavedRenderTarget; // 0x19f0(0x08)
	bool IsFinishSequencer; // 0x19f8(0x01)
	char pad_19F9[0x7]; // 0x19f9(0x07)
	struct TArray<struct FFRenderTargetData> FaceRenderTargetList; // 0x1a00(0x10)
	struct TArray<struct FFRenderTargetData> SequencerRenderTargetList; // 0x1a10(0x10)
	struct FFRenderTargetData CrossFadeFaceRT; // 0x1a20(0x18)
	struct FFRenderTargetData CrossFadeSeqRT; // 0x1a38(0x18)
	struct TArray<bool> ActiveCapturePPMs; // 0x1a50(0x10)
	struct FTransform CameraActorLocation; // 0x1a60(0x30)
	struct UCameraComponent* NewVar_4; // 0x1a90(0x08)
	bool StoreIsBlendCamera; // 0x1a98(0x01)
	char pad_1A99[0x3]; // 0x1a99(0x03)
	int32_t CurrentCaptureActorIndex; // 0x1a9c(0x04)
	bool IsSpeak; // 0x1aa0(0x01)
	char pad_1AA1[0x7]; // 0x1aa1(0x07)
	struct UDataTable* ShowDestinationData; // 0x1aa8(0x08)
	struct TArray<struct ABP_NewStaticNodeActor_C*> NewStaticActorList; // 0x1ab0(0x10)
	struct ABP_NewStaticNodeActor_C* CurrentNewStaticNode; // 0x1ac0(0x08)
	struct ABP_NewStaticNodeActor_C* BeforeNewStaticNode; // 0x1ac8(0x08)
	struct FFEventInitSettingData CurrentEventSettingData; // 0x1ad0(0x06)
	char pad_1AD6[0x2]; // 0x1ad6(0x02)
	struct ARSLevelSequenceActor* PostProcessSequencer; // 0x1ad8(0x08)
	int32_t CurrentSpeakerActorIndex; // 0x1ae0(0x04)
	char pad_1AE4[0x4]; // 0x1ae4(0x04)
	struct TArray<struct ABPCaptureActor_C*> EveryFrameCaptureActorList; // 0x1ae8(0x10)
	struct UDataTable* CapCharaBGDataTable; // 0x1af8(0x08)
	struct TArray<struct FFCapCharaBGData> LeftCharaBGDataList; // 0x1b00(0x10)
	struct TArray<struct FFCapCharaBGData> RightCharaBGDataList; // 0x1b10(0x10)
	struct TArray<struct FFCapCharaBGData> CenterCharaBGDataList; // 0x1b20(0x10)
	struct FMovieSceneObjectBindingID CameraBindingID; // 0x1b30(0x18)
	struct UShowDestinationDBAsset* ShowDestinationDB; // 0x1b48(0x08)
	struct FMulticastInlineDelegate OnBeforeChangeProgressID; // 0x1b50(0x10)
	struct FMulticastInlineDelegate OnAfterChangeProgressID; // 0x1b60(0x10)
	bool IsDynamicSeamlessInGame; // 0x1b70(0x01)
	char pad_1B71[0x7]; // 0x1b71(0x07)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMScreenMask; // 0x1b78(0x28)
	struct TSoftObjectPtr<UMaterialInstance> SoftFocusMaterialAsset; // 0x1ba0(0x28)
	struct TSoftObjectPtr<UMaterialInstance> HeartBeatMaterialAsset; // 0x1bc8(0x28)
	bool UseSequencerStaticToInGame; // 0x1bf0(0x01)
	char pad_1BF1[0x3]; // 0x1bf1(0x03)
	int32_t InGameCapActorIndex; // 0x1bf4(0x04)
	float SoundPressureThreshold; // 0x1bf8(0x04)
	char pad_1BFC[0x4]; // 0x1bfc(0x04)
	struct TSoftObjectPtr<UMaterialInstance> AlphaMovieMaterialAsset; // 0x1c00(0x28)
	struct TSoftObjectPtr<UMaterialInstance> DiffusionMaterialAsset; // 0x1c28(0x28)
	struct TArray<struct FFEventCaptureFuncData> SequenceCaptureFuncList; // 0x1c50(0x10)
	struct TArray<struct AActor*> RegistPsychicObjectList; // 0x1c60(0x10)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMFishEyeAsset; // 0x1c70(0x28)
	bool IsCallOnSequencerFinished; // 0x1c98(0x01)
	char pad_1C99[0x7]; // 0x1c99(0x07)
	struct ARSLevelSequenceActor* PresentSequencer; // 0x1ca0(0x08)
	struct TArray<struct FPostProcessSettings> CaptureAddPPS; // 0x1ca8(0x10)
	struct TArray<int32_t> CaptureAddPPSHandle; // 0x1cb8(0x10)
	int32_t CaptureAddPPSHandleIndex; // 0x1cc8(0x04)
	char pad_1CCC[0x4]; // 0x1ccc(0x04)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMScreenMaskAfterDOF; // 0x1cd0(0x28)
	struct TArray<struct ABP_Event3DWidgetActor_C*> 3DWidgetList; // 0x1cf8(0x10)
	struct UWB_ui_BrainMes_C* WB_ui_BrainMes; // 0x1d08(0x08)
	struct UUserWidget* WB_UI_BrainMesClass; // 0x1d10(0x08)
	struct TSoftClassPtr<UObject> WBUIBrainMesSoftClass; // 0x1d18(0x28)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMGradScreenMask; // 0x1d40(0x28)
	struct TSoftObjectPtr<UMaterialInterface> CapturePPMGradScreenMaskAfterDOF; // 0x1d68(0x28)
	struct TSoftObjectPtr<UMaterialInterface> KaiiFilterMaterialAsset; // 0x1d90(0x28)
	bool IsCalledStartBlendPlayerCamera; // 0x1db8(0x01)
	char pad_1DB9[0x7]; // 0x1db9(0x07)
	struct ABP_CaptureCineCameraActor_C* CutSceneSequencerBlendCamera; // 0x1dc0(0x08)
	struct ABP_ActorVisibleChangeBase_C* _ActorVisibleChange; // 0x1dc8(0x08)
	struct TSoftObjectPtr<UMaterialInstance> BothSideLimMaterialAsset; // 0x1dd0(0x28)
	struct FGameTimer PlayObstructActionTimer; // 0x1df8(0x0c)
	int32_t ObstructActionCount; // 0x1e04(0x04)
	bool IsStartCameraCutDynamic; // 0x1e08(0x01)
	bool IsValidMessageVoice; // 0x1e09(0x01)
	char pad_1E0A[0x6]; // 0x1e0a(0x06)
	struct TArray<struct TSoftObjectPtr<UMaterialInstance>> LightUpMaterialAsset; // 0x1e10(0x10)
	struct TSoftObjectPtr<UMaterialInstance> FuturePredictionMaterialAsset; // 0x1e20(0x28)
	bool IsResetNewStaticNode; // 0x1e48(0x01)
	char pad_1E49[0x7]; // 0x1e49(0x07)
	struct FTransform CameraSocketTransform; // 0x1e50(0x30)
	struct TArray<struct TSoftObjectPtr<UMaterialInstance>> FieldBlurMaterialAsset; // 0x1e80(0x10)
	struct TSoftObjectPtr<UMaterialInstance> LightShaftMaterialAsset; // 0x1e90(0x28)
	struct TSoftObjectPtr<UMaterialInstance> OutlineAfterimageMaterialAsset; // 0x1eb8(0x28)
	struct FPostProcessSettings DynamicSequencerCameraPPS; // 0x1ee0(0x780)
	struct UMaterialInterface* LinearToSRGBMaterial; // 0x2660(0x08)
	struct TArray<struct FFEventTriggerCommandData> EventTriggerCommandDataArray; // 0x2668(0x10)
	struct TSoftObjectPtr<UMaterialInstance> ShadowmapMaterialAsset; // 0x2678(0x28)
	struct TArray<struct ARSCharacterBase*> BindEnemyList; // 0x26a0(0x10)
	struct TSoftObjectPtr<UMaterialInstance> StreamMaterialAsset; // 0x26b0(0x28)
	int32_t PostProcessSeqFrameDuration; // 0x26d8(0x04)
	char pad_26DC[0x4]; // 0x26dc(0x04)
	struct UDataTable* ShaderMontageDataTable; // 0x26e0(0x08)
	struct UDataTable* EventPlAttachAssetDataTable; // 0x26e8(0x08)
	struct UDataTable* ForceBTCameraTable; // 0x26f0(0x08)
	struct UDataTable* RipSyncCharaTable; // 0x26f8(0x08)
	float DynamicSequencerCameraDoFFstop; // 0x2700(0x04)
	bool DynamicSequencerCameraDoFFstopOverride; // 0x2704(0x01)
	char pad_2705[0x3]; // 0x2705(0x03)
	struct TArray<struct AActor*> DynamicSpawnableActors; // 0x2708(0x10)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignACBeatAsset; // 0x2718(0x28)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignBeardingAsset; // 0x2740(0x28)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignDotCrawAsset; // 0x2768(0x28)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignDropoutAsset; // 0x2790(0x28)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignGhostingAsset; // 0x27b8(0x28)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignStrobingAsset; // 0x27e0(0x28)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignTapeDistortionAsset; // 0x2808(0x28)
	struct TSoftObjectPtr<UMaterialInstance> REDStringsSignYIQManipulationAsset; // 0x2830(0x28)
	bool DebugCaptureRetry; // 0x2858(0x01)
	bool DebugCaptureRetryOneSkip; // 0x2859(0x01)
	char pad_285A[0x6]; // 0x285a(0x06)
	struct ABP_EventPPStream_C* EventPPStream; // 0x2860(0x08)
	int32_t GeneralParticleHandle; // 0x2868(0x04)
	char pad_286C[0x4]; // 0x286c(0x04)
	struct TArray<struct ASequencerParticle*> GeneralParticle1; // 0x2870(0x10)
	struct TArray<struct ASequencerParticle*> GeneralParticle2; // 0x2880(0x10)
	struct TArray<struct ASequencerParticle*> GeneralParticle3; // 0x2890(0x10)
	struct TArray<bool> GeneralParticleActive; // 0x28a0(0x10)
	enum class EEventType PreviousEventType; // 0x28b0(0x01)
	char pad_28B1[0x7]; // 0x28b1(0x07)
	struct ABP_CaptureCineCameraActor_C* InGameCineCameraActor; // 0x28b8(0x08)
	struct ABP_EventPostUpdateTask_C* PostUpdateWork; // 0x28c0(0x08)
	bool DebugDisableUsePrestreamTextures; // 0x28c8(0x01)
	char pad_28C9[0x7]; // 0x28c9(0x07)
	struct TSoftObjectPtr<UMaterialInstance> KarenMemoryMaterialAsset; // 0x28d0(0x28)
	bool DebugDisableTAAStaticGeneral; // 0x28f8(0x01)
	char pad_28F9[0x7]; // 0x28f9(0x07)
	struct FTimerHandle PadVibrationTimer; // 0x2900(0x08)
	struct UPostProcessComponent* PPCDynamicToInGameInterp; // 0x2908(0x08)
	bool DebugDisableMaterialOptimize; // 0x2910(0x01)
	bool IsEventENPCBattleReady; // 0x2911(0x01)
	char pad_2912[0x2]; // 0x2912(0x02)
	float PhaseAnimSkipSpeed; // 0x2914(0x04)
	struct TArray<struct TSoftObjectPtr<UMaterialInstance>> SoftFocusMaterialAssetList; // 0x2918(0x10)
	struct TSoftObjectPtr<UMaterialInterface> REDStringsSignTapeDistortionVerticalAsset; // 0x2928(0x28)
	struct TMap<struct URSAtomComponentBase*, struct FName> MessageVoiceRipSyncInfoList; // 0x2950(0x50)
	struct TArray<struct FFEventTriggerCommandData> StartWaitingHPCheckEventCommandList; // 0x29a0(0x10)
	bool UIUnlockFlag; // 0x29b0(0x01)
	char pad_29B1[0x7]; // 0x29b1(0x07)
	struct AActor* CreditEventManager; // 0x29b8(0x08)
	struct TArray<struct UMaterialInterface*> CaptureExcludePPM; // 0x29c0(0x10)
	struct TArray<int32_t> CaptureExcludePPMHandle; // 0x29d0(0x10)
	struct TMap<struct ARSCharacterBase*, int32_t> OptCustomStencilCachesPlayer; // 0x29e0(0x50)
	struct TMap<struct ABP_WeaponBase_C*, int32_t> OptCustomStencilCachesWeapon; // 0x2a30(0x50)
	struct TMap<struct FString, struct UObject*> LoadMakeEventList; // 0x2a80(0x50)
	bool IsLoadingMakeEvent; // 0x2ad0(0x01)
	char pad_2AD1[0x7]; // 0x2ad1(0x07)
	struct TArray<struct FString> LoadingMakeEventPathList; // 0x2ad8(0x10)
	struct FMulticastInlineDelegate OnStartCutScene; // 0x2ae8(0x10)
	struct FMulticastInlineDelegate OnEndCutScene; // 0x2af8(0x10)
	struct TArray<struct AActor*> SpawndMeshList; // 0x2b08(0x10)
	bool EventCommandWeaponVisibility; // 0x2b18(0x01)
	bool DebugCaptureLog; // 0x2b19(0x01)
	bool DebugDisableFrameDrop; // 0x2b1a(0x01)
	bool IsPlControl; // 0x2b1b(0x01)
	char pad_2B1C[0x4]; // 0x2b1c(0x04)
	struct TArray<struct ARSCharacterBase*> NoBindingInGamePlayers; // 0x2b20(0x10)
	bool bEventEndAreaChangeWarp; // 0x2b30(0x01)
	char pad_2B31[0x7]; // 0x2b31(0x07)
	struct USkeletalMesh* Store1_1PlMesh; // 0x2b38(0x08)
	struct USkeletalMesh* Store16_9PlMesh; // 0x2b40(0x08)
	bool PauseFlag; // 0x2b48(0x01)
	char pad_2B49[0x7]; // 0x2b49(0x07)
	struct UDataTable* SkipENPCCameraTable; // 0x2b50(0x08)
	float CameraInterpSpeed; // 0x2b58(0x04)
	float CurrentAxiaRightX; // 0x2b5c(0x04)
	float CurrentAxisRightY; // 0x2b60(0x04)
	float EaseInOutInterpSpeed; // 0x2b64(0x04)
	float EaseInOutExp; // 0x2b68(0x04)
	bool IsEaseInOutRotate; // 0x2b6c(0x01)
	char pad_2B6D[0x3]; // 0x2b6d(0x03)
	struct UStaticCameraControlDataParam* DA_STCameraControlParam; // 0x2b70(0x08)
	enum class EOptionCameraPitch OptionCameraPitch; // 0x2b78(0x01)
	enum class EOptionCameraYaw OptionCameraYaw; // 0x2b79(0x01)
	char pad_2B7A[0x6]; // 0x2b7a(0x06)
	struct TArray<struct USoundAtomCue*> PhaseAnimSEList; // 0x2b80(0x10)
	float NoRipSyncSDPressureTime; // 0x2b90(0x04)
	float NoSDPressureTimeThreshold; // 0x2b94(0x04)
	bool EventHiddenNeonWire; // 0x2b98(0x01)
	char pad_2B99[0x3]; // 0x2b99(0x03)
	int32_t StaticHighResDelay; // 0x2b9c(0x04)
	struct TArray<struct ASkeletalMeshActor*> StaticGhostTrailCacheActor; // 0x2ba0(0x10)
	int32_t StaticGhostTrailCacheID; // 0x2bb0(0x04)
	char pad_2BB4[0x4]; // 0x2bb4(0x04)
	struct TArray<struct USkeletalMeshComponent*> StaticGhostTrailCacheMeshComps; // 0x2bb8(0x10)
	struct TArray<struct UPoseableMeshComponent*> StaticGhostTrailCachePosableMeshComps; // 0x2bc8(0x10)
	struct TArray<struct UPoseableMeshComponent*> StaticGhostTrailCachePosableMeshComps2; // 0x2bd8(0x10)
	int32_t StaticGhostTrailCachePoseableLayer; // 0x2be8(0x04)
	bool CrossFadePreparationRequired; // 0x2bec(0x01)
	char pad_2BED[0x3]; // 0x2bed(0x03)
	struct ABP_NameWidgetActor_C* NameWidgetActor; // 0x2bf0(0x08)
	bool IsFindPlayerFacial; // 0x2bf8(0x01)
	char pad_2BF9[0x7]; // 0x2bf9(0x07)
	struct TArray<struct FFEventHiddenActorForTagNameData> HiddenActorForTagNameDataList; // 0x2c00(0x10)
	struct FMulticastInlineDelegate DispatchHiddenSetoMask; // 0x2c10(0x10)
	bool SetSaveSequencerCharaTransform; // 0x2c20(0x01)
	bool SetSaveSequencerCameraTransform; // 0x2c21(0x01)
	char pad_2C22[0x6]; // 0x2c22(0x06)
	struct TArray<struct FTransform> CacheSaveSequencerCharaTransformPlayer; // 0x2c28(0x10)
	struct TArray<struct FTransform> CacheSaveSequencerCharaTransformEnemy; // 0x2c38(0x10)
	char pad_2C48[0x8]; // 0x2c48(0x08)
	struct FTransform CacheSaveSequencerCameraTransform; // 0x2c50(0x30)
	struct TMap<struct FName, struct FEventCacheActorHiddenInGame> ActorHiddenInGameFromTagNameCache; // 0x2c80(0x50)
	bool IsCalledSetupStaticScene; // 0x2cd0(0x01)
	char pad_2CD1[0x7]; // 0x2cd1(0x07)
	struct TArray<bool> EventPlayerDefaultCostume; // 0x2cd8(0x10)
	struct TArray<bool> EventPlayerNoAttachments; // 0x2ce8(0x10)
	bool IsNoStopMoviePhaseChange; // 0x2cf8(0x01)
	bool DisableStaticCameraControl; // 0x2cf9(0x01)
	bool IsCalledStartStaticEvent; // 0x2cfa(0x01)
	bool IsCalledStartCameraCutDynamic; // 0x2cfb(0x01)
	bool NoAddEventTriggerCmdFlag; // 0x2cfc(0x01)

	void GetEventTriggerCommendNum(enum class EEventTriggerCheckType CheckType, int32_t count); // Function BP_EventManager.BP_EventManager_C.GetEventTriggerCommendNum // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IsEventPause(bool IsPause); // Function BP_EventManager.BP_EventManager_C.IsEventPause // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetProgressID(int32_t ProgressId); // Function BP_EventManager.BP_EventManager_C.GetProgressID // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsValidEventCommand(); // Function BP_EventManager.BP_EventManager_C.IsValidEventCommand // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
