// BlueprintGeneratedClass BP_LevelManager.BP_LevelManager_C
// Size: 0x538 (Inherited: 0x250)
struct ABP_LevelManager_C : ALevelManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x250(0x08)
	struct UBP_LoadCommandComponent_C* LoadCommandComponent; // 0x258(0x08)
	struct UBP_LevelCommandComponent_C* LevelCommandComponent; // 0x260(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x268(0x08)
	int32_t MaxInfoAreaNum; // 0x270(0x04)
	struct FName CurrentAreaName; // 0x274(0x08)
	enum class E_LevelManagerStatus LevelManagerStatus; // 0x27c(0x01)
	char pad_27D[0x3]; // 0x27d(0x03)
	struct FName OldAreaName; // 0x280(0x08)
	struct TMap<struct FName, struct FS_AreaInfo> LoadedAreaInfos; // 0x288(0x50)
	struct TArray<struct FS_LevelManagerCommand> CommandQueue; // 0x2d8(0x10)
	struct FS_LevelManagerCommand CurrentCommand; // 0x2e8(0x48)
	struct TArray<struct FPrimaryAssetType> LoadedPacks; // 0x330(0x10)
	struct FMulticastInlineDelegate EventFinishWaitAreaVisibleDispatcher; // 0x340(0x10)
	struct FMulticastInlineDelegate EventFinishWaitAreaUnvisibleDispatcher; // 0x350(0x10)
	struct TArray<struct TSoftObjectPtr<UObject>> LoadedLevels; // 0x360(0x10)
	struct TArray<struct FS_LoadedLevelInfo> LoadedLevelInfo; // 0x370(0x10)
	struct TArray<struct FS_LoadedLevelInfo> OldLoadedLevelInfo; // 0x380(0x10)
	struct TMap<struct FName, struct FName> LoadedCameraType; // 0x390(0x50)
	struct FMulticastInlineDelegate EventFinishLoadAssetAsync; // 0x3e0(0x10)
	struct TMap<struct FName, struct FRSStreamingSettings> StreamingSettingsMap; // 0x3f0(0x50)
	struct FName CurrentStreamingSettingsName; // 0x440(0x08)
	bool bTextureStreaming; // 0x448(0x01)
	char pad_449[0x7]; // 0x449(0x07)
	struct TMap<struct FName, struct FS_AreaInfo> LocalAreaInfo; // 0x450(0x50)
	struct FMulticastInlineDelegate OnStartCheckLevelVisible; // 0x4a0(0x10)
	struct FMulticastInlineDelegate OnEndCheckLevelVisible; // 0x4b0(0x10)
	int32_t DebugSyncUnloadIndex; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct TMap<struct FName, struct FS_AreaInfo> AreaSettingsCache; // 0x4c8(0x50)
	bool IsAreaSettingsCacheDirty; // 0x518(0x01)
	enum class EPlayerCameraPreset CurrentCameraPreset; // 0x519(0x01)
	bool IsNoAreaSelectVariationFunction; // 0x51a(0x01)
	char pad_51B[0x5]; // 0x51b(0x05)
	struct TArray<struct FS_LoadedLevelInfo> StoreSubQuestNpcLevelList; // 0x520(0x10)
	struct FName CurrentSimulatorLevelInfosName; // 0x530(0x08)

	void AreaNameToID(struct FName AreaName, int32_t LocationId, int32_t areaId, int32_t VariationID); // Function BP_LevelManager.BP_LevelManager_C.AreaNameToID // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void RequestUnloadUnneedLevels(struct FName UnloadAreaName, struct FName NextAreaName); // Function BP_LevelManager.BP_LevelManager_C.RequestUnloadUnneedLevels // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsNeedFrameWait(); // Function BP_LevelManager.BP_LevelManager_C.IsNeedFrameWait // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void RestoreVisibleEventSubQuestNPCLevel(); // Function BP_LevelManager.BP_LevelManager_C.RestoreVisibleEventSubQuestNPCLevel // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
