// BlueprintGeneratedClass BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C
// Size: 0x928 (Inherited: 0x620)
struct ABP_MapGimmickObjectBase_C : AMapGimmickObject {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x620(0x08)
	struct UBP_UniqueEffectComponent_C* BP_UniqueEffectComponent; // 0x628(0x08)
	float FadeOutline_Fade_4326C6A042BDA8526C02688141850BEB; // 0x630(0x04)
	enum class ETimelineDirection FadeOutline__Direction_4326C6A042BDA8526C02688141850BEB; // 0x634(0x01)
	char pad_635[0x3]; // 0x635(0x03)
	struct UTimelineComponent* FadeOutline; // 0x638(0x08)
	float SearchDistanceMin; // 0x640(0x04)
	char pad_644[0x4]; // 0x644(0x04)
	struct UWB_ui_Action_Sas_C* Icon; // 0x648(0x08)
	struct ABP_EventCameraRoot_C* SeqUniqueRoot; // 0x650(0x08)
	struct ABP_EventCameraRoot_C* SeqUniqueCameraRoot; // 0x658(0x08)
	struct ABP_EventCameraRoot_C* SeqUniquePlayerRoot; // 0x660(0x08)
	struct AHUDMainGame_C* HudMain; // 0x668(0x08)
	enum class enum_ui_pk_weight_gauge_button GaugeButtonType; // 0x670(0x01)
	enum class enum_ui_pk_weight_gauge_size GaugeIconSize; // 0x671(0x01)
	char pad_672[0x6]; // 0x672(0x06)
	struct ACineCameraActor* SeqUniqueCamera; // 0x678(0x08)
	struct UAnimMontage* DefaultChargeStartLoopPlayerAnim; // 0x680(0x08)
	struct UAnimMontage* DefaultChargeStartEndPlayerAnim; // 0x688(0x08)
	struct FTransform CameraTransStartSequence; // 0x690(0x30)
	bool IsFirstFrameInSeq; // 0x6c0(0x01)
	char pad_6C1[0x3]; // 0x6c1(0x03)
	float PlayerCameraBeginFOV; // 0x6c4(0x04)
	struct FName tmpDelayNextState; // 0x6c8(0x08)
	struct FName tmpDelayNextCancelState; // 0x6d0(0x08)
	bool EditorDebug; // 0x6d8(0x01)
	bool IsStencilOn; // 0x6d9(0x01)
	char pad_6DA[0x2]; // 0x6da(0x02)
	int32_t StencilValue; // 0x6dc(0x04)
	struct FTransform LastCameraTransform; // 0x6e0(0x30)
	bool IsFirstFrameInEndCameraSeq; // 0x710(0x01)
	char pad_711[0x7]; // 0x711(0x07)
	struct ARsBattleHero_C* CameraOwner; // 0x718(0x08)
	struct FCameraUniqueObjectParameter UniqueCameraParameter; // 0x720(0x58)
	struct FName UniqueCameraParamName; // 0x778(0x08)
	struct TArray<struct UCameraShake*> CameraShake; // 0x780(0x10)
	struct TArray<struct ABP_EffectBackground_C*> ExtraParticles; // 0x790(0x10)
	struct FPsychicObjectSizeParameter SizeParameter; // 0x7a0(0x118)
	enum class EPsychicObjectID PsychicObjectID; // 0x8b8(0x01)
	char pad_8B9[0x3]; // 0x8b9(0x03)
	float UseDistance; // 0x8bc(0x04)
	float PlaceAdjustMoveScale; // 0x8c0(0x04)
	char pad_8C4[0x4]; // 0x8c4(0x04)
	struct FCameraTriggerInfo NearGimmickCameraInfo; // 0x8c8(0x28)
	bool UseCameraSocketType; // 0x8f0(0x01)
	char pad_8F1[0x7]; // 0x8f1(0x07)
	struct TArray<struct UMeshComponent*> GateMeshComponent; // 0x8f8(0x10)
	struct TArray<enum class E_SASKindNative> NeedSasForGate; // 0x908(0x10)
	bool IsControlEndCameraEnd; // 0x918(0x01)
	bool IsControlCameraStart; // 0x919(0x01)
	char pad_91A[0x2]; // 0x91a(0x02)
	float LookAtNear; // 0x91c(0x04)
	float LookAtFar; // 0x920(0x04)
	bool IsCheckCaptureCancel; // 0x924(0x01)
	bool IsUnqObjCamStarted; // 0x925(0x01)
	bool NotPlayBraintalkInPlayInKizunaEpisode; // 0x926(0x01)
	bool IsWeightGaugeCheck; // 0x927(0x01)

	int32_t GetDataRevision(); // Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.GetDataRevision // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1685580
	struct FMeshTriangleData GetMeshTriangleData(); // Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.GetMeshTriangleData // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1685580
	bool SetPsychicObjectEventC(bool bStart, bool bTick, bool bVisibility); // Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.SetPsychicObjectEventC // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ResetPsychicObjectArrangeTransformC(); // Function BP_MapGimmickObjectBase.BP_MapGimmickObjectBase_C.ResetPsychicObjectArrangeTransformC // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
