// BlueprintGeneratedClass BP_PlayerManager.BP_PlayerManager_C
// Size: 0x538 (Inherited: 0x398)
struct ABP_PlayerManager_C : APlayerManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x398(0x08)
	struct UBP_PlayerRessurectComponent_C* BP_PlayerRessurectRight; // 0x3a0(0x08)
	struct UBP_PlayerRessurectComponent_C* BP_PlayerRessurecttLeft; // 0x3a8(0x08)
	struct UBP_CalcParameterComponent_C* BP_CalcParameterComponent; // 0x3b0(0x08)
	struct UBP_GameOverSystemComponent_C* GameOverSystem; // 0x3b8(0x08)
	struct UBP_PlayerFixParamater_C* FixParam; // 0x3c0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3c8(0x08)
	float PartnerWarpLimitDistance; // 0x3d0(0x04)
	float PartnerWarpLimitDistanceBattle; // 0x3d4(0x04)
	struct TArray<struct FVector> PartnerWarpOffset; // 0x3d8(0x10)
	struct TArray<struct FSPlayerAIAssistThinkData> HpAssistThinkTable; // 0x3e8(0x10)
	struct TArray<struct FSPlayerAIAssistThinkData> StatusAssistThinkTable; // 0x3f8(0x10)
	struct TArray<struct FSPlayerAIAssistThinkData> RevivalAssistThinkTable; // 0x408(0x10)
	int32_t HpAssistCount; // 0x418(0x04)
	int32_t StatusAssistCount; // 0x41c(0x04)
	int32_t RevivalAssistCount; // 0x420(0x04)
	bool bForceBrainField; // 0x424(0x01)
	bool bDisableGameOver; // 0x425(0x01)
	bool bInitSkillList; // 0x426(0x01)
	char pad_427[0x1]; // 0x427(0x01)
	struct TArray<struct FCharactersSkillData> SkillList; // 0x428(0x10)
	bool bDisableBrainFieldFlag; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct TArray<bool> SkillIdCh0100; // 0x440(0x10)
	struct TArray<bool> SkillIdCh0200; // 0x450(0x10)
	struct ABP_PlayerHologram_C* HologramManageActor; // 0x460(0x08)
	struct FMulticastInlineDelegate DispatchSuccessResurrect; // 0x468(0x10)
	struct TArray<struct ABP_CableBase_C*> ResurrectCableList; // 0x478(0x10)
	float DebugDPS; // 0x488(0x04)
	float DebugDPS_DamageSum; // 0x48c(0x04)
	float DebugDPSTimer; // 0x490(0x04)
	float DebugDPSLastTime; // 0x494(0x04)
	float DebugDPSInterval; // 0x498(0x04)
	float PreviousStealthOpacity; // 0x49c(0x04)
	float StealthOpacityUpTime; // 0x4a0(0x04)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	struct ARSBattlePlayer_C* ChildYuitoActor; // 0x4a8(0x08)
	bool bSpawnChildYuito; // 0x4b0(0x01)
	char pad_4B1[0x7]; // 0x4b1(0x07)
	struct ARSBattlePlayer_C* SASLinkENPCActor; // 0x4b8(0x08)
	struct TArray<struct ABP_MenuPlayerBase_C*> MenuBGPlayerList; // 0x4c0(0x10)
	bool bEnableBrainCrashAccessExtraTime; // 0x4d0(0x01)
	char pad_4D1[0x3]; // 0x4d1(0x03)
	float BrainCrashAccessExtraTime; // 0x4d4(0x04)
	bool bNewSkill; // 0x4d8(0x01)
	char pad_4D9[0x7]; // 0x4d9(0x07)
	struct ARSBattlePlayer_C* RessurrectedPlayer; // 0x4e0(0x08)
	bool bNpcThinkAssistAttack_1; // 0x4e8(0x01)
	char pad_4E9[0x7]; // 0x4e9(0x07)
	struct ABP_NpcReviveDirectionActor_C* NpcReviveDirectionActor; // 0x4f0(0x08)
	struct TArray<struct FSPlayerAIAssistThinkData> HpAssistThinkTable_OrderLimit; // 0x4f8(0x10)
	bool SteapthOpacityMove; // 0x508(0x01)
	char pad_509[0x3]; // 0x509(0x03)
	float PartnerWarp_LimitBattleField; // 0x50c(0x04)
	bool bReservedMainPlayerDeadSequence; // 0x510(0x01)
	char pad_511[0x3]; // 0x511(0x03)
	struct FGameTimer RequestStatusAssistTimer; // 0x514(0x0c)
	bool bBackupEventSetoMask; // 0x520(0x01)
	char pad_521[0x7]; // 0x521(0x07)
	struct TArray<int32_t> BackupEquipAttachmentItemID; // 0x528(0x10)

	void GetCameraPitchMaxAngle(float MaxLowAngle, float MaxUpAngle); // Function BP_PlayerManager.BP_PlayerManager_C.GetCameraPitchMaxAngle // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetMainPlayerCostumeID(int32_t CostumeId); // Function BP_PlayerManager.BP_PlayerManager_C.GetMainPlayerCostumeID // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetPlayerWeaponActorList(struct AActor* OwnerPlayer, enum class EGetPlayerWeaponType Type, struct TArray<struct AActor*> WeaponList); // Function BP_PlayerManager.BP_PlayerManager_C.GetPlayerWeaponActorList // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
