// BlueprintGeneratedClass BP_PsychicObjectBasic.BP_PsychicObjectBasic_C
// Size: 0x5a0 (Inherited: 0x320)
struct ABP_PsychicObjectBasic_C : APsychicObjectBasicC {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x320(0x08)
	struct USplineComponent* Spline; // 0x328(0x08)
	struct UBP_PsychicObjectComponent_C* BP_PsychicObjectComponent; // 0x330(0x08)
	struct UArrowComponent* AttackSwingArrow; // 0x338(0x08)
	struct UArrowComponent* AttackDropArrow; // 0x340(0x08)
	struct UPsychicObjectSoundComponent* PsychicObjectSound; // 0x348(0x08)
	struct UBP_PsychicComponentMain_C* BP_PsychicComponentMain; // 0x350(0x08)
	struct UPsychicSasParticleComponent_C* PsychicSasParticleComponent; // 0x358(0x08)
	struct UInertialMoveComponent_C* InertialMoveComponent; // 0x360(0x08)
	struct UBP_EventParamComponent_C* BP_EventParamComponent; // 0x368(0x08)
	struct UBP_CollisionHitSoundComponent_C* BP_CollisionHitSoundComponent; // 0x370(0x08)
	struct UHitCheckReceiverComponent* HitCheckReceiver; // 0x378(0x08)
	struct UTeamComponent* Team; // 0x380(0x08)
	struct UArrowComponent* AttackArrow; // 0x388(0x08)
	struct UCapsuleComponent* AttackCapsule; // 0x390(0x08)
	struct USphereComponent* AttackSphere; // 0x398(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x3a0(0x08)
	enum class EPsychicObjectID ObjectID; // 0x3a8(0x01)
	enum class ECollisionEnabled PsychicObjectCollision; // 0x3a9(0x01)
	bool PsychicObjectSimulate; // 0x3aa(0x01)
	bool PsychicObjectGravity; // 0x3ab(0x01)
	bool bFloatObject; // 0x3ac(0x01)
	bool bSwingType; // 0x3ad(0x01)
	bool bPhysMassOverwrite; // 0x3ae(0x01)
	char pad_3AF[0x1]; // 0x3af(0x01)
	int32_t PhysMassOverwrhiteKg; // 0x3b0(0x04)
	bool bUseSizeParameterName; // 0x3b4(0x01)
	char pad_3B5[0x3]; // 0x3b5(0x03)
	struct FName SizeParameterName; // 0x3b8(0x08)
	bool bCaptureTimeNormalEx; // 0x3c0(0x01)
	char pad_3C1[0x3]; // 0x3c1(0x03)
	float CaptureTimeNormalEx; // 0x3c4(0x04)
	struct TSoftClassPtr<UObject> DestructibleSoftClass; // 0x3c8(0x28)
	struct ABP_PsychicObjectDestructibleBasic_C* DestructibleClass; // 0x3f0(0x08)
	struct FName PsychicObjectName; // 0x3f8(0x08)
	enum class PsychicObjectID PsychicObjectID; // 0x400(0x01)
	enum class PsyObjType PsychicObjectType; // 0x401(0x01)
	char pad_402[0x6]; // 0x402(0x06)
	struct TArray<struct AActor*> AttackHitActorList; // 0x408(0x10)
	bool Cinematic; // 0x418(0x01)
	bool UseDebrisParticle; // 0x419(0x01)
	bool UseDebrisOverrideMaterial; // 0x41a(0x01)
	char pad_41B[0x1]; // 0x41b(0x01)
	int32_t DebrisOverrideMaterialIndex; // 0x41c(0x04)
	struct UParticleSystem* DebrisParticle; // 0x420(0x08)
	struct UBP_UniqueObjectComponentBase_C* RefUniqueObjComponent; // 0x428(0x08)
	struct FName UniqueDitherParameterName; // 0x430(0x08)
	struct UParticleSystem* EffectExplosion; // 0x438(0x08)
	float DestroyExplosionRadius; // 0x440(0x04)
	float DestroyExplosionTime; // 0x444(0x04)
	struct FHCCollisionCommonInfo DestroyExplosionCommonInfo; // 0x448(0x70)
	struct FHCSkillCommonInfo DestroyExplosionSkillInfo; // 0x4b8(0xe8)

	enum class FHitEffectPriority GetHitEffectPriorityInterface(); // Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.GetHitEffectPriorityInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetDamageCameraShakeData(bool bEnable, struct UCameraShake* CameraShakeClass, float Scale); // Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.GetDamageCameraShakeData // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IsInterceptFail(bool bFail); // Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.IsInterceptFail // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InterceptCancel(bool bDummy); // Function BP_PsychicObjectBasic.BP_PsychicObjectBasic_C.InterceptCancel // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
