// BlueprintGeneratedClass BP_PsychicComponentMain.BP_PsychicComponentMain_C
// Size: 0xc4c (Inherited: 0xc0)
struct UBP_PsychicComponentMain_C : UActorComponent {
	struct UMeshComponent* MeshComp; // 0xc0(0x08)
	struct UMeshComponent* AuraComp; // 0xc8(0x08)
	struct UMeshComponent* ShadowComp; // 0xd0(0x08)
	struct USceneComponent* directionComp; // 0xd8(0x08)
	struct UPrimitiveComponent* hitPrimitiveCompOld; // 0xe0(0x08)
	struct UPrimitiveComponent* attackPrimitiveComp; // 0xe8(0x08)
	struct UPrimitiveComponent* dodgePrimitiveComp; // 0xf0(0x08)
	struct UInertialMoveComponent_C* InertialMoveComp; // 0xf8(0x08)
	struct UProjectileMovementComponent* OwnerMovement; // 0x100(0x08)
	struct ARsBattleHero_C* grabOwner; // 0x108(0x08)
	struct APsychicGrabAttachment_C* GrabAttach; // 0x110(0x08)
	struct ABP_PsychicObjectBasic_C* ObjOwner; // 0x118(0x08)
	struct AActor* TargetActor; // 0x120(0x08)
	struct USceneComponent* MeshOwner; // 0x128(0x08)
	struct UBP_PlayerFixParamater_C* PlayerFixParam; // 0x130(0x08)
	int32_t RegNo; // 0x138(0x04)
	int32_t requestIndex; // 0x13c(0x04)
	int32_t grabIndex; // 0x140(0x04)
	int32_t brainIndex; // 0x144(0x04)
	enum class PsychicObjectGroupID DataGroup; // 0x148(0x01)
	enum class EPsychicObjectID ObjectID; // 0x149(0x01)
	enum class EPsychicObjectSizeType ObjectSize; // 0x14a(0x01)
	enum class EPsychicObjectSizeType EffectSize; // 0x14b(0x01)
	enum class PsychicObjectAttackSwingType SwingType; // 0x14c(0x01)
	enum class PsychicObjectSoundGroup SoundGroup; // 0x14d(0x01)
	char pad_14E[0x2]; // 0x14e(0x02)
	struct FName GrabAttachSocket; // 0x150(0x08)
	bool bPsychicActive; // 0x158(0x01)
	bool bCheckRegister; // 0x159(0x01)
	bool bCheckFixParam; // 0x15a(0x01)
	bool bSkipInitPhysics; // 0x15b(0x01)
	bool bStaticMesh; // 0x15c(0x01)
	bool bSkeletalMesh; // 0x15d(0x01)
	bool bUnique; // 0x15e(0x01)
	bool bBrainFieldSpawn; // 0x15f(0x01)
	bool bTransferObj; // 0x160(0x01)
	bool bGrabMove; // 0x161(0x01)
	bool bAccelerateFilter; // 0x162(0x01)
	bool bGrab; // 0x163(0x01)
	bool bNoReuse; // 0x164(0x01)
	enum class E_SASKind SasKind; // 0x165(0x01)
	char pad_166[0x2]; // 0x166(0x02)
	struct TArray<enum class E_SASKind> SasKindList; // 0x168(0x10)
	bool bBulletObj; // 0x178(0x01)
	char pad_179[0x7]; // 0x179(0x07)
	struct FTransform ActorArrangeTransform; // 0x180(0x30)
	struct FTransform MeshArrangeTransform; // 0x1b0(0x30)
	float psychicDeltaSecond; // 0x1e0(0x04)
	float psychicDeltaRate; // 0x1e4(0x04)
	bool bGrabGauge; // 0x1e8(0x01)
	char pad_1E9[0x3]; // 0x1e9(0x03)
	float GrabGaugeAdd; // 0x1ec(0x04)
	float GrabGaugeBase; // 0x1f0(0x04)
	float grabGauge; // 0x1f4(0x04)
	struct UCurveFloat* LiftUpHeightCurve; // 0x1f8(0x08)
	bool bLiftUp; // 0x200(0x01)
	char pad_201[0x3]; // 0x201(0x03)
	float LiftStartTime; // 0x204(0x04)
	float liftStartTimer; // 0x208(0x04)
	float LiftUpHeight; // 0x20c(0x04)
	float LiftUpTime; // 0x210(0x04)
	float liftRate; // 0x214(0x04)
	float liftHeightStt; // 0x218(0x04)
	struct FVector LiftPosCen; // 0x21c(0x0c)
	struct FRotator LiftRotStt; // 0x228(0x0c)
	char pad_234[0x4]; // 0x234(0x04)
	struct UCurveFloat* GrabMoveHeightCurve; // 0x238(0x08)
	struct UCurveFloat* GrabMoveSpeedCurve; // 0x240(0x08)
	struct UCurveFloat* GrabMoveRotateCurve; // 0x248(0x08)
	struct UCurveFloat* GrabMoveDecelCurve; // 0x250(0x08)
	struct UCurveFloat* GrabMoveReturnCurve; // 0x258(0x08)
	struct UCurveFloat* GrabReloadSpeedCurve; // 0x260(0x08)
	struct UCurveFloat* GrabReloadHeightCurve; // 0x268(0x08)
	bool bGrabMoving; // 0x270(0x01)
	bool bGrabMoveCurve; // 0x271(0x01)
	bool bGrabReload; // 0x272(0x01)
	bool bGrabMoveDecel; // 0x273(0x01)
	bool bGrabMoveReturn; // 0x274(0x01)
	bool bGrabMoveAttack; // 0x275(0x01)
	char pad_276[0x2]; // 0x276(0x02)
	float GrabMoveTime; // 0x278(0x04)
	float grabMoveTimer; // 0x27c(0x04)
	float GrabMoveHeight; // 0x280(0x04)
	float grabMoveRate; // 0x284(0x04)
	struct FVector grabMovePosStt; // 0x288(0x0c)
	struct FRotator grabMoveRotStt; // 0x294(0x0c)
	struct FVector grabMovePosCen; // 0x2a0(0x0c)
	struct FRotator grabMoveRotCen; // 0x2ac(0x0c)
	float GrabMoveDecelTime; // 0x2b8(0x04)
	float GrabMoveReturnTime; // 0x2bc(0x04)
	float grabMoveBounceTimer; // 0x2c0(0x04)
	float GrabMoveSlopeDistSq; // 0x2c4(0x04)
	float GrabMoveSlopeMax; // 0x2c8(0x04)
	struct FVector grabMoveSpeed; // 0x2cc(0x0c)
	struct FVector grabDecelSpeedStt; // 0x2d8(0x0c)
	float GrabReloadTime; // 0x2e4(0x04)
	float BrainReloadTime; // 0x2e8(0x04)
	float ComboReloadTime; // 0x2ec(0x04)
	struct UCurveVector* GrabFloatPosCurve; // 0x2f0(0x08)
	struct UCurveVector* GrabFloatAngleCurve; // 0x2f8(0x08)
	bool bGrabFloat; // 0x300(0x01)
	char pad_301[0x3]; // 0x301(0x03)
	float GrabFloatLength; // 0x304(0x04)
	struct FVector GrabFloatPosRange; // 0x308(0x0c)
	struct FVector GrabFloatAngleRange; // 0x314(0x0c)
	float grabFloatTimer; // 0x320(0x04)
	float GrabFloatSpeedRate; // 0x324(0x04)
	struct FVector GrabFloatPosRate; // 0x328(0x0c)
	struct FVector GrabFloatRotRate; // 0x334(0x0c)
	struct UMaterialInstanceDynamic* AuraMaterialInstance; // 0x340(0x08)
	struct UMaterialInstanceDynamic* FlashMaterialInstance; // 0x348(0x08)
	bool bAura; // 0x350(0x01)
	bool bAuraOn; // 0x351(0x01)
	bool bStencilOn; // 0x352(0x01)
	char pad_353[0x1]; // 0x353(0x01)
	float AuraGrowTime; // 0x354(0x04)
	int32_t StencilValue; // 0x358(0x04)
	float auraRate; // 0x35c(0x04)
	float AttackCollisionRadius; // 0x360(0x04)
	int32_t AttackCountMax; // 0x364(0x04)
	int32_t AttackCount; // 0x368(0x04)
	bool bAttackExec; // 0x36c(0x01)
	bool bPsychicCombo; // 0x36d(0x01)
	bool bPsychicEx; // 0x36e(0x01)
	bool bAttackDelay; // 0x36f(0x01)
	bool bAttackStart; // 0x370(0x01)
	bool bCheckHit; // 0x371(0x01)
	bool bAttackHit; // 0x372(0x01)
	bool bHitFloor; // 0x373(0x01)
	bool bHitWall; // 0x374(0x01)
	bool bHitCelling; // 0x375(0x01)
	bool bCheckDrop; // 0x376(0x01)
	enum class PsychicObjectAttackType AttackType; // 0x377(0x01)
	struct TArray<enum class HCSkillExtraType> SkillInfoExtraTypeList; // 0x378(0x10)
	struct FGameTimer AttackDelayTimer; // 0x388(0x0c)
	bool bEffectAttack; // 0x394(0x01)
	char pad_395[0x3]; // 0x395(0x03)
	struct UParticleSystem* EffectAttack; // 0x398(0x08)
	float effectAttackTimer; // 0x3a0(0x04)
	float effectAttackDelay; // 0x3a4(0x04)
	float effectAttackParticleRate; // 0x3a8(0x04)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct UCameraShake* CameraShakeTypeThrow; // 0x3b0(0x08)
	struct UCameraShake* CameraShakeTypeDrop; // 0x3b8(0x08)
	struct UCameraShake* CameraShakeTypeSwing; // 0x3c0(0x08)
	float CameraShakeScale; // 0x3c8(0x04)
	bool bThrow; // 0x3cc(0x01)
	char pad_3CD[0x3]; // 0x3cd(0x03)
	struct FVector throwDirection; // 0x3d0(0x0c)
	float ThrowSpeed; // 0x3dc(0x04)
	float ThrowLimitTime; // 0x3e0(0x04)
	float ThrowLimitTimer; // 0x3e4(0x04)
	struct UCurveFloat* ThrowSpeedCurve; // 0x3e8(0x08)
	struct UCurveFloat* ThrowAngleCurve; // 0x3f0(0x08)
	float ThrowRotSpeed; // 0x3f8(0x04)
	float ThrowTime; // 0x3fc(0x04)
	struct FVector ThrowDirectionFront; // 0x400(0x0c)
	float ThrowNormalTimeSecond; // 0x40c(0x04)
	bool bThrowAnim; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float ThrowAnimTime; // 0x414(0x04)
	float throwAnimTimer; // 0x418(0x04)
	struct FVector vecThrowStt; // 0x41c(0x0c)
	bool bWeakPoint; // 0x428(0x01)
	char pad_429[0x3]; // 0x429(0x03)
	int32_t weakPointIndex; // 0x42c(0x04)
	bool bDestroy; // 0x430(0x01)
	bool bNoFade; // 0x431(0x01)
	bool bDestroyFade; // 0x432(0x01)
	bool bApplyDamp; // 0x433(0x01)
	bool bDispose; // 0x434(0x01)
	char pad_435[0x3]; // 0x435(0x03)
	float DestroyDelay; // 0x438(0x04)
	float DestroyTime; // 0x43c(0x04)
	float destroyTimer; // 0x440(0x04)
	float dampValue; // 0x444(0x04)
	bool bDbDispName; // 0x448(0x01)
	bool bDbDispIndex; // 0x449(0x01)
	bool bDbDispState; // 0x44a(0x01)
	bool bDbDispSearchInfo; // 0x44b(0x01)
	bool bDbDispDistance; // 0x44c(0x01)
	bool bDbDispPos; // 0x44d(0x01)
	bool bDbDispGauge; // 0x44e(0x01)
	bool bDbDispHit; // 0x44f(0x01)
	bool bDbDispAttack; // 0x450(0x01)
	bool bDbDispArrow; // 0x451(0x01)
	bool bDbDispAura; // 0x452(0x01)
	bool bDbUseInertialMove; // 0x453(0x01)
	char pad_454[0x4]; // 0x454(0x04)
	struct USoundAtomCue* SoundLiftUp; // 0x458(0x08)
	struct TArray<struct USoundAtomCue*> SoundAttack; // 0x460(0x10)
	struct USoundAtomCue* SoundAttackThrow; // 0x470(0x08)
	struct USoundAtomCue* SoundAttackCombo; // 0x478(0x08)
	struct USoundAtomCue* SoundHitGround; // 0x480(0x08)
	struct USoundAtomCue* SoundHitEnemy; // 0x488(0x08)
	struct UCurveFloat* GrabStartSpeedCurve; // 0x490(0x08)
	struct UCurveFloat* GrabStartRotateCurve; // 0x498(0x08)
	struct TArray<float> GrabStartTimeRange; // 0x4a0(0x10)
	struct TArray<float> GrabStartSpeedRange; // 0x4b0(0x10)
	struct TArray<float> GrabStartRotateRange; // 0x4c0(0x10)
	float GrabStartMoveTime; // 0x4d0(0x04)
	float GrabStartRotateTime; // 0x4d4(0x04)
	bool bGrabStartRight; // 0x4d8(0x01)
	bool bGrabStart; // 0x4d9(0x01)
	char pad_4DA[0x2]; // 0x4da(0x02)
	struct FVector vecGrabStart; // 0x4dc(0x0c)
	struct FVector posGrabStart; // 0x4e8(0x0c)
	float grabStartRate; // 0x4f4(0x04)
	float grabStartTimeRate; // 0x4f8(0x04)
	float grabStartSpeedRate; // 0x4fc(0x04)
	float grabStartRotateRate; // 0x500(0x04)
	bool bDeformable; // 0x504(0x01)
	enum class PsychicObjectDeformType DeformType; // 0x505(0x01)
	char pad_506[0x2]; // 0x506(0x02)
	float DeformRange; // 0x508(0x04)
	float DeformRate; // 0x50c(0x04)
	float DeformRandom; // 0x510(0x04)
	struct FVector posImpact; // 0x514(0x0c)
	bool bDbDispDeform; // 0x520(0x01)
	char pad_521[0x3]; // 0x521(0x03)
	struct FVector posPrevThrow; // 0x524(0x0c)
	struct UCurveFloat* ThrowStartAngleCurve; // 0x530(0x08)
	float ThrowStartRotSpeed; // 0x538(0x04)
	float ThrowStartInitAngle; // 0x53c(0x04)
	bool bThrowStart; // 0x540(0x01)
	char pad_541[0x3]; // 0x541(0x03)
	float throwStartRate; // 0x544(0x04)
	struct UCurveFloat* ThrowAllHeightCurve; // 0x548(0x08)
	float ThrowAllHeight; // 0x550(0x04)
	bool bThrowAll; // 0x554(0x01)
	bool bThrowAllTarget; // 0x555(0x01)
	char pad_556[0x2]; // 0x556(0x02)
	struct FVector throwAllTargetPos; // 0x558(0x0c)
	float throwAllTimer; // 0x564(0x04)
	int32_t throwAllIndex; // 0x568(0x04)
	struct FVector throwAllVector; // 0x56c(0x0c)
	struct FVector throwAllOffset; // 0x578(0x0c)
	float throwAllAngle; // 0x584(0x04)
	float throwAllAngleExt; // 0x588(0x04)
	float throwAllRadius; // 0x58c(0x04)
	float throwAllRadiusExt; // 0x590(0x04)
	float BrainFloatTime; // 0x594(0x04)
	float BrainFloatHeightBase; // 0x598(0x04)
	float BrainFloatHeightRange; // 0x59c(0x04)
	float BrainFloatSlopeDistSq; // 0x5a0(0x04)
	float BrainFloatSlopeMax; // 0x5a4(0x04)
	float BrainFloatSlopeMin; // 0x5a8(0x04)
	struct FVector BrainFloatPos; // 0x5ac(0x0c)
	bool bBrainFloat; // 0x5b8(0x01)
	char pad_5B9[0x3]; // 0x5b9(0x03)
	struct FRotator rotBrainFloatStt; // 0x5bc(0x0c)
	struct FVector posBrainFloatEnd; // 0x5c8(0x0c)
	float brainFloatTimer; // 0x5d4(0x04)
	float brainFloatSlope; // 0x5d8(0x04)
	bool bFacetsApparition; // 0x5dc(0x01)
	char pad_5DD[0x3]; // 0x5dd(0x03)
	struct FVector FacetAffectPoint; // 0x5e0(0x0c)
	float FacetTime; // 0x5ec(0x04)
	float FacetTimer; // 0x5f0(0x04)
	float FacetTimerSign; // 0x5f4(0x04)
	float FacetDistance; // 0x5f8(0x04)
	float FacetAxisOffset; // 0x5fc(0x04)
	float FacetBulgeOffset; // 0x600(0x04)
	float FacetBulgeDistacne; // 0x604(0x04)
	float FacetTurn; // 0x608(0x04)
	float FacetScaleMin; // 0x60c(0x04)
	float FacetAffectPointTop; // 0x610(0x04)
	float FacetAffectPointBtm; // 0x614(0x04)
	bool bBrainAppear; // 0x618(0x01)
	bool bBrainDisappear; // 0x619(0x01)
	char pad_61A[0x2]; // 0x61a(0x02)
	float BrainAppearTime; // 0x61c(0x04)
	bool bBrainFieldAttack; // 0x620(0x01)
	char pad_621[0x3]; // 0x621(0x03)
	float BrainFieldAttackWaitTime; // 0x624(0x04)
	float BrainFieldAttackWaitTimer; // 0x628(0x04)
	float FadeInTime; // 0x62c(0x04)
	float FadeOutTime; // 0x630(0x04)
	bool bFade; // 0x634(0x01)
	bool bFadeOut; // 0x635(0x01)
	char pad_636[0x2]; // 0x636(0x02)
	float FadeTimer; // 0x638(0x04)
	float ParticleRateCapture; // 0x63c(0x04)
	float ParticleRateCaptureAura; // 0x640(0x04)
	float ParticleRateFire; // 0x644(0x04)
	float ParticleRateThunder; // 0x648(0x04)
	float ParticleRateCopy; // 0x64c(0x04)
	struct USoundAtomCueSheet* SoundCueSheet; // 0x650(0x08)
	bool bTeleport; // 0x658(0x01)
	bool bTeleportStart; // 0x659(0x01)
	bool bTeleportAttach; // 0x65a(0x01)
	char pad_65B[0x1]; // 0x65b(0x01)
	struct FVector TeleportOffset; // 0x65c(0x0c)
	float TeleportTime; // 0x668(0x04)
	float TeleportTimer; // 0x66c(0x04)
	float TeleportStt; // 0x670(0x04)
	float TeleportEnd; // 0x674(0x04)
	float TeleportRate; // 0x678(0x04)
	bool bAdjustAttach; // 0x67c(0x01)
	char pad_67D[0x3]; // 0x67d(0x03)
	float AdjustTime; // 0x680(0x04)
	float AdjustTimer; // 0x684(0x04)
	struct FVector AdjustSPosStt; // 0x688(0x0c)
	struct FRotator AdjustRotStt; // 0x694(0x0c)
	bool bCaptureMaterial; // 0x6a0(0x01)
	char pad_6A1[0x3]; // 0x6a1(0x03)
	float CaptureMaterialRate; // 0x6a4(0x04)
	bool bDbDispCollision; // 0x6a8(0x01)
	enum class E_SASKind SasKindPrev; // 0x6a9(0x01)
	bool bStealth; // 0x6aa(0x01)
	bool bStealthLerp; // 0x6ab(0x01)
	bool bStealthStart; // 0x6ac(0x01)
	char pad_6AD[0x3]; // 0x6ad(0x03)
	float StealthTime; // 0x6b0(0x04)
	float StealthTimer; // 0x6b4(0x04)
	float StealthStt; // 0x6b8(0x04)
	float StealthEnd; // 0x6bc(0x04)
	float StealthRate; // 0x6c0(0x04)
	bool bFullHoming; // 0x6c4(0x01)
	char pad_6C5[0x3]; // 0x6c5(0x03)
	float HomingRoll; // 0x6c8(0x04)
	char pad_6CC[0x4]; // 0x6cc(0x04)
	struct ABP_PsychicObjectBasic_C* CopyObjSource; // 0x6d0(0x08)
	struct ABP_PsychicObjectBasic_C* CopyObj; // 0x6d8(0x08)
	bool bCopyObj; // 0x6e0(0x01)
	bool bCopyCombo; // 0x6e1(0x01)
	bool bCopyAppear; // 0x6e2(0x01)
	bool bCopyObjUpdate; // 0x6e3(0x01)
	struct FGameTimer CopyEffectTimer; // 0x6e4(0x0c)
	float CopyEffectRate; // 0x6f0(0x04)
	float CopyEffectTime; // 0x6f4(0x04)
	bool bTransferAppear; // 0x6f8(0x01)
	char pad_6F9[0x3]; // 0x6f9(0x03)
	float TransferTime; // 0x6fc(0x04)
	float TransferTimer; // 0x700(0x04)
	struct FVector posCenPrev; // 0x704(0x0c)
	float CopyDelayTime; // 0x710(0x04)
	struct FGameTimer CopyDelayTimer; // 0x714(0x0c)
	struct FVector CopyOffsetPos; // 0x720(0x0c)
	bool bNewAttach; // 0x72c(0x01)
	char pad_72D[0x3]; // 0x72d(0x03)
	struct ARSBattleCharacter_C* EmPsyObjOwner; // 0x730(0x08)
	struct ARSBattleCharacter_C* EmPsyObjAttacker; // 0x738(0x08)
	bool EmPsyObjOccupiedMain; // 0x740(0x01)
	bool bIntercepted; // 0x741(0x01)
	char pad_742[0x2]; // 0x742(0x02)
	struct FVector ParticleSizeCapture; // 0x744(0x0c)
	struct FVector ParticleSizeCaptureAura; // 0x750(0x0c)
	struct FVector ParticleSizeFire; // 0x75c(0x0c)
	struct FVector ParticleSizeThunder; // 0x768(0x0c)
	struct FVector ParticleSizeCopy; // 0x774(0x0c)
	bool bEffectSas; // 0x780(0x01)
	char pad_781[0x3]; // 0x781(0x03)
	float EffectSasTimer; // 0x784(0x04)
	struct FSPsychicCaptureMaterial MaterialParamNormal; // 0x788(0xa0)
	struct FSPsychicCaptureMaterial MaterialParamFire; // 0x828(0xa0)
	struct FSPsychicCaptureMaterial MaterialParamThunder; // 0x8c8(0xa0)
	struct FSPsychicCaptureMaterial MaterialParamStart; // 0x968(0xa0)
	struct UCurveVector* MaterialCurveNormal; // 0xa08(0x08)
	struct UCurveVector* MaterialCurveFire; // 0xa10(0x08)
	struct UCurveVector* MaterialCurveThunder; // 0xa18(0x08)
	struct UCurveVector* MaterialCurveStart; // 0xa20(0x08)
	bool bThrowDirect; // 0xa28(0x01)
	bool bLiftUpDirect; // 0xa29(0x01)
	char pad_A2A[0x2]; // 0xa2a(0x02)
	struct FGameTimer LiftUpDirectTimer; // 0xa2c(0x0c)
	float LiftUpDirectTime; // 0xa38(0x04)
	float LiftUpDirectHeight; // 0xa3c(0x04)
	struct FVector WorkPosStt; // 0xa40(0x0c)
	struct FVector WorkPosEnd; // 0xa4c(0x0c)
	struct FRotator WorkRotStt; // 0xa58(0x0c)
	struct FRotator WorkRotEnd; // 0xa64(0x0c)
	struct FTransform PreviousTransform; // 0xa70(0x30)
	struct FTransform UpdateLastTransform; // 0xaa0(0x30)
	bool bKeepAttackCollision; // 0xad0(0x01)
	char pad_AD1[0x7]; // 0xad1(0x07)
	struct TArray<struct UMeshComponent*> CaptureMeshListOld; // 0xad8(0x10)
	bool bSkipInitVisibility; // 0xae8(0x01)
	char pad_AE9[0x7]; // 0xae9(0x07)
	struct FHCCollisionCommonInfo EnemyCommonInfo; // 0xaf0(0x70)
	struct FHCSkillCommonInfo EnemySkillInfo; // 0xb60(0xe8)
	bool bUseEnemyInfo; // 0xc48(0x01)
	bool bInterceptReserve; // 0xc49(0x01)
	bool bSkipInitPhysics2; // 0xc4a(0x01)
	bool bAbolishMainSimulate; // 0xc4b(0x01)

	void DebugPrintCheckSimulate(struct FString str in, bool skip screen in); // Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.DebugPrintCheckSimulate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DebugPrintAbolishString(struct FString func name in); // Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.DebugPrintAbolishString // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InterceptCancel(); // Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.InterceptCancel // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InterceptReserve(); // Function BP_PsychicComponentMain.BP_PsychicComponentMain_C.InterceptReserve // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
