// BlueprintGeneratedClass BP_PostProcessManager.BP_PostProcessManager_C
// Size: 0x980 (Inherited: 0x238)
struct ABP_PostProcessManager_C : APostProcessManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x238(0x08)
	struct UPostProcessComponent* DamagePostProcess; // 0x240(0x08)
	struct UPostProcessComponent* PerformPostProcess; // 0x248(0x08)
	struct UChildActorComponent* OverraySystem; // 0x250(0x08)
	struct UPostProcessComponent* SequencerPostProcess; // 0x258(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x260(0x08)
	struct TArray<struct UPostProcessComponent*> DirectionPPComponents; // 0x268(0x10)
	int32_t DirectionMax; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct TArray<float> LerpSpeed; // 0x280(0x10)
	struct TArray<bool> UsePPComponents; // 0x290(0x10)
	float PriorityOffset; // 0x2a0(0x04)
	float BasePriority; // 0x2a4(0x04)
	struct UMaterialInstanceDynamic* DamagePostProcessMaterial; // 0x2a8(0x08)
	struct UMaterialInterface* OutlineMaterial; // 0x2b0(0x08)
	struct UMaterialInterface* OutlineNoEmissionMaterial; // 0x2b8(0x08)
	struct UMaterialInterface* OutlineNoCustomDepthMaterial; // 0x2c0(0x08)
	struct UMaterialInterface* OutlineAfterFogMaterial; // 0x2c8(0x08)
	struct UMaterialInterface* OutlineAfterFogNoCustomDepthMaterial; // 0x2d0(0x08)
	struct UMaterialInterface* OutlineFrontMaterial; // 0x2d8(0x08)
	struct UMaterialInstanceDynamic* AcceleratorMaterial; // 0x2e0(0x08)
	struct TSoftObjectPtr<UMaterialInterface> OutlineMaterialAsset; // 0x2e8(0x28)
	struct TSoftObjectPtr<UMaterialInterface> OutlineNoEmissionMaterialAsset; // 0x310(0x28)
	struct TSoftObjectPtr<UMaterialInterface> OutlineNoCustomDepthMaterialAsset; // 0x338(0x28)
	struct TSoftObjectPtr<UMaterialInterface> OutlineFrontMaterialAsset; // 0x360(0x28)
	struct TSoftObjectPtr<UMaterialInterface> OutlineFrontNoEmissionMaterialAsset; // 0x388(0x28)
	struct TSoftObjectPtr<UMaterialInterface> OutlineFrontNoCustomDepthMaterialAsset; // 0x3b0(0x28)
	struct TSoftObjectPtr<UMaterialInterface> OutlineAfterFogMaterialAsset; // 0x3d8(0x28)
	struct TSoftObjectPtr<UMaterialInterface> OutlineAfterFogNoCustomDepthMaterialAsset; // 0x400(0x28)
	struct TSoftObjectPtr<UMaterialInterface> RadialBlurMaterialAsset; // 0x428(0x28)
	struct UMaterialInterface* RadialBlurMaterial; // 0x450(0x08)
	struct UMaterialInterface* HyperSpeedMaterial; // 0x458(0x08)
	struct TSoftObjectPtr<UMaterialInterface> HyperSpeedMaterialAsset; // 0x460(0x28)
	struct TSoftObjectPtr<UMaterialInterface> DamageMaterialAsset; // 0x488(0x28)
	struct UMaterialInterface* ScreenLightMaterialObject; // 0x4b0(0x08)
	struct UMaterialInterface* DamageMaterial; // 0x4b8(0x08)
	struct TSoftObjectPtr<UMaterialInterface> SeeThroughMaterialAsset; // 0x4c0(0x28)
	struct UMaterialInterface* SeeThroughMaterialObject; // 0x4e8(0x08)
	struct UMaterialInstanceDynamic* SeeThroughMaterial; // 0x4f0(0x08)
	float SeeThroughRate; // 0x4f8(0x04)
	float AcceleratorRate; // 0x4fc(0x04)
	bool AcceleratorStart; // 0x500(0x01)
	char pad_501[0x7]; // 0x501(0x07)
	struct TArray<struct FWeightedBlendable> RestorePerformPPM; // 0x508(0x10)
	struct TArray<struct FWeightedBlendable> RestoreDamagePPM; // 0x518(0x10)
	struct TArray<struct APostProcessVolume*> RestoreScenePPV; // 0x528(0x10)
	struct TSoftObjectPtr<UMaterialInterface> ScreenLightMaterialAsset; // 0x538(0x28)
	struct TArray<struct TSoftObjectPtr<UMaterialInterface>> VisionFogMaterialAsset; // 0x560(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> VisionFogMaterial; // 0x570(0x10)
	struct TArray<struct UMaterialInterface*> VisionFogMaterialObject; // 0x580(0x10)
	struct TArray<float> VisionFogRate; // 0x590(0x10)
	struct UMaterialInstanceDynamic* VisionFogActiveMaterial; // 0x5a0(0x08)
	enum class EVisionFogID VisionFogActiveID; // 0x5a8(0x01)
	char pad_5A9[0x3]; // 0x5a9(0x03)
	float VisionFogActiveRate; // 0x5ac(0x04)
	float VisionFogSeeThroughRate; // 0x5b0(0x04)
	float VisionFogVelocity; // 0x5b4(0x04)
	float VisionFogDefaultFogNear; // 0x5b8(0x04)
	float VisionFogDefaultFogFar; // 0x5bc(0x04)
	float SeeThroughDefaultBlurPower; // 0x5c0(0x04)
	struct FVector VisionFogVelocityVector; // 0x5c4(0x0c)
	struct FVector VisionFogLastPlayerLocation; // 0x5d0(0x0c)
	int32_t DefaultPicturizeQuality; // 0x5dc(0x04)
	struct UMaterialInterface* SimpleFadeMaterialObject; // 0x5e0(0x08)
	struct UMaterialInterface* OutlineFrontNoEmissionMaterial; // 0x5e8(0x08)
	struct UMaterialInterface* OutlineFrontNoCustomDepthMaterial; // 0x5f0(0x08)
	struct UMaterialInterface* OutlineVisionFogCounterMaterial; // 0x5f8(0x08)
	bool OutlinePriorityFront; // 0x600(0x01)
	char pad_601[0x7]; // 0x601(0x07)
	struct TSoftObjectPtr<UMaterialInterface> SimpleFadeMaterialAsset; // 0x608(0x28)
	struct UMaterialInstanceDynamic* SimpleFadeMaterial; // 0x630(0x08)
	struct TArray<struct UPostProcessComponent*> PerformShotPostProcessList; // 0x638(0x10)
	struct TSoftObjectPtr<UDataTable> PerformShotDataTableAsset; // 0x648(0x28)
	struct TArray<struct FPerformShotData> PerformShotData; // 0x670(0x10)
	struct TArray<float> PerformShotTime; // 0x680(0x10)
	struct TArray<enum class EPerformShotState> PerformShotState; // 0x690(0x10)
	struct UMaterialInstanceDynamic* ScreenLightMaterial; // 0x6a0(0x08)
	struct TSoftObjectPtr<UMaterialInterface> LevelupMaterialAsset; // 0x6a8(0x28)
	struct UMaterialInterface* LevelupMaterialObject; // 0x6d0(0x08)
	struct UMaterialInstanceDynamic* LevelupMaterial; // 0x6d8(0x08)
	struct TArray<float> LevelupTimer; // 0x6e0(0x10)
	struct TArray<bool> ActiveLevelup; // 0x6f0(0x10)
	float LevelupMaxTimer; // 0x700(0x04)
	float PreviousGameTime; // 0x704(0x04)
	bool SeeThroughStart; // 0x708(0x01)
	char pad_709[0x7]; // 0x709(0x07)
	struct UMaterialInterface* FishEyeMaterialObject; // 0x710(0x08)
	struct UMaterialInstanceDynamic* FishEyeMaterial; // 0x718(0x08)
	struct TSoftObjectPtr<UMaterialInterface> FishEyeMaterialAsset; // 0x720(0x28)
	struct TArray<struct FArrayOfFloat> VisionFogMaterialDefaultParam; // 0x748(0x10)
	struct TArray<struct FName> VisionFogMaterialDefaultParamName; // 0x758(0x10)
	enum class RSPartyPlayerKind RecoverNPCKind; // 0x768(0x01)
	char pad_769[0x3]; // 0x769(0x03)
	float RecoverNPCTimer; // 0x76c(0x04)
	bool RecoverNPCActive; // 0x770(0x01)
	char pad_771[0x7]; // 0x771(0x07)
	struct UCurveVector* RecoverNPCCurve; // 0x778(0x08)
	struct TSoftObjectPtr<UMaterialInterface> RecoverNPCMaterialAsset; // 0x780(0x28)
	struct UMaterialInstanceDynamic* RecoverNPCMaterialObject; // 0x7a8(0x08)
	struct UPostProcessParam* PostProcessParam; // 0x7b0(0x08)
	float DamagePPMFlash; // 0x7b8(0x04)
	float DamagePPMPower; // 0x7bc(0x04)
	bool TickTimeline; // 0x7c0(0x01)
	char pad_7C1[0x7]; // 0x7c1(0x07)
	struct TSoftObjectPtr<UMaterialInstance> KarenMemoryMaterialAsset; // 0x7c8(0x28)
	struct UMaterialInterface* KarenMemoryMaterialObject; // 0x7f0(0x08)
	struct UMaterialInstance* KarenMemoryMaterial; // 0x7f8(0x08)
	enum class EVisionFogID VisionFogEventComID; // 0x800(0x01)
	char pad_801[0x3]; // 0x801(0x03)
	float VisionFogEventComStartRate; // 0x804(0x04)
	float VisionFogEventComTargetRate; // 0x808(0x04)
	float VisionFogEventComInterpTime; // 0x80c(0x04)
	float VisionFogEventComNowTime; // 0x810(0x04)
	bool VisionFogEventComInterp; // 0x814(0x01)
	char pad_815[0x3]; // 0x815(0x03)
	struct TArray<float> VisionFogFar; // 0x818(0x10)
	struct TArray<float> VisionFogNear; // 0x828(0x10)
	struct TArray<struct AActor*> RestoreMenuElevator; // 0x838(0x10)
	bool IsSetupMenu; // 0x848(0x01)
	char pad_849[0x3]; // 0x849(0x03)
	struct FRenderingSettings RenderingSettingsBase; // 0x84c(0x78)
	bool OutlineNoCustomDepth; // 0x8c4(0x01)
	bool UseDebugQuality; // 0x8c5(0x01)
	enum class EGradualQuality DebugQualitySoftFocus; // 0x8c6(0x01)
	enum class EGradualQuality DebugQualityLuminousSmudge ; // 0x8c7(0x01)
	enum class EGradualQuality DebugQualityGradScreenMask; // 0x8c8(0x01)
	enum class EGradualQuality DebugQualityBothSideRim; // 0x8c9(0x01)
	enum class EGradualQuality DebugQualityLightUp; // 0x8ca(0x01)
	enum class EGradualQuality DebugQualityFieldBlur; // 0x8cb(0x01)
	enum class EGradualQuality DebugQualityLightShaft; // 0x8cc(0x01)
	enum class EGradualQuality DebugQualityDrivePlane; // 0x8cd(0x01)
	enum class EGradualQuality DebugQualitySAS; // 0x8ce(0x01)
	enum class EGradualQuality DebugQualityBrainCrash; // 0x8cf(0x01)
	bool OutlineOFF; // 0x8d0(0x01)
	char pad_8D1[0x3]; // 0x8d1(0x03)
	struct FRenderingSettings RenderingSettingsLocation; // 0x8d4(0x78)
	float VisionFogEm8300LightShaftParam; // 0x94c(0x04)
	bool VisionFogEm8300LightShaftON; // 0x950(0x01)
	bool OutlineVisionFogCounter; // 0x951(0x01)
	char pad_952[0x6]; // 0x952(0x06)
	struct TSoftObjectPtr<UMaterialInterface> OutlineVisionFogCounterMaterialAsset; // 0x958(0x28)

	void SetSASPPMCancelCelLook(bool Enable); // Function BP_PostProcessManager.BP_PostProcessManager_C.SetSASPPMCancelCelLook // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IsActivePerformShot(enum class EPerformShotType ShotType, bool IsActive); // Function BP_PostProcessManager.BP_PostProcessManager_C.IsActivePerformShot // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsNeedFrameWait(); // Function BP_PostProcessManager.BP_PostProcessManager_C.IsNeedFrameWait // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PrivateOnChangeArea(enum class EChangeAreaStatus Status, bool IsChangeLocation); // Function BP_PostProcessManager.BP_PostProcessManager_C.PrivateOnChangeArea // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
