// BlueprintGeneratedClass BP_PlayerHologram.BP_PlayerHologram_C
// Size: 0x720 (Inherited: 0x230)
struct ABP_PlayerHologram_C : AActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch1000; // 0x238(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0900_copy3; // 0x240(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0900_copy2; // 0x248(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0900_copy1; // 0x250(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0900_copy0; // 0x258(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0900; // 0x260(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0800; // 0x268(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0700; // 0x270(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0600; // 0x278(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0500; // 0x280(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0400; // 0x288(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0300; // 0x290(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0200; // 0x298(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent_ch0100; // 0x2a0(0x08)
	struct UBP_GhostTrailComponent_C* BP_GhostTrailComponent; // 0x2a8(0x08)
	struct UBP_AimComponent_C* BP_AimComponent; // 0x2b0(0x08)
	struct USkeletalMeshComponent* SM_ch0900_copy4; // 0x2b8(0x08)
	struct USkeletalMeshComponent* SM_ch0900_copy3; // 0x2c0(0x08)
	struct USkeletalMeshComponent* SM_ch0900_copy2; // 0x2c8(0x08)
	struct USkeletalMeshComponent* SM_ch0900_copy1; // 0x2d0(0x08)
	struct USkeletalMeshComponent* SM_ch1000; // 0x2d8(0x08)
	struct USkeletalMeshComponent* SM_ch0900; // 0x2e0(0x08)
	struct USkeletalMeshComponent* SM_ch0800; // 0x2e8(0x08)
	struct USkeletalMeshComponent* SM_ch0700; // 0x2f0(0x08)
	struct USkeletalMeshComponent* SM_ch0600; // 0x2f8(0x08)
	struct USkeletalMeshComponent* SM_ch0500; // 0x300(0x08)
	struct USkeletalMeshComponent* SM_ch0400; // 0x308(0x08)
	struct USkeletalMeshComponent* SM_ch0300; // 0x310(0x08)
	struct USkeletalMeshComponent* SM_ch0200; // 0x318(0x08)
	struct USkeletalMeshComponent* SM_ch0100; // 0x320(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x328(0x08)
	enum class EPlayerID hologramPlayerID; // 0x330(0x01)
	char pad_331[0x7]; // 0x331(0x07)
	struct ABP_WeaponBase_C* WeaponCh0100; // 0x338(0x08)
	struct TArray<struct ABP_WeaponBase_C*> WeaponCh0200; // 0x340(0x10)
	struct ABP_WeaponBase_C* WeaponCh0300; // 0x350(0x08)
	struct ABP_WeaponBase_C* WeaponCh0500; // 0x358(0x08)
	struct ABP_WeaponBase_C* WeaponCh0600; // 0x360(0x08)
	struct ABP_WeaponBase_C* WeaponCh0700; // 0x368(0x08)
	struct ABP_WeaponBase_C* WeaponCh0800Right; // 0x370(0x08)
	struct ABP_WeaponBase_C* WeaponCh0800Left; // 0x378(0x08)
	struct ABP_WeaponBase_C* WeaponCh0900Right; // 0x380(0x08)
	struct ABP_WeaponBase_C* WeaponCh0900Left; // 0x388(0x08)
	struct ABP_WeaponBase_C* WeaponCh1000; // 0x390(0x08)
	bool bHologramOn; // 0x398(0x01)
	char pad_399[0x7]; // 0x399(0x07)
	struct ARSBattlePlayer_C* AttachPlayer; // 0x3a0(0x08)
	struct UCurveVector* CurveStart; // 0x3a8(0x08)
	struct UCurveVector* CurveLoop; // 0x3b0(0x08)
	struct UCurveVector* CurveEnd; // 0x3b8(0x08)
	struct UCurveVector* CurveColorStart; // 0x3c0(0x08)
	float curveTime; // 0x3c8(0x04)
	bool IsAttachPlayerVisible; // 0x3cc(0x01)
	char pad_3CD[0x3]; // 0x3cd(0x03)
	struct UCurveVector* CurveStart_Cover; // 0x3d0(0x08)
	struct UCurveVector* CurveLoop_Cover; // 0x3d8(0x08)
	struct UCurveVector* CurveEnd_Cover; // 0x3e0(0x08)
	enum class EHologramKind HologramKind; // 0x3e8(0x01)
	bool bEnableHologramRootMotion; // 0x3e9(0x01)
	char pad_3EA[0x6]; // 0x3ea(0x06)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0100; // 0x3f0(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0200; // 0x400(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0300; // 0x410(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0400; // 0x420(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0500; // 0x430(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0600; // 0x440(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0700; // 0x450(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0800; // 0x460(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh0900; // 0x470(0x10)
	struct FMulticastInlineDelegate DispatcherOnMontageBlendingOutCh1000; // 0x480(0x10)
	struct FMulticastInlineDelegate DispatcherHologramOff; // 0x490(0x10)
	struct URSParticleSystemComponentBase* WeaponParticleHandle; // 0x4a0(0x08)
	struct TArray<struct ABP_WeaponBase_C*> Ch0900CopyWeaponList; // 0x4a8(0x10)
	struct TArray<struct UAnimMontage*> CopyMontageList; // 0x4b8(0x10)
	int32_t NotifyCount; // 0x4c8(0x04)
	char pad_4CC[0x4]; // 0x4cc(0x04)
	struct ABP_BulletBase_C* BulletCh0900; // 0x4d0(0x08)
	struct ABP_HologramBullet_ch0500_C* BulletCh0500; // 0x4d8(0x08)
	struct FName ClaimantName; // 0x4e0(0x08)
	struct UCurveVector* CurveColorStart_Cover; // 0x4e8(0x08)
	float CurveColorTime; // 0x4f0(0x04)
	char pad_4F4[0x4]; // 0x4f4(0x04)
	struct FMulticastInlineDelegate DispatcherHitThrowWeapon; // 0x4f8(0x10)
	struct FMulticastInlineDelegate DispatchAttackNotify; // 0x508(0x10)
	bool HologramSASMaterial; // 0x518(0x01)
	char pad_519[0x7]; // 0x519(0x07)
	struct UCurveLinearColor* SASMaterialCurve; // 0x520(0x08)
	float SASMaterialTime; // 0x528(0x04)
	struct FLinearColor SASMaterialDefaultLineColor; // 0x52c(0x10)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct FMaterialSwitchCache SASMaterialStealthSwitch; // 0x540(0x10)
	bool SASMaterialNowStealth; // 0x550(0x01)
	char pad_551[0x7]; // 0x551(0x07)
	struct ABP_WeaponBase_C* WeaponCh0400; // 0x558(0x08)
	struct FGameTimer WeaponScaleTimer; // 0x560(0x0c)
	struct FVector WeaponScaleSource; // 0x56c(0x0c)
	struct FVector WeaponScaleDest; // 0x578(0x0c)
	struct FVector OriginalWeaponScale; // 0x584(0x0c)
	bool bCancelDelay; // 0x590(0x01)
	char pad_591[0x7]; // 0x591(0x07)
	struct ARSBattlePlayer_C* ProxyPlayer; // 0x598(0x08)
	int32_t NotifyCountCombinationVision; // 0x5a0(0x04)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct TArray<struct ABP_CombinationVisionBullet_ch0500_C*> Combination_BulletCh0500; // 0x5a8(0x10)
	int32_t Combination_BulletCh0500Num; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)
	struct TArray<struct FAttackCollisionInfoBP> Combination_Ch0500BulletCollisionInfo; // 0x5c0(0x10)
	float Combination_Ch0500DefaultBulletFirePitch; // 0x5d0(0x04)
	float Combination_Ch0500PitchCorrectLimitMin; // 0x5d4(0x04)
	float Combination_Ch0500RotatePitchTarget; // 0x5d8(0x04)
	float Combination_Ch0500RotatePitchSpeed; // 0x5dc(0x04)
	struct ARSCharacterBase* lTargetCharacter; // 0x5e0(0x08)
	float Combination_Ch0500RotatePitchOffsetCurrent; // 0x5e8(0x04)
	bool Combination_Ch0500bRotatePitchEnable; // 0x5ec(0x01)
	char pad_5ED[0x3]; // 0x5ed(0x03)
	int32_t Combination_Ch0500BulletIndex; // 0x5f0(0x04)
	float Combination_Ch0500RotateBasePitch; // 0x5f4(0x04)
	float Combination_Ch0500PitchCorrectLimitMax; // 0x5f8(0x04)
	char pad_5FC[0x4]; // 0x5fc(0x04)
	struct UParticleSystem* Combination_Ch0500MuzzleFlash; // 0x600(0x08)
	struct ABP_CombinationVisionBullet_ch0700_C* Combination_BulletCh0700; // 0x608(0x08)
	struct FAttackCollisionInfoBP Combination_Ch0700BulletCollisionInfo; // 0x610(0xc0)
	float Combination_Ch0700DefaultBulletFirePitch; // 0x6d0(0x04)
	float Combination_Ch0700PitchCorrectLimitMin; // 0x6d4(0x04)
	float Combination_Ch0700PitchCorrectLimitMax; // 0x6d8(0x04)
	char pad_6DC[0x4]; // 0x6dc(0x04)
	struct TArray<struct ABP_CombinationVisionBullet_ch0900_C*> CombinationVisionBulletCh0900; // 0x6e0(0x10)
	int32_t Combination_Ch0500FireCount; // 0x6f0(0x04)
	float HologramAttack_Ch0100HeightMin; // 0x6f4(0x04)
	struct USkeletalMeshComponent* lDelayMesh; // 0x6f8(0x08)
	struct TArray<int32_t> HologramCostumeID; // 0x700(0x10)
	struct TArray<int32_t> HologramWeaponID; // 0x710(0x10)

	void GetAttachedCharacterMesh(enum class EPlayerID EquipPlayerID, int32_t EquipMeshIndex, struct USkeletalMeshComponent* Mesh); // Function BP_PlayerHologram.BP_PlayerHologram_C.GetAttachedCharacterMesh // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EquipAttachmentInterface(enum class EPlayerAttachment Index, int32_t AttachmentItemID, enum class EPlayerID EquipPlayerID, int32_t EquipMeshIndex, bool bDummy); // Function BP_PlayerHologram.BP_PlayerHologram_C.EquipAttachmentInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void DestroyAttachmentMeshComponent(struct USceneComponent* DestroyMeshComponent, bool bDummy); // Function BP_PlayerHologram.BP_PlayerHologram_C.DestroyAttachmentMeshComponent // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
