// BlueprintGeneratedClass BP_PlayerAIComponent.BP_PlayerAIComponent_C
// Size: 0x695 (Inherited: 0x3c0)
struct UBP_PlayerAIComponent_C : UPlayerAIBaseComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c0(0x08)
	enum class EPlayerAIMoveMode MoveMode_1; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct ARSBattlePlayer_C* OwnerPlayer; // 0x3d0(0x08)
	struct ARSBattlePlayer_C* ControlPlayer; // 0x3d8(0x08)
	bool bLeftPos_1; // 0x3e0(0x01)
	char pad_3E1[0x3]; // 0x3e1(0x03)
	struct FVector ControlPlayerDist_1; // 0x3e4(0x0c)
	struct ARSCharacterBase* BattleTargetActor_1; // 0x3f0(0x08)
	enum class EPlayerAITargetSearchModeCPP TargetSearchMode; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	struct FGameTimer UpdateTargetTimer_1; // 0x3fc(0x0c)
	bool bUpdateBattleTarget_1; // 0x408(0x01)
	char pad_409[0x3]; // 0x409(0x03)
	struct FVector2D LeftStick_1; // 0x40c(0x08)
	bool bDodgeAble_1; // 0x414(0x01)
	char pad_415[0x3]; // 0x415(0x03)
	struct TMap<struct FName, bool> bEnableInputStick_1; // 0x418(0x50)
	enum class EPlayerAIBattleThinkType CurrentBattleThink_1; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct UDataTable* ThinkTable_Free; // 0x470(0x08)
	bool bAttackHit_1; // 0x478(0x01)
	char pad_479[0x3]; // 0x479(0x03)
	struct FVector BattleTargetDist_1; // 0x47c(0x0c)
	bool bBattleModeFlag_1; // 0x488(0x01)
	char pad_489[0x3]; // 0x489(0x03)
	float MOVE_AIM_CIRRCLE_SPEED_old; // 0x48c(0x04)
	float RotateCircleAngle; // 0x490(0x04)
	bool bCircleDirClockwise_1; // 0x494(0x01)
	char pad_495[0x3]; // 0x495(0x03)
	float MoveCircleSpeed_1; // 0x498(0x04)
	enum class EPlayerAIBattleThinkParam CurrentBattleThinkParam_1; // 0x49c(0x01)
	bool bDodgeAttack_1; // 0x49d(0x01)
	char pad_49E[0x2]; // 0x49e(0x02)
	struct FGameTimer DodgeIntervalTimer_1; // 0x4a0(0x0c)
	struct FVector JumpDestination_1; // 0x4ac(0x0c)
	int32_t OrderJumpNum_1; // 0x4b8(0x04)
	bool bForceUpdateTarget_1; // 0x4bc(0x01)
	char pad_4BD[0x3]; // 0x4bd(0x03)
	int32_t AttackCount_1; // 0x4c0(0x04)
	float CONFUSION_FRIEND_PRIORITY_OFFSET_old; // 0x4c4(0x04)
	float ThinkDistance_1; // 0x4c8(0x04)
	bool bUseItemThink_1; // 0x4cc(0x01)
	enum class EConsumeItemID UseItemID_1; // 0x4cd(0x01)
	char pad_4CE[0x2]; // 0x4ce(0x02)
	struct TArray<enum class EPlayerAIBattleThinkType> StealthThinkTypeList; // 0x4d0(0x10)
	struct TArray<int32_t> StealthThinkRateList_1; // 0x4e0(0x10)
	bool bEventMove_1; // 0x4f0(0x01)
	char pad_4F1[0x7]; // 0x4f1(0x07)
	struct TArray<struct FVector> EventMovePosList_1; // 0x4f8(0x10)
	struct TArray<float> EventMoveRadiusList_1; // 0x508(0x10)
	float EventMoveWalkScale_1; // 0x518(0x04)
	enum class EPlayerAIOrder Order_1; // 0x51c(0x01)
	char pad_51D[0x3]; // 0x51d(0x03)
	struct UDataTable* ThinkTable_BF; // 0x520(0x08)
	struct UDataTable* ThinkTable_BFEnd; // 0x528(0x08)
	struct UDataTable* ThinkTable_Strong; // 0x530(0x08)
	struct UDataTable* ThinkTable_Caution; // 0x538(0x08)
	struct UDataTable* ThinkTable_Escape; // 0x540(0x08)
	float MOVE_CIRCLE_SPEED_FAR_old; // 0x548(0x04)
	bool bSelfRecoveryFlag_1; // 0x54c(0x01)
	bool bAssistItem_1; // 0x54d(0x01)
	char pad_54E[0x2]; // 0x54e(0x02)
	int32_t SelfRecoveryNum_1; // 0x550(0x04)
	enum class EPlayerAIBattleThinkType ReserveThinkType_1; // 0x554(0x01)
	enum class EPlayerAIBattleThinkParam ReserveThinkParam_1; // 0x555(0x01)
	bool bReserveNextThink_1; // 0x556(0x01)
	char pad_557[0x1]; // 0x557(0x01)
	float NoAttackTime_1; // 0x558(0x04)
	bool bOwnerENPC_1; // 0x55c(0x01)
	char pad_55D[0x3]; // 0x55d(0x03)
	int32_t CommonBranch; // 0x560(0x04)
	char pad_564[0x4]; // 0x564(0x04)
	struct FTimerHandle EvaluateLocationTimerHandle_1; // 0x568(0x08)
	bool bDebugDrawLocationEvaluate_1; // 0x570(0x01)
	bool bBeginEvaluateLocation_1; // 0x571(0x01)
	char pad_572[0x2]; // 0x572(0x02)
	struct FVector CurrentGoalBaseLocation_1; // 0x574(0x0c)
	struct ABP_PlayerAiGoalActor_C* BPMoveGoalActor; // 0x580(0x08)
	float CurrentGoalArmLength_1; // 0x588(0x04)
	float CurrentGoalYaw_1; // 0x58c(0x04)
	bool bFirstEvaluate_1; // 0x590(0x01)
	char pad_591[0x3]; // 0x591(0x03)
	struct FVector PrevThinkLastActorForward_1; // 0x594(0x0c)
	bool bCircleNear_1; // 0x5a0(0x01)
	char pad_5A1[0x3]; // 0x5a1(0x03)
	struct FGameTimer NearCircleMoveTimer_1; // 0x5a4(0x0c)
	float NearCircleMoveNearDist_1; // 0x5b0(0x04)
	float NearCircleMoveFarDist_1; // 0x5b4(0x04)
	struct FVector BattleDodgeDir_1; // 0x5b8(0x0c)
	char pad_5C4[0x4]; // 0x5c4(0x04)
	struct UDataTable* TargetEvaluateTable; // 0x5c8(0x08)
	struct TArray<struct FPlayerAIEvaluateTargetParameter> TargetEvaluateTableData; // 0x5d0(0x10)
	bool bResetBehaviorTree_1; // 0x5e0(0x01)
	char pad_5E1[0x3]; // 0x5e1(0x03)
	float InitialTargetLength_1; // 0x5e4(0x04)
	struct FName ClaimantNameEventMove_1; // 0x5e8(0x08)
	float BattleTargetAngle_1; // 0x5f0(0x04)
	bool bDodgeRangeAttack_1; // 0x5f4(0x01)
	char pad_5F5[0x3]; // 0x5f5(0x03)
	struct FVector DodgeRangeAttackDir_1; // 0x5f8(0x0c)
	struct FVector JumpDir_1; // 0x604(0x0c)
	bool bMoveStickBack_1; // 0x610(0x01)
	enum class ECharacterHitPriority StoreCharacterHitPriority_1; // 0x611(0x01)
	bool bStoreCharacterHitPriority_1; // 0x612(0x01)
	bool bEventMoveAfterWait_1; // 0x613(0x01)
	float DodgeIntervalTime_1; // 0x614(0x04)
	bool bEventWait_1; // 0x618(0x01)
	bool OpenBrainField; // 0x619(0x01)
	enum class EPlayerAIThinkTableType CurrentThinkTableType_1; // 0x61a(0x01)
	bool bEnableInterruptAction; // 0x61b(0x01)
	char pad_61C[0x4]; // 0x61c(0x04)
	struct UDataTable* ThinkTable_Drive; // 0x620(0x08)
	struct TArray<struct FSNpcSelfRecoveryData> SelfRecoveryDataCommon; // 0x628(0x10)
	struct TArray<struct FSNpcSelfRecoveryData> SelfRecoveryDataWary; // 0x638(0x10)
	bool bFinishMetamorphosis_1; // 0x648(0x01)
	char pad_649[0x3]; // 0x649(0x03)
	int32_t ThinkPhaseTransition_1; // 0x64c(0x04)
	bool bDisableTargetChangeResetThink_1; // 0x650(0x01)
	char pad_651[0x7]; // 0x651(0x07)
	struct UDataTable* ThinkTable_Unique00; // 0x658(0x08)
	struct TArray<struct FSNpcSelfRecoveryData> SelfRecoveryDataLimit; // 0x660(0x10)
	bool bInvalidKeepOut_1; // 0x670(0x01)
	char pad_671[0x7]; // 0x671(0x07)
	struct UDataTable* ThinkTable_Unique01; // 0x678(0x08)
	struct UDataTable* ThinkTable_Unique02; // 0x680(0x08)
	struct UDataTable* PlayerAIParameterTable; // 0x688(0x08)
	bool bBattleActionStartFlag_1; // 0x690(0x01)
	bool bReserveBehaviorTreeRun; // 0x691(0x01)
	bool bRunBehaviorTree; // 0x692(0x01)
	bool bMetamorphosisCharacter; // 0x693(0x01)
	bool bStartLastAttack; // 0x694(0x01)

	struct TArray<enum class EObjectTypeQuery> GetCollisionObjectTypesForGroundHit_CallFromCPP(); // Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.GetCollisionObjectTypesForGroundHit_CallFromCPP // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CheckSelfRecovery_CallFromCPP(); // Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.CheckSelfRecovery_CallFromCPP // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	float CalcTargetEvaluate_CallFromCPP(struct ARSCharacterBase* EvaluateTarget); // Function BP_PlayerAIComponent.BP_PlayerAIComponent_C.CalcTargetEvaluate_CallFromCPP // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
