// BlueprintGeneratedClass BP_Param_em0300.BP_Param_em0300_C
// Size: 0x168 (Inherited: 0xc0)
struct UBP_Param_em0300_C : UActorComponent {
	float ArmorChangeIgnoreTime; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct TArray<float> elapsedSeconds; // 0xc8(0x10)
	struct TArray<float> ElapsedProbability; // 0xd8(0x10)
	struct TArray<int32_t> WeakHitCount; // 0xe8(0x10)
	struct TArray<float> WeakHitProbability; // 0xf8(0x10)
	struct TArray<int32_t> ArmorHitCount; // 0x108(0x10)
	struct TArray<float> ArmorHitProbability; // 0x118(0x10)
	int32_t BallWayNum; // 0x128(0x04)
	float BallWayDegree; // 0x12c(0x04)
	float CeilingLostWaitSecond; // 0x130(0x04)
	float CeilingLostLandingSecond; // 0x134(0x04)
	float ResurectionNoAttackPercent; // 0x138(0x04)
	bool IsAimBackRun; // 0x13c(0x01)
	bool IsMapGimmickActive; // 0x13d(0x01)
	char pad_13E[0x2]; // 0x13e(0x02)
	int32_t ScatterNum; // 0x140(0x04)
	float SerchDistance; // 0x144(0x04)
	float LockDistance; // 0x148(0x04)
	float ScatterSpawnRandRange; // 0x14c(0x04)
	int32_t CeilingSprinklerMin; // 0x150(0x04)
	int32_t CeilingSprinklerMax; // 0x154(0x04)
	float BrainTalkAfterThreatSecond; // 0x158(0x04)
	bool BallNoTargetMove; // 0x15c(0x01)
	char pad_15D[0x3]; // 0x15d(0x03)
	float MapGimmickAfterActionDelaySecond; // 0x160(0x04)
	float em0320JumpPermissionSecond; // 0x164(0x04)
};

