// BlueprintGeneratedClass BP_Param_em0600.BP_Param_em0600_C
// Size: 0xe4 (Inherited: 0xc0)
struct UBP_Param_em0600_C : UActorComponent {
	float SmallAttackMiddle_Probability; // 0xc0(0x04)
	float RunSpeed; // 0xc4(0x04)
	float addspeed; // 0xc8(0x04)
	float RunTime; // 0xcc(0x04)
	float FlameCrashBonusRate; // 0xd0(0x04)
	float PossibleAvatarHpPercent; // 0xd4(0x04)
	float DecreaseHpRate; // 0xd8(0x04)
	float AvatarAddLength; // 0xdc(0x04)
	float AvatarAddAngle; // 0xe0(0x04)
};

