// BlueprintGeneratedClass BP_SoundManager.BP_SoundManager_C
// Size: 0x741 (Inherited: 0x4d8)
struct ABP_SoundManager_C : ARSSoundManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4d8(0x08)
	struct USIWManager_C* SIWManager; // 0x4e0(0x08)
	struct UBP_RSCvManager_C* BP_RSCvManager; // 0x4e8(0x08)
	struct UBP_EnvComponent_C* EnvComponent; // 0x4f0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x4f8(0x08)
	struct TArray<struct UAtomComponent*> TempComponents; // 0x500(0x10)
	bool IsBattling; // 0x510(0x01)
	char pad_511[0x7]; // 0x511(0x07)
	struct TArray<struct FRSCollisionSound> CollisionSoundArray; // 0x518(0x10)
	struct TSoftObjectPtr<USoundAtomCue> BgmBrainFieldCue; // 0x528(0x28)
	struct TSoftObjectPtr<USoundAtomCue> BgmSpBrainFieldCue; // 0x550(0x28)
	struct TSoftObjectPtr<USoundAtomCue> MeBattleOutCue; // 0x578(0x28)
	bool IgnoreChangeBattleBgm; // 0x5a0(0x01)
	char pad_5A1[0x7]; // 0x5a1(0x07)
	struct USoundAtomCue* LevelBgmCue; // 0x5a8(0x08)
	struct USoundAtomCue* LevelEnvCue; // 0x5b0(0x08)
	struct USoundAtomCue* LastBgmCue; // 0x5b8(0x08)
	enum class EBgmCategory LastBgmCategory; // 0x5c0(0x01)
	char pad_5C1[0x3]; // 0x5c1(0x03)
	float LastBgmVolume; // 0x5c4(0x04)
	struct USoundAtomCue* ShopBeforeBgmCue; // 0x5c8(0x08)
	enum class EBgmCategory ShopBeforeBgmCategory; // 0x5d0(0x01)
	char pad_5D1[0x3]; // 0x5d1(0x03)
	float ShopBeforeBgmVolume; // 0x5d4(0x04)
	bool ShopBeforeSaveFlag; // 0x5d8(0x01)
	char pad_5D9[0x7]; // 0x5d9(0x07)
	struct TArray<struct TSoftObjectPtr<USoundAtomCueSheet>> LoadCueSheetList; // 0x5e0(0x10)
	enum class ESoundState LastSoundState; // 0x5f0(0x01)
	char pad_5F1[0x3]; // 0x5f1(0x03)
	float menuStateVolumeBackupSe_Env; // 0x5f4(0x04)
	float NonPlayerCueSheetVolume; // 0x5f8(0x04)
	bool isDriving; // 0x5fc(0x01)
	char pad_5FD[0x3]; // 0x5fd(0x03)
	struct FSoundSnapshot DSPBus_SnapShot; // 0x600(0x08)
	struct FFSasCutInVoiceData SasCutInVoiceVar; // 0x608(0x30)
	struct TSoftObjectPtr<USoundAtomCue> tmpCueRef1; // 0x638(0x28)
	struct TSoftObjectPtr<USoundAtomCue> tmpCueRef2; // 0x660(0x28)
	enum class EBgmCategory LevelBgmCategory; // 0x688(0x01)
	char pad_689[0x7]; // 0x689(0x07)
	struct USoundAtomCue* LevelBgmCtrlCue; // 0x690(0x08)
	struct FString ConstSelectorName; // 0x698(0x10)
	bool isBattleFieldActive; // 0x6a8(0x01)
	bool DriveAtLoaction; // 0x6a9(0x01)
	enum class EBgmCategory PreviousBgmCategoryByBrainField; // 0x6aa(0x01)
	bool isTitle; // 0x6ab(0x01)
	bool isEventInProgress; // 0x6ac(0x01)
	bool isDriveOut; // 0x6ad(0x01)
	bool battleIoBufSwitch; // 0x6ae(0x01)
	char pad_6AF[0x1]; // 0x6af(0x01)
	int32_t tmpExpBeforeBattle; // 0x6b0(0x04)
	bool changingLocation; // 0x6b4(0x01)
	bool isSkipping; // 0x6b5(0x01)
	char pad_6B6[0x2]; // 0x6b6(0x02)
	struct USoundAtomCue* TmpAtomCue; // 0x6b8(0x08)
	struct FName ChangeLevelSoundLabel; // 0x6c0(0x08)
	bool isApllyChangeLevelSoundOnEventIn; // 0x6c8(0x01)
	char pad_6C9[0x7]; // 0x6c9(0x07)
	struct UDataTable* AlertSoundSpecification; // 0x6d0(0x08)
	struct FFAlertSoundSpecification fAlertSound; // 0x6d8(0x38)
	struct URSAtomComponentBase* AlertSound; // 0x710(0x08)
	int32_t ProgressIdTmp; // 0x718(0x04)
	bool PlayNow; // 0x71c(0x01)
	char pad_71D[0x3]; // 0x71d(0x03)
	int32_t DriveBgmLevel; // 0x720(0x04)
	char pad_724[0x4]; // 0x724(0x04)
	struct URSAtomComponentBase* DriveModifyAtomComponentRef; // 0x728(0x08)
	struct TArray<struct TSoftObjectPtr<USoundAtomCue>> DriveResumeCue; // 0x730(0x10)
	bool isDrivePause; // 0x740(0x01)

	bool EventManagerEnd(bool RestoreEnableTick, bool RestoreVisibility); // Function BP_SoundManager.BP_SoundManager_C.EventManagerEnd // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool EventManagerStart(bool EnableTick, bool Visibility); // Function BP_SoundManager.BP_SoundManager_C.EventManagerStart // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SAS_CommonEnd(enum class E_SASKind SAS_Kind, bool bCancelSASCost, bool bDummy, float RemainTime); // Function BP_SoundManager.BP_SoundManager_C.SAS_CommonEnd // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SAS_CommonStart(struct FFSASCommand SAS_Command, bool dummy); // Function BP_SoundManager.BP_SoundManager_C.SAS_CommonStart // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
