// BlueprintGeneratedClass BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C
// Size: 0xaa3 (Inherited: 0xc0)
struct UBP_UniqueObjectComponentBase_C : UActorComponent {
	struct UBP_PsychicComponentMain_C* PsyCompMain; // 0xc0(0x08)
	struct UBP_PsychicObjectComponent_C* PsyObjComp; // 0xc8(0x08)
	struct FUniqueObjectCommonParameter UnqObjParameter; // 0xd0(0x30)
	bool bInputWaitNotify; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	float InputDelayTime; // 0x104(0x04)
	float InputWaitTime; // 0x108(0x04)
	float InputDilationRate; // 0x10c(0x04)
	bool bInputWait; // 0x110(0x01)
	bool bInputPause; // 0x111(0x01)
	bool bInputWaitEnable; // 0x112(0x01)
	bool bInputWaitCancel; // 0x113(0x01)
	bool bCallUniqueInputStart; // 0x114(0x01)
	bool bInputSuccess; // 0x115(0x01)
	bool bInputSuccessWaitAttack; // 0x116(0x01)
	bool bInputFailure; // 0x117(0x01)
	bool bInputCancel; // 0x118(0x01)
	bool bInputCancelSkip; // 0x119(0x01)
	bool bInputDelay; // 0x11a(0x01)
	bool bRequestAsyncInputDelay; // 0x11b(0x01)
	bool bAsyncInputDelay; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
	struct FGameTimer InputDelayTimer; // 0x120(0x0c)
	bool bRequestAsyncInputWait; // 0x12c(0x01)
	bool bAsyncInputWait; // 0x12d(0x01)
	bool bInputWaitSkipUpdateTimer; // 0x12e(0x01)
	char pad_12F[0x1]; // 0x12f(0x01)
	struct FGameTimer InputWaitTimer; // 0x130(0x0c)
	float InputTimeDilationRate; // 0x13c(0x04)
	struct FString InputTimeDailtionName; // 0x140(0x10)
	bool bUniqueAttackInputSignOld; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct TArray<enum class EPsychicObjectUniqueInputButton> UniqueAttackInputButton; // 0x158(0x10)
	struct TArray<enum class EPsychicObjectUniqueInputType> UniqueAttackIputType; // 0x168(0x10)
	struct TArray<bool> UniqueAttackInputSuccess; // 0x178(0x10)
	bool bCheckInputReturn; // 0x188(0x01)
	bool bCheckInputSuccess; // 0x189(0x01)
	bool bLastThrow; // 0x18a(0x01)
	bool bDelayDeath; // 0x18b(0x01)
	float DelayDeathTime; // 0x18c(0x04)
	struct FGameTimer DelayDeathTimer; // 0x190(0x0c)
	bool bRequestAsyncCommon; // 0x19c(0x01)
	bool bAsyncCommon; // 0x19d(0x01)
	bool bInputObject; // 0x19e(0x01)
	char pad_19F[0x1]; // 0x19f(0x01)
	struct TArray<bool> CommonFlag; // 0x1a0(0x10)
	int32_t InputStep; // 0x1b0(0x04)
	int32_t InputSectorMax; // 0x1b4(0x04)
	int32_t InputSector; // 0x1b8(0x04)
	bool bInputStepDir; // 0x1bc(0x01)
	bool bInputTypeRapid; // 0x1bd(0x01)
	char pad_1BE[0x2]; // 0x1be(0x02)
	int32_t InputRapidMax; // 0x1c0(0x04)
	int32_t InputRapidCount; // 0x1c4(0x04)
	bool bInputEnableTime; // 0x1c8(0x01)
	char pad_1C9[0x3]; // 0x1c9(0x03)
	float InputEnableTime; // 0x1cc(0x04)
	struct FGameTimer InputEnableTimer; // 0x1d0(0x0c)
	bool bInputSetting; // 0x1dc(0x01)
	char pad_1DD[0x3]; // 0x1dd(0x03)
	int32_t InputIndex; // 0x1e0(0x04)
	int32_t InputMax; // 0x1e4(0x04)
	bool bInputGuide; // 0x1e8(0x01)
	bool bInputGuidePos; // 0x1e9(0x01)
	char pad_1EA[0x2]; // 0x1ea(0x02)
	struct FVector InputGuidePos; // 0x1ec(0x0c)
	float GuideTargetRateInput; // 0x1f8(0x04)
	float GuideTargetRateAttack; // 0x1fc(0x04)
	bool bGuideDirectInput; // 0x200(0x01)
	bool bGuideDirectAttack; // 0x201(0x01)
	bool bGuideDirectInputProc; // 0x202(0x01)
	bool bGuideDirectAttackProc; // 0x203(0x01)
	bool bInputGuideAutoOff; // 0x204(0x01)
	bool bInputGuideToWait; // 0x205(0x01)
	bool bGuideUseActorPos; // 0x206(0x01)
	char pad_207[0x1]; // 0x207(0x01)
	float GuideLerpTimeInput; // 0x208(0x04)
	float GuideLerpTimeAttack; // 0x20c(0x04)
	bool bInputExtra; // 0x210(0x01)
	bool bInputExtraProc; // 0x211(0x01)
	bool bInputExtraFirst; // 0x212(0x01)
	char pad_213[0x1]; // 0x213(0x01)
	float InputExtraTime; // 0x214(0x04)
	float InputExtraTimeTotal; // 0x218(0x04)
	struct FGameTimer InputExtraTimer; // 0x21c(0x0c)
	bool bDbPrintInputExtra; // 0x228(0x01)
	bool bDbPrintInputRotate; // 0x229(0x01)
	bool bDbPrintAttackCheck; // 0x22a(0x01)
	bool bDbPrintCancel; // 0x22b(0x01)
	bool bDbCheckDestroy; // 0x22c(0x01)
	bool bDebugDrawUniqueRideCapsule; // 0x22d(0x01)
	bool bDebugDrawUniqueRideLocRot; // 0x22e(0x01)
	bool bDebugDrawInputWait; // 0x22f(0x01)
	bool bDebugPrintFloatSuspension; // 0x230(0x01)
	bool bInputTypeHold; // 0x231(0x01)
	bool bCheckInputHold; // 0x232(0x01)
	bool bInputMoveMouse; // 0x233(0x01)
	bool bInputStickTriggerLt; // 0x234(0x01)
	bool bInputStickTriggerRt; // 0x235(0x01)
	bool bInputExtraCancel; // 0x236(0x01)
	bool bUniqueRebound; // 0x237(0x01)
	bool bUniqueReboundTargetBase; // 0x238(0x01)
	bool bUniqueReboundTargetTop; // 0x239(0x01)
	char pad_23A[0x2]; // 0x23a(0x02)
	struct FVector UniqueReboundPosOffset; // 0x23c(0x0c)
	struct FVector UniqueReboundPos; // 0x248(0x0c)
	struct FVector UniqueReboundDirection; // 0x254(0x0c)
	bool bInputDelayToGuide; // 0x260(0x01)
	bool bInputDelayCancel; // 0x261(0x01)
	bool bDelayDeathCheckHitOld; // 0x262(0x01)
	bool bInputTypeRotate; // 0x263(0x01)
	bool bGuideCheckHit; // 0x264(0x01)
	char pad_265[0x3]; // 0x265(0x03)
	float GuideHitCheckTime; // 0x268(0x04)
	struct FGameTimer GuideHitCheckTimer; // 0x26c(0x0c)
	bool bAttackCheck; // 0x278(0x01)
	bool bHitTarget; // 0x279(0x01)
	bool bHitTargetSingle; // 0x27a(0x01)
	bool bNextAttackUnique; // 0x27b(0x01)
	bool bAnimNotifyFirstAttack; // 0x27c(0x01)
	bool bAttackCheckSkip; // 0x27d(0x01)
	char pad_27E[0x2]; // 0x27e(0x02)
	float AttackCheckTime; // 0x280(0x04)
	struct FGameTimer AttackCheckTimer; // 0x284(0x0c)
	bool InputExtraSkipTimeDilation; // 0x290(0x01)
	bool InputExtraSkipPostProcess; // 0x291(0x01)
	bool bInputWaitSkipTimeDilation; // 0x292(0x01)
	bool bInputWaitSkipPostProcess; // 0x293(0x01)
	bool bInputTypeRepeat; // 0x294(0x01)
	bool bInputTypeRepeatFirst; // 0x295(0x01)
	char pad_296[0x2]; // 0x296(0x02)
	int32_t InputRepeatMax; // 0x298(0x04)
	int32_t InputRepeatCount; // 0x29c(0x04)
	bool bLinearDamp; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	float LinearDampBackUp; // 0x2a4(0x04)
	float LinearDampValue; // 0x2a8(0x04)
	float LinearDampTime; // 0x2ac(0x04)
	struct FGameTimer LinearDampTimer; // 0x2b0(0x0c)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct FString AttackRowNameKey; // 0x2c0(0x10)
	struct TArray<struct FName> AttackRowNameList; // 0x2d0(0x10)
	int32_t AttackInfoIndex; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct TArray<struct FHCCollisionCommonInfo> AttackCommonInfoList; // 0x2e8(0x10)
	struct TArray<struct FHCSkillCommonInfo> AttackSkillInfoList; // 0x2f8(0x10)
	struct TArray<struct FUniqueObjectAttackInfo> AttackInfoList; // 0x308(0x10)
	enum class EPsychicObjectUniqueInputType InputLeftType; // 0x318(0x01)
	enum class EPsychicObjectUniqueInputType InputCentreType; // 0x319(0x01)
	enum class EPsychicObjectUniqueInputType InputRightType; // 0x31a(0x01)
	enum class EPsychicObjectUniqueInputButton InputLeftButton; // 0x31b(0x01)
	enum class EPsychicObjectUniqueInputButton InputCentreButton; // 0x31c(0x01)
	enum class EPsychicObjectUniqueInputButton InputRightButton; // 0x31d(0x01)
	char pad_31E[0x2]; // 0x31e(0x02)
	struct UAnimMontage* MontageCancel; // 0x320(0x08)
	bool bUniquePress; // 0x328(0x01)
	bool bUniquePressHit; // 0x329(0x01)
	bool bUniquePressTargetLocation; // 0x32a(0x01)
	bool bUniquePressFixHeight; // 0x32b(0x01)
	bool bUniquePressTraceHeight; // 0x32c(0x01)
	bool bUniquePressUpdateHeight; // 0x32d(0x01)
	char pad_32E[0x2]; // 0x32e(0x02)
	struct UCurveFloat* UniquePressPosCurve; // 0x330(0x08)
	bool bUniquePressHeightRange; // 0x338(0x01)
	char pad_339[0x3]; // 0x339(0x03)
	float UniquePressHeightRange; // 0x33c(0x04)
	float UniquePressHeight; // 0x340(0x04)
	float UniquePressRotLerpTime; // 0x344(0x04)
	struct FGameTimer UniquePressTimer; // 0x348(0x0c)
	struct FGameTimer UniquePressRotTimer; // 0x354(0x0c)
	float UniquePressHeightStt; // 0x360(0x04)
	float UniquePressHeightEnd; // 0x364(0x04)
	struct FVector WorkLerpPosStt; // 0x368(0x0c)
	struct FRotator WorkLerpRotStt; // 0x374(0x0c)
	struct FVector WorkLerpPosEnd; // 0x380(0x0c)
	struct FRotator WorkLerpRotEnd; // 0x38c(0x0c)
	struct FVector WorkObjPos; // 0x398(0x0c)
	struct FRotator WorkObjRot; // 0x3a4(0x0c)
	bool bUniqueExplosion; // 0x3b0(0x01)
	char pad_3B1[0x3]; // 0x3b1(0x03)
	float UniqueExplosionTime; // 0x3b4(0x04)
	float UniqueExplosionRadius; // 0x3b8(0x04)
	struct FGameTimer UniqueExplosionTimer; // 0x3bc(0x0c)
	bool bWaitAttackNotify; // 0x3c8(0x01)
	char pad_3C9[0x3]; // 0x3c9(0x03)
	struct FVector UniquePressPos; // 0x3cc(0x0c)
	bool bUniquePressVibrate; // 0x3d8(0x01)
	bool bUniquePressVibrateLoop; // 0x3d9(0x01)
	bool bUniquePressVibrateLoopProc; // 0x3da(0x01)
	char pad_3DB[0x5]; // 0x3db(0x05)
	struct UCurveVector* UniquePressVibrateLoopCurve; // 0x3e0(0x08)
	struct FVector UniquePressVibrateLoopScale; // 0x3e8(0x0c)
	float UniquePressVibrateLoopTimer; // 0x3f4(0x04)
	float UniquePressVibrateLoopTime; // 0x3f8(0x04)
	float UniquePressVibrateLoopTimeRate; // 0x3fc(0x04)
	bool bUniquePressVibrateLoopHit; // 0x400(0x01)
	char pad_401[0x3]; // 0x401(0x03)
	struct FGameTimer UniquePressVibrateLoopHitTimer; // 0x404(0x0c)
	struct FVector UniquePressVibrateLoopHitScale; // 0x410(0x0c)
	float UniquePressVibrateLoopHitTimeRate; // 0x41c(0x04)
	float UniquePressVibrateLoopHitTime; // 0x420(0x04)
	bool bUseNewCancel; // 0x424(0x01)
	bool bUseNewFailure; // 0x425(0x01)
	bool bUniqueBend; // 0x426(0x01)
	bool bUniqueBendProc; // 0x427(0x01)
	bool bUniqueBendSelf; // 0x428(0x01)
	bool bUniqueBended; // 0x429(0x01)
	char pad_42A[0x6]; // 0x42a(0x06)
	struct UCurveFloat* UniqueBendAngleCurve; // 0x430(0x08)
	float UniqueBendAngleRate; // 0x438(0x04)
	float UniqueBendTimeRate; // 0x43c(0x04)
	struct FGameTimer UniqueBendTimer; // 0x440(0x0c)
	float UniqueBendTime; // 0x44c(0x04)
	float UniqueBendRate; // 0x450(0x04)
	float UniqueBendHeightMax; // 0x454(0x04)
	float UniqueBendHeight; // 0x458(0x04)
	struct FVector UniqueBendAxis; // 0x45c(0x0c)
	struct FVector UniqueBendPos; // 0x468(0x0c)
	struct FVector UniqueBendPosOffsetStt; // 0x474(0x0c)
	struct FVector UniqueBendPosOffsetEnd; // 0x480(0x0c)
	struct FRotator UniqueBendRotStt; // 0x48c(0x0c)
	struct FRotator UniqueBendRotEnd; // 0x498(0x0c)
	struct FRotator UniqueBendRot; // 0x4a4(0x0c)
	struct TArray<struct AActor*> UnqObjStateEnemyList; // 0x4b0(0x10)
	bool bUniquePressVibrateDir; // 0x4c0(0x01)
	char pad_4C1[0x3]; // 0x4c1(0x03)
	float UniquePressVibrateTimeMin; // 0x4c4(0x04)
	float UniquePressVibrateTimeMax; // 0x4c8(0x04)
	float UniquePressVibrateSpeedMin; // 0x4cc(0x04)
	float UniquePressVibrateSpeedMax; // 0x4d0(0x04)
	float UniquePressVibrateSpeed; // 0x4d4(0x04)
	float UniquePressVibrateRangeMin; // 0x4d8(0x04)
	float UniquePressVibrateRangeMax; // 0x4dc(0x04)
	float UniquePressVibrateRange; // 0x4e0(0x04)
	struct FGameTimer UniquePressVibrateTimer; // 0x4e4(0x0c)
	float UniquePressVibrateOffset; // 0x4f0(0x04)
	struct FVector UniquePressVibrateOffset2; // 0x4f4(0x0c)
	struct TArray<float> DamageMaterialValueList; // 0x500(0x10)
	int32_t DamageMaterialLevel; // 0x510(0x04)
	char pad_514[0x4]; // 0x514(0x04)
	struct ARsBattleHero_C* CameraOwner; // 0x518(0x08)
	struct FName CameraRowName; // 0x520(0x08)
	struct FUniqueObjectCameraParameter CameraParameter; // 0x528(0x38)
	struct FCameraUniqueObjectParameter UniqueObjectCameraParameter; // 0x560(0x58)
	bool bUniqueCameraTypeNormal; // 0x5b8(0x01)
	bool bUniqueCameraTypeSocket; // 0x5b9(0x01)
	bool bUniqueCameraTypeControl; // 0x5ba(0x01)
	bool bUniqueCameraTypeRemote; // 0x5bb(0x01)
	bool bUniqueCameraTriggerInfo; // 0x5bc(0x01)
	bool bUniqueCameraBackupRootLerp; // 0x5bd(0x01)
	bool bUniqueCameraBackupLockRoot; // 0x5be(0x01)
	char pad_5BF[0x1]; // 0x5bf(0x01)
	float UniqueCameraResetTime; // 0x5c0(0x04)
	int32_t UniqueCameraSideIndex; // 0x5c4(0x04)
	struct FVector UniqueCameraTargetPos; // 0x5c8(0x0c)
	bool bUniqueCameraCheck; // 0x5d4(0x01)
	bool bInputTypeDuel; // 0x5d5(0x01)
	bool bInputTypeControl; // 0x5d6(0x01)
	bool bDelayDeathCheckSuccess; // 0x5d7(0x01)
	bool bDelayDeathCheckLastHit; // 0x5d8(0x01)
	bool bDelayDeathCheckSkip; // 0x5d9(0x01)
	char pad_5DA[0x2]; // 0x5da(0x02)
	struct FVector WeightGaugePosOffset; // 0x5dc(0x0c)
	bool bCapturePos; // 0x5e8(0x01)
	char pad_5E9[0x7]; // 0x5e9(0x07)
	struct UCurveVector* CapturePosCurve; // 0x5f0(0x08)
	struct FVector CapturePosRate; // 0x5f8(0x0c)
	struct FVector CapturePosOffset; // 0x604(0x0c)
	bool bCaptureVibratePos; // 0x610(0x01)
	char pad_611[0x7]; // 0x611(0x07)
	struct UCurveVector* CaptureVibratePosCurve; // 0x618(0x08)
	struct FVector CaptureVibratePosRate; // 0x620(0x0c)
	struct FVector CaptureVibratePosOffset; // 0x62c(0x0c)
	bool bCaptureVibrateRot; // 0x638(0x01)
	char pad_639[0x7]; // 0x639(0x07)
	struct UCurveVector* CaptureVibrateRotCurve; // 0x640(0x08)
	struct FVector CaptureVibrateRotRate; // 0x648(0x0c)
	struct FRotator CaptureVibrateRotOffset; // 0x654(0x0c)
	bool bCaptureWaitAttack; // 0x660(0x01)
	bool bUseNewCommon; // 0x661(0x01)
	bool bGroundSlope; // 0x662(0x01)
	bool bGroundSlopeNextLocation; // 0x663(0x01)
	bool bGroundSlopeFailed; // 0x664(0x01)
	bool bGroundSlopeFloat; // 0x665(0x01)
	bool bGroundSlopeFall; // 0x666(0x01)
	char pad_667[0x1]; // 0x667(0x01)
	struct TArray<struct FVector> GroundSlopeOffsetList; // 0x668(0x10)
	struct FVector GroundSlopeFrontDirHz; // 0x678(0x0c)
	struct FVector GroundSlopeNormal; // 0x684(0x0c)
	struct FVector GroundSlopeLocation; // 0x690(0x0c)
	struct FVector GroundSlopeLocationNext; // 0x69c(0x0c)
	bool bUniqueRide; // 0x6a8(0x01)
	char pad_6A9[0x3]; // 0x6a9(0x03)
	float UniqueRideSpeed; // 0x6ac(0x04)
	float UniqueRideSpeedMax; // 0x6b0(0x04)
	float UniqueRideAccel; // 0x6b4(0x04)
	bool bUniqueRideDecel; // 0x6b8(0x01)
	char pad_6B9[0x3]; // 0x6b9(0x03)
	float UniqueRideDecel; // 0x6bc(0x04)
	bool bUniqueRideDecelStop; // 0x6c0(0x01)
	char pad_6C1[0x3]; // 0x6c1(0x03)
	float UniqueRideDecelStopTime; // 0x6c4(0x04)
	struct FGameTimer UniqueRideDecelStopTimer; // 0x6c8(0x0c)
	float UniqueRideDecelStopSpeedStt; // 0x6d4(0x04)
	enum class EEasingFunc UniqueRideDecelStopEaseFunction; // 0x6d8(0x01)
	char pad_6D9[0x3]; // 0x6d9(0x03)
	float UniqueRideDecelStopEaseBlendExp; // 0x6dc(0x04)
	float UniqueRideTurnSpeed; // 0x6e0(0x04)
	float UniqueRideTurnSpeedMax; // 0x6e4(0x04)
	float UniqueRideTurnAccel; // 0x6e8(0x04)
	float UniqueRideTurnDecel; // 0x6ec(0x04)
	float UniqueRideTurnRate; // 0x6f0(0x04)
	struct FVector UniqueRidePos; // 0x6f4(0x0c)
	struct FVector UniqueRidePosOffset; // 0x700(0x0c)
	struct FRotator UniqueRideRot; // 0x70c(0x0c)
	bool bUniqueRideCheckBg; // 0x718(0x01)
	bool bUniqueRideChkBgHit; // 0x719(0x01)
	char pad_71A[0x2]; // 0x71a(0x02)
	struct FVector UniqueRideChkBgAdjustPos; // 0x71c(0x0c)
	float UniqueRideChkBgAdjustAngle; // 0x728(0x04)
	bool bInputRotateFirst; // 0x72c(0x01)
	bool bThrowMontageCancelCheck; // 0x72d(0x01)
	bool bThrowMontageCancel; // 0x72e(0x01)
	char pad_72F[0x1]; // 0x72f(0x01)
	struct FGameTimer ThrowMontageCancelTimer; // 0x730(0x0c)
	float ThrowMontageCancelTime; // 0x73c(0x04)
	bool bUniqueCameraHitLerp; // 0x740(0x01)
	char pad_741[0x3]; // 0x741(0x03)
	struct FGameTimer UniqueCameraHitLerpTimer; // 0x744(0x0c)
	float UniqueCameraHitLerpTime; // 0x750(0x04)
	float UniqueCameraHitLerpStt; // 0x754(0x04)
	float UniqueCameraHitLerpEnd; // 0x758(0x04)
	enum class EEasingFunc UniqueCameraHitLerpEaseType; // 0x75c(0x01)
	char pad_75D[0x3]; // 0x75d(0x03)
	struct URSAtomComponentBase* SeCompInputGuage; // 0x760(0x08)
	bool bNewElectricPole; // 0x768(0x01)
	bool bDispHitDamageMesh; // 0x769(0x01)
	char pad_76A[0x6]; // 0x76a(0x06)
	struct TArray<struct UStaticMesh*> HitDamageMeshList; // 0x770(0x10)
	struct UStaticMesh* HitBackupMesh; // 0x780(0x08)
	bool bCallUniqueObjectEnd; // 0x788(0x01)
	char pad_789[0x7]; // 0x789(0x07)
	struct USoundAtomCue* SoundInputStart; // 0x790(0x08)
	struct USoundAtomCue* SoundInputRepeat; // 0x798(0x08)
	struct USoundAtomCue* SoundInputRotate; // 0x7a0(0x08)
	struct TArray<float> PlayerLerpAngleList; // 0x7a8(0x10)
	float PlayerLerpTraceDistance; // 0x7b8(0x04)
	float PlayerLerpDistance; // 0x7bc(0x04)
	float EnemyLerpDistance; // 0x7c0(0x04)
	float EnemyLerpRate; // 0x7c4(0x04)
	bool bUniqueRideImpactOverWrite; // 0x7c8(0x01)
	char pad_7C9[0x3]; // 0x7c9(0x03)
	float UniqueRideImpactMass; // 0x7cc(0x04)
	float UniqueRideObjMass; // 0x7d0(0x04)
	bool bUniqueRideTimer; // 0x7d4(0x01)
	char pad_7D5[0x3]; // 0x7d5(0x03)
	struct FGameTimer UniqueRideTimer; // 0x7d8(0x0c)
	float UniqueRideTime; // 0x7e4(0x04)
	bool bInputTypeOneRepeat; // 0x7e8(0x01)
	bool bFirstAttackThrow; // 0x7e9(0x01)
	bool bSkipAddGauge; // 0x7ea(0x01)
	bool bCallAddGaugeEnable; // 0x7eb(0x01)
	bool bNewUnqObjCam; // 0x7ec(0x01)
	char pad_7ED[0x3]; // 0x7ed(0x03)
	struct TMap<int32_t, struct FString> CommonIndex; // 0x7f0(0x50)
	bool bLookAtObjUseSelfDelay; // 0x840(0x01)
	bool bLookAtObjEndDelay; // 0x841(0x01)
	char pad_842[0x2]; // 0x842(0x02)
	float UniqueReboundInterpolationSpeed; // 0x844(0x04)
	float GroundSlopeTraceUp; // 0x848(0x04)
	float GroundSlopeTraceDn; // 0x84c(0x04)
	float UniqueRideDropSpeed; // 0x850(0x04)
	float UniqueRideDropSpeedMax; // 0x854(0x04)
	float UniqueRideDropAccel; // 0x858(0x04)
	float UniqueRideDropAccelSecond; // 0x85c(0x04)
	struct FName SocketPlayerName; // 0x860(0x08)
	bool bDebugPrintGroundSlope; // 0x868(0x01)
	bool bEmKarenObj; // 0x869(0x01)
	bool bHitTargetInvincible; // 0x86a(0x01)
	bool bUniqueScaleChange; // 0x86b(0x01)
	struct FGameTimer UniqueScaleChangeTimer; // 0x86c(0x0c)
	bool bScaleChanged; // 0x878(0x01)
	char pad_879[0x7]; // 0x879(0x07)
	struct UCurveFloat* UniqueScaleChangeCurve; // 0x880(0x08)
	float NowUniqueScaleValue; // 0x888(0x04)
	struct FVector BackupMeshCompScale; // 0x88c(0x0c)
	float UniqueScaleCurveMaxTime; // 0x898(0x04)
	bool bUniqueReboundCheckHeight; // 0x89c(0x01)
	char pad_89D[0x3]; // 0x89d(0x03)
	float UniqueReboundCheckHeightOffset; // 0x8a0(0x04)
	bool bUniqueReboundResultHeight; // 0x8a4(0x01)
	char pad_8A5[0x3]; // 0x8a5(0x03)
	float UniqueReboundResultHeight; // 0x8a8(0x04)
	float EmKarenEndUniqueObjectStateWaitTime; // 0x8ac(0x04)
	int32_t EnemyTargetActorFixUniqueId; // 0x8b0(0x04)
	char pad_8B4[0x4]; // 0x8b4(0x04)
	struct UCapsuleComponent* UniqueRideCapsule; // 0x8b8(0x08)
	bool bUniqueRideCapsule; // 0x8c0(0x01)
	char pad_8C1[0x3]; // 0x8c1(0x03)
	float UniqueRideCapsuleRadius; // 0x8c4(0x04)
	float UniqueRideCapsuleHalfHeight; // 0x8c8(0x04)
	struct FRotator UniqueRideCapsuleBaseRot; // 0x8cc(0x0c)
	struct FVector UniqueRideCapsuleRelativePos; // 0x8d8(0x0c)
	struct FRotator UniqueRideCapsuleRelativeRot; // 0x8e4(0x0c)
	enum class ECollisionEnabled UnqiueRideCapsuleOwnerCharaCollision; // 0x8f0(0x01)
	enum class ECollisionEnabled UnqiueRideCapsuleOwnerCapCollision; // 0x8f1(0x01)
	bool bUniqueRideCapsuleApply; // 0x8f2(0x01)
	bool bUniqueRideCapsuleReset; // 0x8f3(0x01)
	bool bUniqueRideCapsuleShape; // 0x8f4(0x01)
	char pad_8F5[0x3]; // 0x8f5(0x03)
	struct FVector UniqueRideCapsuleShapePos; // 0x8f8(0x0c)
	struct FRotator UniqueRideCapsuleShapeRot; // 0x904(0x0c)
	struct FName FlyingClaimantName; // 0x910(0x08)
	float ThrowMontageCancelBaseTime; // 0x918(0x04)
	char pad_91C[0x4]; // 0x91c(0x04)
	struct FCameraUniqueObjectParameter UniqueObjectCameraParameterCh0200; // 0x920(0x58)
	bool bInputRotateCheckFirst; // 0x978(0x01)
	bool bInputRotateCheckMouse; // 0x979(0x01)
	char pad_97A[0x2]; // 0x97a(0x02)
	int32_t InputRotateKbStep; // 0x97c(0x04)
	bool bInputRotateKbStepLt; // 0x980(0x01)
	bool bInputRotateKbStepRt; // 0x981(0x01)
	bool bInputUIKeyboardType; // 0x982(0x01)
	bool bClearDelayDeathWait; // 0x983(0x01)
	struct FGameTimer ClearDelayDeathWaitTimer; // 0x984(0x0c)
	bool bCheckEnemyLerp; // 0x990(0x01)
	bool bAchievementCheckUniqueInput; // 0x991(0x01)
	char pad_992[0x2]; // 0x992(0x02)
	struct FVector AttackCapsuleOffsetUnq; // 0x994(0x0c)
	bool bUniquePressHandle; // 0x9a0(0x01)
	bool bUniquePressHandleApply; // 0x9a1(0x01)
	char pad_9A2[0x2]; // 0x9a2(0x02)
	struct FVector UniquePressHandleOffset; // 0x9a4(0x0c)
	struct TArray<int32_t> EffectUniqueHitCopyMaterialIndexList; // 0x9b0(0x10)
	struct TArray<int32_t> EffectUniqueHitTargetMaterialIndexList; // 0x9c0(0x10)
	bool bUniquePressLiftUp; // 0x9d0(0x01)
	char pad_9D1[0x7]; // 0x9d1(0x07)
	struct UCurveFloat* UniquePressLiftUpCurve; // 0x9d8(0x08)
	struct FGameTimer UniquePressLiftUpTimer; // 0x9e0(0x0c)
	float RespawnRestrictRadiusUq; // 0x9ec(0x04)
	float PlayerPullDistance; // 0x9f0(0x04)
	float PlayerPullMoveDistMax; // 0x9f4(0x04)
	bool bCallEndUniqueObjectStateWait; // 0x9f8(0x01)
	char pad_9F9[0x3]; // 0x9f9(0x03)
	struct FGameTimer CallEndUniqueObjectStateWaitTimer; // 0x9fc(0x0c)
	bool bEventCancelEnable; // 0xa08(0x01)
	bool bInputReserve; // 0xa09(0x01)
	bool bInputReserveSuccess; // 0xa0a(0x01)
	bool bInputReserveWait; // 0xa0b(0x01)
	bool bInputReserveSkipAutoOff; // 0xa0c(0x01)
	bool bUseInputReserveButton; // 0xa0d(0x01)
	enum class EPsychicObjectUniqueInputType InputReserveType; // 0xa0e(0x01)
	enum class EPsychicObjectUniqueInputButton InputReserveButton; // 0xa0f(0x01)
	bool bInputSuccessDelay; // 0xa10(0x01)
	bool bInputSuccessReserve; // 0xa11(0x01)
	char pad_A12[0x2]; // 0xa12(0x02)
	float InputReserveDelaytime; // 0xa14(0x04)
	struct FGameTimer InputReserveDelayTimer; // 0xa18(0x0c)
	bool bDebugPrintInputReserve; // 0xa24(0x01)
	bool bEventCancelInputDelay; // 0xa25(0x01)
	char pad_A26[0x2]; // 0xa26(0x02)
	float InputSuccessDelayTime; // 0xa28(0x04)
	struct FGameTimer InputSuccessDelayTimer; // 0xa2c(0x0c)
	bool bCaptureSkipLookAtObj; // 0xa38(0x01)
	bool bCaptureCancelSas; // 0xa39(0x01)
	char pad_A3A[0x2]; // 0xa3a(0x02)
	float FloatDampLimit; // 0xa3c(0x04)
	float FloatDampRange; // 0xa40(0x04)
	float FloatDampCoefficients; // 0xa44(0x04)
	float FloatDampEaseBlendExp; // 0xa48(0x04)
	float FloatSpringRange; // 0xa4c(0x04)
	bool bFloatInertia; // 0xa50(0x01)
	char pad_A51[0x3]; // 0xa51(0x03)
	float FloatInertia; // 0xa54(0x04)
	float FloatInertiaCoefficients; // 0xa58(0x04)
	float FloatInertiaPrevHeight; // 0xa5c(0x04)
	bool bUseFloatSuspension; // 0xa60(0x01)
	bool bInputModeAutoLock; // 0xa61(0x01)
	bool bDebugPrintAutoLockInputMode; // 0xa62(0x01)
	bool bInputModeAutoSkip; // 0xa63(0x01)
	bool bSkeletonUpdateEnable; // 0xa64(0x01)
	bool bNoSkeletonUpdateUq; // 0xa65(0x01)
	char pad_A66[0x2]; // 0xa66(0x02)
	struct TArray<struct FName> SkeletonUpdateRefList; // 0xa68(0x10)
	struct TArray<float> InputWaitTimeList; // 0xa78(0x10)
	bool bSkipPsychicObjectUse; // 0xa88(0x01)
	char pad_A89[0x3]; // 0xa89(0x03)
	float UniquePressTraceRadius; // 0xa8c(0x04)
	struct TArray<enum class E_SASKind> CancelSasList; // 0xa90(0x10)
	bool bInputMoveMouseValue; // 0xaa0(0x01)
	bool bEnableInputMouseIcon; // 0xaa1(0x01)
	bool bSelfCallUnqObjEnd; // 0xaa2(0x01)

	void ForceWarpPartyMember(); // Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.ForceWarpPartyMember // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void NeedsEndSASCutin(bool bNeedsEndCutin); // Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.NeedsEndSASCutin // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CancelSAS(); // Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.CancelSAS // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetUniquePressFailure(); // Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetUniquePressFailure // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetEventSetting(bool event start in); // Function BP_UniqueObjectComponentBase.BP_UniqueObjectComponentBase_C.SetEventSetting // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
