// Class ChaosNiagara.NiagaraDataInterfaceChaosDestruction
// Size: 0x230 (Inherited: 0x30)
struct UNiagaraDataInterfaceChaosDestruction : UNiagaraDataInterface {
	struct TSet<struct AChaosSolverActor*> ChaosSolverActorSet; // 0x30(0x50)
	enum class EDataSourceTypeEnum DataSourceType; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	int32_t DataProcessFrequency; // 0x84(0x04)
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x88(0x04)
	bool DoSpawn; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	struct FVector2D SpawnMultiplierMinMax; // 0x90(0x08)
	float SpawnChance; // 0x98(0x04)
	struct FVector2D ImpulseToSpawnMinMax; // 0x9c(0x08)
	struct FVector2D SpeedToSpawnMinMax; // 0xa4(0x08)
	struct FVector2D MassToSpawnMinMax; // 0xac(0x08)
	struct FVector2D ExtentMinToSpawnMinMax; // 0xb4(0x08)
	struct FVector2D ExtentMaxToSpawnMinMax; // 0xbc(0x08)
	struct FVector2D VolumeToSpawnMinMax; // 0xc4(0x08)
	struct FVector2D SolverTimeToSpawnMinMax; // 0xcc(0x08)
	int32_t SurfaceTypeToSpawn; // 0xd4(0x04)
	enum class ELocationFilteringModeEnum LocationFilteringMode; // 0xd8(0x01)
	enum class ELocationXToSpawnEnum LocationXToSpawn; // 0xd9(0x01)
	char pad_DA[0x2]; // 0xda(0x02)
	struct FVector2D LocationXToSpawnMinMax; // 0xdc(0x08)
	enum class ELocationYToSpawnEnum LocationYToSpawn; // 0xe4(0x01)
	char pad_E5[0x3]; // 0xe5(0x03)
	struct FVector2D LocationYToSpawnMinMax; // 0xe8(0x08)
	enum class ELocationZToSpawnEnum LocationZToSpawn; // 0xf0(0x01)
	char pad_F1[0x3]; // 0xf1(0x03)
	struct FVector2D LocationZToSpawnMinMax; // 0xf4(0x08)
	enum class EDataSortTypeEnum DataSortingType; // 0xfc(0x01)
	bool bGetExternalCollisionData; // 0xfd(0x01)
	bool DoSpatialHash; // 0xfe(0x01)
	char pad_FF[0x1]; // 0xff(0x01)
	struct FVector SpatialHashVolumeMin; // 0x100(0x0c)
	struct FVector SpatialHashVolumeMax; // 0x10c(0x0c)
	struct FVector SpatialHashVolumeCellSize; // 0x118(0x0c)
	int32_t MaxDataPerCell; // 0x124(0x04)
	bool bApplyMaterialsFilter; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	struct TSet<struct UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x130(0x50)
	bool bGetExternalBreakingData; // 0x180(0x01)
	bool bGetExternalTrailingData; // 0x181(0x01)
	char pad_182[0x2]; // 0x182(0x02)
	struct FVector2D RandomPositionMagnitudeMinMax; // 0x184(0x08)
	float InheritedVelocityMultiplier; // 0x18c(0x04)
	enum class ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x190(0x01)
	char pad_191[0x3]; // 0x191(0x03)
	struct FVector2D RandomVelocityMagnitudeMinMax; // 0x194(0x08)
	float SpreadAngleMax; // 0x19c(0x04)
	struct FVector VelocityOffsetMin; // 0x1a0(0x0c)
	struct FVector VelocityOffsetMax; // 0x1ac(0x0c)
	struct FVector2D FinalVelocityMagnitudeMinMax; // 0x1b8(0x08)
	float MaxLatency; // 0x1c0(0x04)
	enum class EDebugTypeEnum DebugType; // 0x1c4(0x01)
	char pad_1C5[0x3]; // 0x1c5(0x03)
	int32_t LastSpawnedPointID; // 0x1c8(0x04)
	float LastSpawnTime; // 0x1cc(0x04)
	char pad_1D0[0x10]; // 0x1d0(0x10)
	float SolverTime; // 0x1e0(0x04)
	float TimeStampOfLastProcessedData; // 0x1e4(0x04)
	char pad_1E8[0x48]; // 0x1e8(0x48)
};

