// UserDefinedStruct CharactersSkillData.CharactersSkillData
// Size: 0x24 (Inherited: 0x00)
struct FCharactersSkillData {
	enum class EPlayerSkillCategory Category_15_7C8D060142B0EF52FD0F5DA34FFDAAE0; // 0x00(0x01)
	enum class EPlayerSkillIconCategory IconType_25_486DD8F14C001FFB6BEBBEACF5F1CEFE; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	int32_t LearnPoint_36_0FA79E644C71D01DE288F0BCADF05A00; // 0x04(0x04)
	int32_t LearnPointCh0200_40_0ECD57BE4017D9223BD507BD1749A108; // 0x08(0x04)
	float Parameter_20_9A2B6E0A4E5DDBFE2D5C98BE43D285BE; // 0x0c(0x04)
	float Parameter2_28_54FAEE9D4C889ABECE15DC92801F246A; // 0x10(0x04)
	struct FName NameMessageID_32_BEDF0CA84AEE8F63A99C5B94D915A104; // 0x14(0x08)
	struct FName DescriptionMessageID_33_C2BD7493489C603C01542C9FB160A7FC; // 0x1c(0x08)
};

