// UserDefinedStruct CharactersSequencerData.CharactersSequencerData
// Size: 0x93 (Inherited: 0x00)
struct FCharactersSequencerData {
	int32_t Index_2_F41C03F9411A7125D9F20A8580ECD603; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct TSoftObjectPtr<ULevelSequence>> SequencerSoftList_13_0191F9634FAB2E38C4703B8E691BDB91; // 0x08(0x10)
	struct TArray<struct ULevelSequence*> SequencerList_14_C3293AE84A4A963889FC1FA0E8600971; // 0x18(0x10)
	bool CurrentPos_69_FFB8D30D4A2B4964E5EAFDB26686C24F; // 0x28(0x01)
	bool UIDisplayOff_59_8B16F0C04A9042AF1F6463BB8B869012; // 0x29(0x01)
	bool PlayerDisplayOff_58_0382659F40E428E040B680A621429462; // 0x2a(0x01)
	bool EnemyDisplayOff_57_ED6AC1B14C3D19380DA9EDB48232B12D; // 0x2b(0x01)
	bool PsyObjDisplayOff_56_9E7C60E643C56A65D1490994D2F76205; // 0x2c(0x01)
	bool PlayerEvent_53_D18C803C482B48F6235DA6BE69ACDBDB; // 0x2d(0x01)
	bool EnemyEvent_52_2CBBBC304C5B64C29C625B9B859779C6; // 0x2e(0x01)
	bool FadeStartOut_60_FCDD7DAE41863FB4F09DEDBC04FFCE8D; // 0x2f(0x01)
	bool FadeStartIn_63_98BF26B84926A4643AC80AB60F59259E; // 0x30(0x01)
	bool FadeEndOut_67_5A457952422BF789A715F9A7FE7695CB; // 0x31(0x01)
	bool FadeEndIn_65_415938F742651700263DE38F4858CB08; // 0x32(0x01)
	char pad_33[0x1]; // 0x33(0x01)
	float FadeStartOutTime_46_0135BF55442FC235AF5C689A14FB5C60; // 0x34(0x04)
	float FadeStartInTime_47_86121AC84F83E1C5B567A5875DA13A79; // 0x38(0x04)
	float FadeEndOutTime_50_9E4FC0C041FB24A72E90CCBE204EC85A; // 0x3c(0x04)
	float FadeEndInTime_51_CC0C223D4626E73D3BC6B7B554B15738; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FText RootObjectName_82_745C0DA149352B4B491A399A3D7FC6FB; // 0x48(0x18)
	struct TArray<struct FText> BindObjectNameList_75_219EB8A14D0DDF492E53ECB67D6E0A60; // 0x60(0x10)
	struct TArray<struct AActor*> BindActors_79_F7611D724D6E4284FBEF40B0F1878D61; // 0x70(0x10)
	struct TArray<enum class EPlayerActionKind> PlayerActionKind_86_9292DCB646F76ACAE986E1BE6034E9F1; // 0x80(0x10)
	bool bPartyBind_88_8E078D5347F41D1822E2428A9425828B; // 0x90(0x01)
	bool NormalEnd_92_8BE1C7C840A33C0334A0BDA60D353929; // 0x91(0x01)
	bool AfterEventState_96_942F7D574AD9CCF5DDADFE995DD2E74A; // 0x92(0x01)
};

