// UserDefinedStruct CollisionCommonInfoBP.CollisionCommonInfoBP
// Size: 0x75 (Inherited: 0x00)
struct FCollisionCommonInfoBP {
	int32_t Power_15_68A4FEC844E2B46C63F379A57E840ECA; // 0x00(0x04)
	struct FRotator BlowAngle_34_8E62A796473BBB616C072B8F24F2BA42; // 0x04(0x0c)
	float BlowPower_35_FE0E05E849B61A74E875AAB6EA82A399; // 0x10(0x04)
	float HitStopSec_67_85B2F6424D75DA99F945E8BDFB1988D3; // 0x14(0x04)
	float HitStopActionSpeedRate_68_4924F49445BABF9773C69DB837ECF48B; // 0x18(0x04)
	enum class DamageKindBP DamageKind_73_81558ED041B6E93F3B9B1D8D268EFDAA; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float DamageStiffenSec_74_BE4706B849EBC68B2A64E99CBC6C3238; // 0x20(0x04)
	int32_t Stagger_41_D082343B4BDC35AE13F8EFAF94A71EC2; // 0x24(0x04)
	int32_t ReduceGuard_44_B1F91152441C35B5F6661E92B61F5516; // 0x28(0x04)
	enum class HCHitEffectType hitEffectType_89_BA16CC2D44F89D739EB6F9A2626E5521; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	struct TArray<struct FCollisionElementDataBP> ElementDatas_53_E41972E44558710DB3052599D1227E13; // 0x30(0x10)
	struct TArray<struct FCollitionConditionDataBP> ConditionDatas_54_A99729054CE39CE8A753379970DC9F39; // 0x40(0x10)
	struct TArray<struct FCollisionValueDataBP> Values_62_A4EE63344E0814FD6293C8BE1E139122; // 0x50(0x10)
	enum class CollisionHitTeamBP HitTeam_57_64E62BC64E74C86687B228B4AEDA552F; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	int32_t GroupNo_78_9F23551D4701F2C66D3E89B8DE3E0504; // 0x64(0x04)
	float GroupKeepSec_81_B418334B463FA844BCD81DA0880BA250; // 0x68(0x04)
	float RepeatHitSec_84_FBD5B0E04C04D4149770D7A43393A05C; // 0x6c(0x04)
	float StiffenSec_38_CB48071A47991C843690359F919CFC23; // 0x70(0x04)
	char Element_23_6CFE38A74B452861BB9B6FBB3600DFC5; // 0x74(0x01)
};

