// UserDefinedStruct CopyCharacterParameterStruct.CopyCharacterParameterStruct
// Size: 0x280 (Inherited: 0x00)
struct FCopyCharacterParameterStruct {
	struct FCharactersParameterTable ParameterTable_3_6212EF0B4053B5E5C71020B296D2F4CD; // 0x00(0x1f8)
	struct FCharactersParameterBasic ParameterBasic_6_F8620BCA4EF16AB06E9C11B3B2EBD57C; // 0x1f8(0x68)
	struct FName ParameterName_9_01F9E1584C7558772A60C1860508BD4C; // 0x260(0x08)
	struct UDataTable* ParameterDataTable_12_64FDCBEA4907D4830026088239663829; // 0x268(0x08)
	int32_t GroupID_17_14B5FE3B465BBDDA3851DB9FE6B97AD1; // 0x270(0x04)
	int32_t SubGroupID_19_C6647E7844FACEB9A1F1E79B4D700DFE; // 0x274(0x04)
	bool bInfinityCrashChance_21_FE00A0D74883F54E3EDFD497464C67EF; // 0x278(0x01)
	char pad_279[0x3]; // 0x279(0x03)
	int32_t DropId_24_81EDE3044BBB746133234B874A9083C1; // 0x27c(0x04)
};

