// UserDefinedStruct F_SASParam.F_SASParam
// Size: 0x24 (Inherited: 0x00)
struct FF_SASParam {
	float RecastSec_23_C682F0F3473CC9C9D5EBE2BC3F6EDF00; // 0x00(0x04)
	float RecastSecWith_41_3EB491B04CC56A3FEA16D0B14F98F95D; // 0x04(0x04)
	float ActivationSec_22_5AB70BD4461D168B91E52F9031080641; // 0x08(0x04)
	float ActivationSecWith_42_FCE27F2E4E29EF56DCDE80993E4CE73C; // 0x0c(0x04)
	enum class ESASEffectTiming Timing_31_05B1C42544E00C9E99F34A9968FD3C83; // 0x10(0x01)
	enum class ESASEffect Effect_32_84FB6541423EF51EFC1FDF80BBB50730; // 0x11(0x01)
	enum class ESASEffect Effect2_35_3CCC1220422FFD72B42A6B8CDDBE30F5; // 0x12(0x01)
	char pad_13[0x1]; // 0x13(0x01)
	float Param0_26_DBB4DC48473C2D1AD158439BB742815C; // 0x14(0x04)
	float Param1_18_BCFF68B941098B8CC86F7CB764ADDD9F; // 0x18(0x04)
	float Param2_14_A4FDE9AF407442B7189511935D2CD697; // 0x1c(0x04)
	float Param3_16_24F0EE8E430BD79C2D4F9CAF32E26858; // 0x20(0x04)
};

