// UserDefinedStruct FBattleBonusData.FBattleBonusData
// Size: 0x40 (Inherited: 0x00)
struct FFBattleBonusData {
	float NormalTime_44_17CFDC0B4ED68D9CCB818F98957049BC; // 0x00(0x04)
	float NormalMaxRate_42_EC4966EA4FE729D7443E3EB308F0C78B; // 0x04(0x04)
	float MaxRate_12_2232B2D0459AD7016866C8A0890FB822; // 0x08(0x04)
	float BrainFieldMaxRate_11_BA5FC3DC4C70AB7506493799ACAABBCD; // 0x0c(0x04)
	float AddPsychicCombo_13_102390794EB5F90F7C714CB8DA068575; // 0x10(0x04)
	float AddBrainCrash_14_DB2DB06D44C54A98CEFB189550DCF0DA; // 0x14(0x04)
	float AddBrainCrashBrainField_15_56645F424C2F891A55FFECB5D26693D8; // 0x18(0x04)
	float AddBrainFieldPsychicUp_20_A799A605457F0114C16E8CA81B750054; // 0x1c(0x04)
	float AddBrainFieldPsychicLeft_21_785CB5E14ED4A50056013099483823E9; // 0x20(0x04)
	float AddBrainFieldPsychicRight_23_8C8440C64D4612D5FAFF10B139372EFE; // 0x24(0x04)
	float AddDefeated_28_32CCC31B4FC6C9DEE9F9A69A49B36912; // 0x28(0x04)
	float AddDefeatedBrainField_29_699645234848DE1D2DC08EAEDE6B72D2; // 0x2c(0x04)
	float AddPsychicUnique_33_5C5E200548A0BDF6C7CA3A8BFFB9E7AF; // 0x30(0x04)
	float AddMapGimmick_34_D7BEDFF7454A75B8696405B13AA69676; // 0x34(0x04)
	float AddJustDodge_37_C3634DE540743E46C012368F5D32BF42; // 0x38(0x04)
	float AddSkillOverkill_40_0B8DDE72403B0E2052F65AB47F3203DF; // 0x3c(0x04)
};

