// UserDefinedStruct FBonusGhostTime.FBonusGhostTime
// Size: 0x34 (Inherited: 0x00)
struct FFBonusGhostTime {
	float TrailTime_6_77F3D4324E1ADB72FDAE299176747EFF; // 0x00(0x04)
	float RemTime_7_BFB703F64081B2EB2172228DC51B5943; // 0x04(0x04)
	float RemFadeTime_8_0D7E7EE0437A00FB1FD653AE745A8F87; // 0x08(0x04)
	bool TrailOneShot_10_FA1D85A3490245E1025888B95733BAEE; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FLinearColor Color_14_FD5734454447C6AF374755A2E68C218A; // 0x10(0x10)
	float RemFresnelIntensity_18_DD18AFCC402ACB549FE77197C19699BE; // 0x20(0x04)
	float RemFresnelOffset_23_CAD232CF4F29BAC88ACC6585766ABA40; // 0x24(0x04)
	float RemNormalIntensity_24_96C4630C441D540A5CA0BAB93A39B521; // 0x28(0x04)
	float RemNormalOffset_25_21717B1C46407DC7BF9E8298AB9FE833; // 0x2c(0x04)
	float RemSmoothness_26_970C54804F6ECFEF6C0BCC9A9C488B5F; // 0x30(0x04)
};

