// UserDefinedStruct FCombinationVisionData.FCombinationVisionData
// Size: 0x2c (Inherited: 0x00)
struct FFCombinationVisionData {
	int32_t LearnBondsLevel_13_6C1AFF3B48E3644B81188DA1CEBC0BD3; // 0x00(0x04)
	float CostCh0100_14_3B9F7B4A4C0520414CC924BE53EEFE4D; // 0x04(0x04)
	float CostCh0200_15_2A0CD5A849EBB2118FB1DBB890C0E756; // 0x08(0x04)
	float CostCh0300_16_31248BD544D2A94B930647B9304E947D; // 0x0c(0x04)
	float CostCh0400_17_9888664E41E994E82C2BDDBD45B85954; // 0x10(0x04)
	float CostCh0500_18_9373D8354811D506DD48E8936F3D287A; // 0x14(0x04)
	float CostCh0600_19_03F00DC44D48D35201675A97B8E0103D; // 0x18(0x04)
	float CostCh0700_20_007D011A4975F900FDB8E18BE8A4E7D0; // 0x1c(0x04)
	float CostCh0800_21_189907154C5B98C9BD3C69B0F620A814; // 0x20(0x04)
	float CostCh0900_22_C95C81AD4ACB800BF78E3D8AB708936B; // 0x24(0x04)
	float CostCh1000_23_AA69CBF3494AD90B37D71CA8785EB2CA; // 0x28(0x04)
};

