// UserDefinedStruct FEventTriggerCommand.FEventTriggerCommand
// Size: 0x61 (Inherited: 0x00)
struct FFEventTriggerCommand {
	enum class EEventTriggerCheckType EventTriggerType_3_8B756CE44FCBAE430CB264A465DE700B; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct AMakeEventActor* MakeEventActorClass_5_991242B34E58E0FCCBD5D4AA92F9861A; // 0x08(0x08)
	struct AMakeEventActor* SubMakeEventActorClass_31_5C77F1E54E332ED2BE0A4DB4E6EBC755; // 0x10(0x08)
	float TriggerWaitTime_8_E4BB2A474960FDC10DD51DBAAB82FCBB; // 0x18(0x04)
	int32_t EnemyNum_14_CD835F684EA2A44ACA2B5B96FC10F561; // 0x1c(0x04)
	struct FName EnemyLevelName_11_383EAF5E4D472FAAF2731281B4D856A5; // 0x20(0x08)
	struct FName ForCharaID_19_D534CA074167F07B63356FB72A07EAD8; // 0x28(0x08)
	struct FName ItemID_20_C861D19D45BA384D470E6BB11AC12712; // 0x30(0x08)
	struct UAnimMontage* TriggerPlayerAnimMontage_23_08D98F1E43CF7C1FD458109C512AC2FA; // 0x38(0x08)
	int32_t ObstructActionNum_28_F3179BF14067D7AEE23E529DB6E9FF53; // 0x40(0x04)
	int32_t EventPriority_34_93406E194C3AB7A1FCCC00969CA3B215; // 0x44(0x04)
	struct FName EnemyHPCheckCharaTag_37_A346F6E3445F1948545B568D3E29556C; // 0x48(0x08)
	float EnemyHPCheckHPRate_41_46652FC34EBBC07689943ABD0C567D4C; // 0x50(0x04)
	struct FName DimensionTangleLevelName_45_726CF3C84A978508D436E7B28BCFDAD8; // 0x54(0x08)
	int32_t DimensionTangleNum_47_633335C34396DBB830BF89A167FA27A0; // 0x5c(0x04)
	bool IsExceptionBrainTalkEvent_52_EAE2F0834C972C48A3A274B4BA0BE40A; // 0x60(0x01)
};

