// UserDefinedStruct FEventSettingCapData.FEventSettingCapData
// Size: 0x6d (Inherited: 0x00)
struct FFEventSettingCapData {
	int32_t BoadMeshIndex_3_FA2CB7BB480B4C23BFC3FCB1C784E341; // 0x00(0x04)
	struct FName CapturePresetName_28_5E2A0DC2455B7BB7BB690A82BC1819FC; // 0x04(0x08)
	struct FName CharaAnimationName_29_32979BF74F662B0886AB03A503383C00; // 0x0c(0x08)
	struct FName CharaFaceAnimationName_30_991B046648E1E937A8DB0E849088BD3A; // 0x14(0x08)
	int32_t NpcMeshTableID_19_640873CD494BE360102A82BB40FE51E4; // 0x1c(0x04)
	int32_t NpcMaterialTableID_20_1D4BC0904FBDFF7CD26307ABB1D1096C; // 0x20(0x04)
	struct FName LightPresetName_31_2BDA17CC4396E1EBCCE88F83FC3771A7; // 0x24(0x08)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct ULevelSequence* CaptureSequence_32_420D46C04CC8D37280E06B92C5F1BA83; // 0x30(0x08)
	float CaptureSequencePosition_33_E78AB7C648D99850D4099C8DB9D8637F; // 0x38(0x04)
	struct FName TextureRowName_34_44D5107F484B359DD33DF3BCC04BD6DC; // 0x3c(0x08)
	enum class EStaticPlType StaticPlType_35_FACE4FBD4108CBD8319D3E8DD9F9E512; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FName MovieTextureRowName_36_F6E2E4DA44326B276F3F0480D12B3C9D; // 0x48(0x08)
	bool IsUseSaveTexture_37_DBE5492C4A8CF1EBEE28BF90A159448E; // 0x50(0x01)
	bool IsSeamlessInGameCapture_40_F60E8DDB4667E901F8EF7AB7D85AD9FA; // 0x51(0x01)
	bool IsNoStaticPlSetting_41_B9A2E7D249DCD9843A112B9AD1B4A4D2; // 0x52(0x01)
	bool IsHiddenPlFrameEffect_43_CCF68E3B409D2BBD10B4E79224D9C204; // 0x53(0x01)
	struct FName CharaEyePresetName_53_DC54D0E54041ABCBFE5C379E7450797C; // 0x54(0x08)
	float EyeXAxisThreshold_52_055F18FA48471769D4079590CA0144BB; // 0x5c(0x04)
	float EyeYAxisThreshold_51_BC04714746AA715ECE41E6B4B7ECF325; // 0x60(0x04)
	struct FName CharaPartsDTRowName_62_F1EB605940AB6EEA9FBA7FAF59F42D53; // 0x64(0x08)
	enum class EEventCaptureRenderType RenderType_60_5126604D42B4EB78EA657698B8180E1E; // 0x6c(0x01)
};

