// UserDefinedStruct FHologramAnimationPlayData.FHologramAnimationPlayData
// Size: 0x29 (Inherited: 0x00)
struct FFHologramAnimationPlayData {
	struct UAnimMontage* HologramMontage_10_0EF1477A47410156C95C8688D85452BC; // 0x00(0x08)
	struct UAnimMontage* PlayerMontage_11_04B92A1C46E895FBC70B3EB1E70FD16C; // 0x08(0x08)
	struct UAnimMontage* WeaponMontage_21_186923BC4157F513A231F69A861CB173; // 0x10(0x08)
	struct UAnimMontage* WeaponActorMontage_31_22FCA07443CAC680DEFDE9A1D4AC2AC7; // 0x18(0x08)
	bool bFlying_12_05D78DAE427A6C469E7E88826F1901CA; // 0x20(0x01)
	bool bFall_13_90B068B94F6C9479D8DE3298E99500E5; // 0x21(0x01)
	bool bChargeMove_16_D48DE7B5457DEC49B3458D93FD0DBB5D; // 0x22(0x01)
	bool bMoveToLocation_18_136345DE4A17FEC514C5F191F22B16D3; // 0x23(0x01)
	bool bThrow_24_DCB3DE954553BB3115B007BD57897678; // 0x24(0x01)
	bool bWaitThrowHit_27_8676AA3149C89B8BE07CCA9CD2D1FC80; // 0x25(0x01)
	bool bAttractTarget_36_13F2C53D40F63A7717A0BBBFF4B9B92A; // 0x26(0x01)
	bool bInterruptCheck_39_AF082E474485DE22DDFAACA2CEC0D365; // 0x27(0x01)
	bool bWeaponRotate_42_F084ADB3492398830537B1AB6E2A5E6A; // 0x28(0x01)
};

