// UserDefinedStruct FNotifyAttackData.FNotifyAttackData
// Size: 0x10 (Inherited: 0x00)
struct FFNotifyAttackData {
	bool bEnable_15_25556541426A9FFD297658AAEEF0D4C7; // 0x00(0x01)
	enum class ENotifyAttackType Type_8_A43D8D2A40975BAEBCCB3DBE5AE4B0B0; // 0x01(0x01)
	bool Front_9_DDDA7C044C2637426F5F258FDE98764B; // 0x02(0x01)
	bool Back_10_66465FD348366691B46415A38115518E; // 0x03(0x01)
	bool Right_11_A6AA65E74DA0D7A9A530BBA2AC5C6D85; // 0x04(0x01)
	bool Left_12_838367A041F70363A446A089D1DBD064; // 0x05(0x01)
	char pad_6[0x2]; // 0x06(0x02)
	float Range_13_E421928E4584EF555D3D96982F8E7333; // 0x08(0x04)
	float Witdh_18_B974BEDF48C8ADE80B093AA83F8CCBA7; // 0x0c(0x04)
};

