// UserDefinedStruct FPlayerBattleVoiceFacialAnimType.FPlayerBattleVoiceFacialAnimType
// Size: 0x10 (Inherited: 0x00)
struct FFPlayerBattleVoiceFacialAnimType {
	enum class EPlayerFacialAnim BattleStart_2_64D9DD654DB4B8276952E9946DE4674F; // 0x00(0x01)
	enum class EPlayerFacialAnim RecoverySelf_18_1C643EC54007FF3574FAE988ADE05CEC; // 0x01(0x01)
	enum class EPlayerFacialAnim RecoveryFriend_19_A1D0F4FA4EFFA84A3BB474B9B8FBBCD7; // 0x02(0x01)
	enum class EPlayerFacialAnim RecoveryBadStatusSelf_20_3A1DED654468D97E2B122E89CB7D4CB4; // 0x03(0x01)
	enum class EPlayerFacialAnim RecoveryBadStatusFriend_21_587CF8E44EFD3854779510A46A06C6C3; // 0x04(0x01)
	enum class EPlayerFacialAnim WakeUp_22_6EA191AD432380C09C6479B8F407B867; // 0x05(0x01)
	enum class EPlayerFacialAnim Dying_23_74A5B45544315D2AD449EC81B5620B1F; // 0x06(0x01)
	enum class EPlayerFacialAnim Die_24_B89109BA4A037419AFD08FA671C663B8; // 0x07(0x01)
	enum class EPlayerFacialAnim Defeated_25_A6D086F7448CBD7E2D0B0895C63A534D; // 0x08(0x01)
	enum class EPlayerFacialAnim Lost_26_70E6D2D3428A85FBCEFAE8B20F2231D9; // 0x09(0x01)
	enum class EPlayerFacialAnim Find_27_F435380244BB0E5BA944FD862DFD5692; // 0x0a(0x01)
	enum class EPlayerFacialAnim BadStatusOil_28_B802E1CC4FD5BE611769C789734C88B2; // 0x0b(0x01)
	enum class EPlayerFacialAnim BadStatusFlooded_29_E181C2674B35DC76911FF98A7F3600FA; // 0x0c(0x01)
	enum class EPlayerFacialAnim BadStatusFlame_30_136EB4084A09D70E8FA171A705BEBB1D; // 0x0d(0x01)
	enum class EPlayerFacialAnim BadStatusElectric_31_6E58441149F926163B9298B50F50AC09; // 0x0e(0x01)
	enum class EPlayerFacialAnim BadStatusConfusion_32_DB0517B844D3C21E976A978F8EFC3BFA; // 0x0f(0x01)
};

