// UserDefinedStruct FPlayerBattleParticleData.FPlayerBattleParticleData
// Size: 0x48 (Inherited: 0x00)
struct FFPlayerBattleParticleData {
	struct UParticleSystem* LeftHandParticle_22_AA87B0AB422CA664E19CABADFA216DEB; // 0x00(0x08)
	struct UParticleSystem* RightHandParticle_24_3A36B54348B578421CB1909DF7955DD2; // 0x08(0x08)
	struct UParticleSystem* HeadParticle_19_A3B5F5FB485F9B5043232BA5B4BED7F8; // 0x10(0x08)
	struct FLinearColor ColorA_15_4C4F521D4F6F3643D247BA814A426ABE; // 0x18(0x10)
	struct FLinearColor ColorB_17_B1056F7F4E14CC282C794790AF2C6B7C; // 0x28(0x10)
	float Radius1_7_9B1B7B2049DE8C73087D91946EE45BBF; // 0x38(0x04)
	float Rate1_8_975BBF2643BDAD802829C1B8105B798C; // 0x3c(0x04)
	float Radius2_9_43EF078A41B6F49F44270A8E4AFFA6DB; // 0x40(0x04)
	float Rate2_10_C020952E45011D51AE8F65B8E22DE03E; // 0x44(0x04)
};

