// UserDefinedStruct FPlayerFacialData.FPlayerFacialData
// Size: 0x80 (Inherited: 0x00)
struct FFPlayerFacialData {
	struct UAnimMontage* Default_13_2403D4B941CF467D4C7FE7B15DB45607; // 0x00(0x08)
	struct UAnimMontage* Smile_S_14_0229554B4EFCD57C3B76078D2712423D; // 0x08(0x08)
	struct UAnimMontage* Smile_L_15_D4452F30473E52CF6576BABA5689FC6C; // 0x10(0x08)
	struct UAnimMontage* Angry_16_A49EFB6845DD0A34F0127D9F7FBEA54E; // 0x18(0x08)
	struct UAnimMontage* Sad_17_35D165D645F38ECBCED7A3A44570C88A; // 0x20(0x08)
	struct UAnimMontage* Surprise_S_18_B23DC2E34EF6C4581BC92CAA9A3ABC16; // 0x28(0x08)
	struct UAnimMontage* Surprise_L_19_E5FE80CA403C8FB6E61622B2DDEC33DC; // 0x30(0x08)
	struct UAnimMontage* Fear_20_99EF9BA0486943594F44009AD3B79E35; // 0x38(0x08)
	struct UAnimMontage* Aversion_21_9975F48340A22DAE4A538B94220EC3E3; // 0x40(0x08)
	struct UAnimMontage* Damage_S_22_B1B0696E47EDD06AF3295F8B654F03B5; // 0x48(0x08)
	struct UAnimMontage* Damage_L_23_82C697634E8817CFCD79558FF29A7B9E; // 0x50(0x08)
	struct UAnimMontage* Serious_30_74A6226243BE9C8B4AB76D86BEF38C79; // 0x58(0x08)
	struct UAnimMontage* Blushing_31_2C6F385348B52A7274D85AB61367D763; // 0x60(0x08)
	struct UAnimMontage* Dead_32_39256F1D4F1A3435C1F58984D5E6069A; // 0x68(0x08)
	struct UAnimMontage* EX02_37_B0F9CDCE4E5F2C9156C9D295020889A1; // 0x70(0x08)
	struct UAnimMontage* EX01_40_AAE2CD4446D1679CE4CC8082CA0D6D69; // 0x78(0x08)
};

