// UserDefinedStruct FPlayerAIBattleThinkTransitionData.FPlayerAIBattleThinkTransitionData
// Size: 0x0b (Inherited: 0x00)
struct FFPlayerAIBattleThinkTransitionData {
	int32_t Probability_12_11D76ED542C415DCC5CBE7AEC1F0B24D; // 0x00(0x04)
	enum class EPlayerAIBattleThinkType NextAction_2_C23C7F0D46C7DD0214A716A662791554; // 0x04(0x01)
	enum class EPlayerAIBattleThinkTransition Transition1_9_5D1D49F14682C0385EA716B4C0A329E0; // 0x05(0x01)
	enum class EPlayerAIBattleThinkTransition Transition2_11_D3D0D91C4294EA64C97D9397F8460764; // 0x06(0x01)
	enum class EPlayerAIBattleThinkTransition Transition3_18_9A4FF4044D32E71289FCFA89A8B300A9; // 0x07(0x01)
	enum class EPlayerAIBattleThinkTransition Transition4_20_648484024D5D8774C07D86AD3E220B76; // 0x08(0x01)
	enum class EPlayerAIBattleThinkTransition Transition5_22_8B3047C04FC0E50FE0742FB0EC99A16B; // 0x09(0x01)
	enum class EPlayerAIBattleThinkParam Param_15_5D27A7A640199FBE743799858E751333; // 0x0a(0x01)
};

