// UserDefinedStruct FPlayerBattleVoice.FPlayerBattleVoice
// Size: 0x80 (Inherited: 0x00)
struct FFPlayerBattleVoice {
	struct USoundAtomCue* BattleStart_11_E543FCC448156F061F057F9B0DA36001; // 0x00(0x08)
	struct USoundAtomCue* RecoverySelf_24_B48F45874FA3B710E2ABC3A0DF8C389A; // 0x08(0x08)
	struct USoundAtomCue* RecoveryFriend_27_FE622506457BA9F356A793810F02F931; // 0x10(0x08)
	struct USoundAtomCue* RecoveryBadStatusSelf_33_6F69CE9B450993279E5499B42C91A2DB; // 0x18(0x08)
	struct USoundAtomCue* RecoveryBadStatusFriend_34_83479B164ADE15462469CD842470D7E6; // 0x20(0x08)
	struct USoundAtomCue* WakeUp_14_A92E391548C408E91508B09DF0ECA345; // 0x28(0x08)
	struct USoundAtomCue* Dying_16_7A863DA345682678356CF2A4920DC490; // 0x30(0x08)
	struct USoundAtomCue* Die_17_4F26FF9541FC133A15E1FE81E6269DDD; // 0x38(0x08)
	struct USoundAtomCue* Defeated_18_3278F0EB47500AB0745A668FB8DF4CCA; // 0x40(0x08)
	struct USoundAtomCue* Lost_19_BFB86DA141BBDF5C1DD7DAB795AAF770; // 0x48(0x08)
	struct USoundAtomCue* Find_20_AF5F8C724BEF39BF0E2F48891D6177A2; // 0x50(0x08)
	struct USoundAtomCue* BadStatusOil_48_3A52613F48F52C3554A54F90B3E1CEE1; // 0x58(0x08)
	struct USoundAtomCue* BadStatusFlooded_47_9047BF8B4AE5D93AD35F8CA86F296D92; // 0x60(0x08)
	struct USoundAtomCue* BadStatusFlame_46_53831DB64A80D45E8D5595BE962881AB; // 0x68(0x08)
	struct USoundAtomCue* BadStatusElectric_45_2EC4228B4A9A9E1404CA2586BE4A976A; // 0x70(0x08)
	struct USoundAtomCue* BadStatusConfusion_44_1CBD49934556F6FB5FF7759CD190A567; // 0x78(0x08)
};

