// UserDefinedStruct FPlayerMaterialManageCurveData.FPlayerMaterialManageCurveData
// Size: 0x18 (Inherited: 0x00)
struct FFPlayerMaterialManageCurveData {
	enum class EPlayerMaterialManageType Type_13_717F070C4E8B8BCCF58391AD72F77D37; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UCurveFloat* Curve_16_D7F934AA4CF001D9B9A557B391BF3AF5; // 0x08(0x08)
	bool bPlayer_4_9DE779E74CC4029759523E9822205D9E; // 0x10(0x01)
	bool bWeapon_5_99677A474FCE3E08C0A084B6EDF8CFD6; // 0x11(0x01)
	bool bCable_6_A3C19CD548F2316DE79B919FA69C87E3; // 0x12(0x01)
	bool bCopy_7_F894DE254FCC444566358D8E83161253; // 0x13(0x01)
	float ElapsedTime_10_147B5EC145E8B2CF0A3FE89E8D9C2251; // 0x14(0x04)
};

