// UserDefinedStruct FPlayerVectorMaterialManageData.FPlayerVectorMaterialManageData
// Size: 0x28 (Inherited: 0x00)
struct FFPlayerVectorMaterialManageData {
	enum class EPlayerMaterialManageType Type_6_E7D6F53E489DCF350671F2BF0D8F264A; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector StartValue_33_5D277324440EAF59A87612A61AC5D86C; // 0x04(0x0c)
	struct FVector EndValue_34_8969B84240C5114D75841BB3AEE589A4; // 0x10(0x0c)
	float Time_14_B1CAED1E44898C3E20B75FA77562CF29; // 0x1c(0x04)
	float ElapsedTime_26_63566EAD4ED59D43BD39D2BF361FE39E; // 0x20(0x04)
	bool bPlayer_20_AB28DC704682A60C23AD4FBC225DFFC5; // 0x24(0x01)
	bool bWeapon_21_DAE9A93042B08A7ED9B4779359542E7E; // 0x25(0x01)
	bool bCable_22_4B5D1CD547CA3DC96D8AE7979F766F84; // 0x26(0x01)
	bool bCopy_23_3D9061F34B701C4E20EE2DBBAF1AD969; // 0x27(0x01)
};

