// UserDefinedStruct FSasCutInSeVar.FSasCutInSeVar
// Size: 0x168 (Inherited: 0x00)
struct FFSasCutInSeVar {
	struct TSoftObjectPtr<USoundAtomCue> Fire_23_A4C6C73F4C3710C12EE667A820ECAAD3; // 0x00(0x28)
	struct TSoftObjectPtr<USoundAtomCue> Metal_24_F1931E6847A772C6FA9310BECDED3CE1; // 0x28(0x28)
	struct TSoftObjectPtr<USoundAtomCue> SeeThrough_25_9E0B9D9B407EEB78698B30AC0F39AFCF; // 0x50(0x28)
	struct TSoftObjectPtr<USoundAtomCue> Telepo_26_A14B14664D9101772CBF3FAE67C1F3DE; // 0x78(0x28)
	struct TSoftObjectPtr<USoundAtomCue> Stealth_27_564E79AA4CF5A738D38D6789B9F7096E; // 0xa0(0x28)
	struct TSoftObjectPtr<USoundAtomCue> Electric_28_AEF19F5646DDF8718D0020BCA6519F5C; // 0xc8(0x28)
	struct TSoftObjectPtr<USoundAtomCue> Copy_29_3D48806F46F78D2E0626258A418899D9; // 0xf0(0x28)
	struct TSoftObjectPtr<USoundAtomCue> Accelerator_30_4A89DE6A47CA52B8952E2687050C7A8F; // 0x118(0x28)
	struct TSoftObjectPtr<USoundAtomCue> Psychic_31_A9A5995F477347F59DEFA58A24862558; // 0x140(0x28)
};

