// UserDefinedStruct FSASCommand.FSASCommand
// Size: 0x30 (Inherited: 0x00)
struct FFSASCommand {
	enum class E_SASKind Kind_2_23A817BE4D2313508B87CFB882D2D118; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float RemainTime_13_69E5C0AF416E23F54E741EAF69D93203; // 0x04(0x04)
	float MemoryRemainTime_46_B2AD2AD248C2AD2E2404838C7C27F166; // 0x08(0x04)
	float MaxTime_45_8435A5824DED7FD281DB658180EB044C; // 0x0c(0x04)
	struct FFSASFireParam Fire_23_769BF32843EEFBF0A3E905B89F8BCF47; // 0x10(0x01)
	struct FFSASMetalParam Metal_24_09BB48264A15259C751C17AA0FE944CF; // 0x11(0x01)
	struct FFSASSeeThroughParam SeeThrough_31_ABE1373C46861B2B0274A4A96FCCFFDD; // 0x12(0x01)
	struct FFSASTelepoParam Telepo_32_EF7E140D4BD15AA5A49B0ABAA87B155B; // 0x13(0x01)
	struct FFSASStealthParam Stealth_33_4D2AB2CB43BAAEDF2D32FDA11278C67C; // 0x14(0x01)
	struct FFSASElectricParam Electric_10_DCFFC7DC4C58A3DF3E711FA72780FB1F; // 0x15(0x01)
	struct FFSASCopyParam Copy_34_539F056E4F86B2ABCB0B8C8A3D23B4A1; // 0x16(0x01)
	char pad_17[0x1]; // 0x17(0x01)
	struct FAcceleratorParam Accelerator_7_49BD981A4CA9E2696131ECB6CC091520; // 0x18(0x0c)
	struct FFSASPsychicParam Psychic_40_91A32BE84F69CE37511101A9DD92D386; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct AActor* Owner_37_509AEE1E405B7BD1ADABDA843B579086; // 0x28(0x08)
};

