// BlueprintGeneratedClass HUDMainGame.HUDMainGame_C
// Size: 0x900 (Inherited: 0x7a0)
struct AHUDMainGame_C : ARSHUDBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x7a0(0x08)
	struct UPlayerInputComponent_C* PlayerInputComponent; // 0x7a8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x7b0(0x08)
	struct FMulticastInlineDelegate BattleDamage2D; // 0x7b8(0x10)
	struct FMulticastInlineDelegate BattleDamage3D; // 0x7c8(0x10)
	bool DebugInvisibleFlag; // 0x7d8(0x01)
	char pad_7D9[0x7]; // 0x7d9(0x07)
	struct UWB_ui_Caption_1_C* caption; // 0x7e0(0x08)
	bool DebugBattleUIPlayFlag; // 0x7e8(0x01)
	char pad_7E9[0x3]; // 0x7e9(0x03)
	int32_t DebugLogCount; // 0x7ec(0x04)
	struct UWB_ui_Loading_1_C* LoadingWidget; // 0x7f0(0x08)
	bool DebugSystemMessageFlag; // 0x7f8(0x01)
	char pad_7F9[0x7]; // 0x7f9(0x07)
	struct UWB_ui_Info_window_1_C* WidgetSystemMessage; // 0x800(0x08)
	struct UWB_ui_Choice_window_C* UIGeneralChoice_1; // 0x808(0x08)
	bool DebugSystemWarningFlag; // 0x810(0x01)
	char pad_811[0x7]; // 0x811(0x07)
	struct UWB_ui_CharaName_C* UICharaName; // 0x818(0x08)
	struct UWB_ui_TownName_C* UITownName; // 0x820(0x08)
	struct UWB_ui_Loading_chara_1_C* LoadingWidgetChara; // 0x828(0x08)
	struct UWB_ui_Loading_interlude_C* LoadingWidgetInterlude; // 0x830(0x08)
	struct UWB_ui_Loading_chapter_C* LoadingWidgetChapter; // 0x838(0x08)
	int32_t DebugLoadingIndex; // 0x840(0x04)
	bool DebugTownFlag; // 0x844(0x01)
	bool DebugKeyboardFlag; // 0x845(0x01)
	char pad_846[0x2]; // 0x846(0x02)
	struct UUIAutoSaving* UIAutoSave; // 0x848(0x08)
	bool DebugInitFlag; // 0x850(0x01)
	bool DebugMinimapDispAdd; // 0x851(0x01)
	char pad_852[0x6]; // 0x852(0x06)
	struct UUITutoOperation* HelpOperation; // 0x858(0x08)
	struct UUINoticeMessage* NoticeMessage; // 0x860(0x08)
	int32_t DebugHelpID; // 0x868(0x04)
	int32_t DebugTutoID; // 0x86c(0x04)
	int32_t DebugMessageNo; // 0x870(0x04)
	float InitDriveGaugePercent; // 0x874(0x04)
	bool IsInitDriveGaugePercent; // 0x878(0x01)
	char pad_879[0x3]; // 0x879(0x03)
	int32_t InitState; // 0x87c(0x04)
	int32_t DebugDriveGaugeState; // 0x880(0x04)
	float DebugDriveGaugePercent; // 0x884(0x04)
	bool DebugDriveGaugeUnlockFlag; // 0x888(0x01)
	char pad_889[0x3]; // 0x889(0x03)
	int32_t DebugDrawMessageCounter; // 0x88c(0x04)
	float _TempBrainTalkDelaySecond; // 0x890(0x04)
	float _TempBrainTalkDelaySecond_Work; // 0x894(0x04)
	float _TempBrainTalkDeltaSeconds; // 0x898(0x04)
	bool FlagLoadingSetupEvent; // 0x89c(0x01)
	bool FlagLoadingReserveEnd; // 0x89d(0x01)
	char pad_89E[0x2]; // 0x89e(0x02)
	float LogDrawTime; // 0x8a0(0x04)
	float LogWaitTime; // 0x8a4(0x04)
	struct FName TestItem0001; // 0x8a8(0x08)
	struct FName TestItem0002; // 0x8b0(0x08)
	struct FName TestItem0003; // 0x8b8(0x08)
	int32_t TestLoadingID; // 0x8c0(0x04)
	char pad_8C4[0x4]; // 0x8c4(0x04)
	struct UWB_ui_SasSkill_Popup_C* SasWindow; // 0x8c8(0x08)
	struct UWB_ui_Caption_Guide_1_C* CaptionGuide; // 0x8d0(0x08)
	struct FMulticastInlineDelegate OnMainContentsUIClose; // 0x8d8(0x10)
	struct FMulticastInlineDelegate OnPlayDecideAnimeBrainTuto; // 0x8e8(0x10)
	struct UWB_ui_Keyword_C* WidghetKeyword; // 0x8f8(0x08)

	struct FString getResultKeyword(); // Function HUDMainGame.HUDMainGame_C.getResultKeyword // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool isCancelKeyword(); // Function HUDMainGame.HUDMainGame_C.isCancelKeyword // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool isEndKeyword(); // Function HUDMainGame.HUDMainGame_C.isEndKeyword // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool StartKeyword(); // Function HUDMainGame.HUDMainGame_C.StartKeyword // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool StartCode(); // Function HUDMainGame.HUDMainGame_C.StartCode // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
