// Class LuminRuntimeSettings.LuminRuntimeSettings
// Size: 0x148 (Inherited: 0x28)
struct ULuminRuntimeSettings : UObject {
	struct FString PackageName; // 0x28(0x10)
	struct FString ApplicationDisplayName; // 0x38(0x10)
	enum class ELuminFrameTimingHint FrameTimingHint; // 0x48(0x01)
	bool bProtectedContent; // 0x49(0x01)
	bool bManualCallToAppReady; // 0x4a(0x01)
	bool bUseMobileRendering; // 0x4b(0x01)
	bool bUseVulkan; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
	struct FFilePath Certificate; // 0x50(0x10)
	struct FDirectoryPath IconModelPath; // 0x60(0x10)
	struct FDirectoryPath IconPortalPath; // 0x70(0x10)
	struct FLocalizedIconInfos LocalizedIconInfos; // 0x80(0x10)
	int32_t VersionCode; // 0x90(0x04)
	int32_t MinimumAPILevel; // 0x94(0x04)
	struct TArray<enum class ELuminPrivilege> AppPrivileges; // 0x98(0x10)
	struct TArray<struct FLuminComponentSubElement> ExtraComponentSubElements; // 0xa8(0x10)
	struct TArray<struct FLuminComponentElement> ExtraComponentElements; // 0xb8(0x10)
	struct FString SpatializationPlugin; // 0xc8(0x10)
	struct FString ReverbPlugin; // 0xd8(0x10)
	struct FString OcclusionPlugin; // 0xe8(0x10)
	int32_t SoundCueCookQualityIndex; // 0xf8(0x04)
	bool bRemoveDebugInfo; // 0xfc(0x01)
	char pad_FD[0x3]; // 0xfd(0x03)
	struct FDirectoryPath VulkanValidationLayerLibs; // 0x100(0x10)
	bool bFrameVignette; // 0x110(0x01)
	char pad_111[0x7]; // 0x111(0x07)
	struct TArray<struct FLocalizedAppName> LocalizedAppNames; // 0x118(0x10)
	char pad_128[0x20]; // 0x128(0x20)
};

