// UserDefinedStruct PlayerAnimMontageSet.PlayerAnimMontageSet
// Size: 0xe8 (Inherited: 0x00)
struct FPlayerAnimMontageSet {
	struct UAnimMontage* StartBattle_UP_9_44128E0F4415D06BD70987BD1C1267E1; // 0x00(0x08)
	struct UAnimMontage* StartBattle_LO_10_30C1C6394DFD2925FB1C9F9274FF62B0; // 0x08(0x08)
	struct UAnimMontage* EndBattle_UP_11_18A6D7AC4BC1C04FC40E1FBEC1858BC1; // 0x10(0x08)
	struct UAnimMontage* EndBattle_LO_12_AFF6DA0D40631C5E2E813184610FFE8E; // 0x18(0x08)
	struct UAnimMontage* SAS_DAMAGE_UP_13_5D95AC5E4BBE074D8F22F8B39DDE5D18; // 0x20(0x08)
	struct UAnimMontage* SAS_DAMAGE_LO_14_75795E1F4D1E3DC5B36CCAAF8A832829; // 0x28(0x08)
	struct UAnimMontage* BATTLE_SAS_DAMAGE_UP_17_5BC6CA764DEF250D3262E0A864816223; // 0x30(0x08)
	struct UAnimMontage* BATTLE_SAS_DAMAGE_LO_18_E396ACA8430AE3F3F2C0398A957BC965; // 0x38(0x08)
	struct UAnimMontage* END_BRAINFIELD_21_2465A265476B586AAB9931AED14F7263; // 0x40(0x08)
	struct UAnimMontage* EndAttackTelepo_27_61BD12C647FD5C8C154554878285AA06; // 0x48(0x08)
	struct UAnimMontage* WalkStart_Battle_Upper_34_0546663748BCB648CF6BF599A35FAE39; // 0x50(0x08)
	struct UAnimMontage* WalkEnd_Battle_Upper_36_6DDAFDA342A14CEE9564D48D96E2D773; // 0x58(0x08)
	struct UAnimMontage* ChargeWeaponStartUP_40_3D246A2E4CAED89850F46686AF30F374; // 0x60(0x08)
	struct UAnimMontage* ChargeWeaponStartLO_43_100BD7F149E4635EB96C6EABA3612E84; // 0x68(0x08)
	struct UAnimMontage* Capture_Start_UP_60_CF9758734507E6E589F6C69A55CE6A63; // 0x70(0x08)
	struct UAnimMontage* Capture_Loop_UP_61_77CB79F24F2C0828BDDC6F97D61C8B3A; // 0x78(0x08)
	struct UAnimMontage* Capture_Cancel_UP_62_8EFE414C4C78AD62198D8C9701CC9468; // 0x80(0x08)
	struct UAnimMontage* PsychicAttack0_UP_54_377444F14D1B5A41C987CE91E9C251E7; // 0x88(0x08)
	struct UAnimMontage* PsychicAttackLeft_UP_78_35B1CE694C25393AEADC909098026542; // 0x90(0x08)
	struct UAnimMontage* PsychicAttackLeft_Loop_UP_79_33D7760A499063DDBEB641BB990BA66D; // 0x98(0x08)
	struct UAnimMontage* PsychicAttackLeft_Cancel_UP_80_956CF78C424044964034DFBA59E6171D; // 0xa0(0x08)
	struct UAnimMontage* PsychicAttackRight_UP_81_FD5979584DA135852ECB2CAEFD22F8CD; // 0xa8(0x08)
	struct UAnimMontage* PsychicAttackRight_Loop_UP_82_CAEB143A4FBBFA7E49A7928E1DA2C469; // 0xb0(0x08)
	struct UAnimMontage* PsychicAttackRight_Cancel_UP_83_1F594C484F7CB9EE813BCA9B1ACFF225; // 0xb8(0x08)
	struct UAnimMontage* AddDamage_Stand_86_D74A54A84E5D802F07A377A8E6F1A64B; // 0xc0(0x08)
	struct UAnimMontage* AddDamage_DownF_89_4677225F4BAAE0873F9604929106A85F; // 0xc8(0x08)
	struct UAnimMontage* AddDamage_DownB_90_A41D087F4C8CE14B8CC86CAAD04A9D97; // 0xd0(0x08)
	struct UAnimMontage* PsychicFallLeft_UP_94_E1B5099348D3ECDDA45DD19C139CFD6D; // 0xd8(0x08)
	struct UAnimMontage* PsychicFallRight_UP_96_E9F39F4A433F451EEB3E34B1D04AC527; // 0xe0(0x08)
};

