// UserDefinedStruct PsychicGrabMovementData.PsychicGrabMovementData
// Size: 0xac (Inherited: 0x00)
struct FPsychicGrabMovementData {
	struct UCurveFloat* GrabLiftUp_HeightCurve_94_54F2B0A54781D5F66541E9BB99744681; // 0x00(0x08)
	float GrabLiftUp_Height_24_D047288447194DD53854BA93CEFFAD20; // 0x08(0x04)
	float GrabLiftUp_Time_26_ED5E76EF4AA2B913347BB8AD884021F5; // 0x0c(0x04)
	struct UCurveFloat* GrabMove_HeightCurve_95_1ECF86734C247948FF22BA8945DB006E; // 0x10(0x08)
	struct UCurveFloat* GrabMove_SpeedCurve_96_6771211A434D233DEE825F83DAF4E237; // 0x18(0x08)
	struct UCurveFloat* GrabMove_RotateCurve_97_9D3FE64849B2D7A5B079CBB13289D19E; // 0x20(0x08)
	struct UCurveFloat* GrabMove_DecelCurve_98_FAB150F94A27F9CCCF77CDA25EF8A995; // 0x28(0x08)
	struct UCurveFloat* GrabMove_ReturnCurve_99_0FD16FBE4FF5CD81C6639CA33CA83BCE; // 0x30(0x08)
	struct UCurveFloat* GrabMove_ReloadSpeedCurve_100_C945C82D4DD634D91E7ADBABD726CD71; // 0x38(0x08)
	struct UCurveFloat* GrabMove_ReloadHeightCurve_103_FD679DD1414E01CE8E8F3F9F88A59572; // 0x40(0x08)
	float GrabMove_DecelTime_43_0578A2194E1AD0E076FD1693AF4099B8; // 0x48(0x04)
	float GrabMove_ReturnTime_45_B2F19384451BFD50680982AF9C114443; // 0x4c(0x04)
	float GrabMove_SlopeDistanceSq_47_573BC324451D8EEA9CF7B68781736F2F; // 0x50(0x04)
	float GrabMove_Height_50_BF87FE384309FB0518C5FD932B4D986D; // 0x54(0x04)
	float GrabFloat_MoveSpeedMax_52_6B76C62846B67513F8AFA08EE2E47009; // 0x58(0x04)
	float GrabFloat_MoveAcccel_55_D34D56BA4E5ACE26B00A76B1A1F8AEB9; // 0x5c(0x04)
	float GrabFloat_MoveDelayDistance_57_0FCAD5B149D605904B56B3AFEB079D6A; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct UCurveFloat* GrabFloatMoveSlopeCurve_106_EFAF1DC84D7831A81778AE801E18D9CA; // 0x68(0x08)
	float GrabFloat_AnimPlayRateMin_72_E31CCE29462C6A54CAB47987DEE4DE01; // 0x70(0x04)
	float GrabFloat_AnimPlsyRateMax_73_8AB38E72473F1FDC45CE278F9C897885; // 0x74(0x04)
	struct UCurveFloat* GrabFloat_RiseHeightCurve_102_9F7215C948E87D76E0569EBD9C8B1F1B; // 0x78(0x08)
	float GrabFloat_RiseSpeedMin_75_CF309FD14EC24746F249A3A93CA043F1; // 0x80(0x04)
	float GrabFloat_RiseSpeedMax_77_EF6E3484421C4358E39C599C3D21EEFE; // 0x84(0x04)
	float GrabFloat_RiseDelayTimeMax_78_0B7097C6426E47C3FB7A77A9D69C0AC7; // 0x88(0x04)
	float GrabFloat_RiseSpeedThrow_79_A0C66C1843D3C08A4B2A6A80A44BD30F; // 0x8c(0x04)
	float GrabFloat_RiseSpeedDrop_80_9A3493444620B36EA0964EB5F7A672A5; // 0x90(0x04)
	float GrabFloat_RiseSpeedSwing_81_CBEAF20146AE82F9CE8C89BBA2742301; // 0x94(0x04)
	float GrabFloat_RiseSpeedOther_82_41A5DA3E4F3F6BEADE26DBBC7653951D; // 0x98(0x04)
	float GrabFloat_RiseHeightThrow_83_8184C73743F0DD7B47B2C799230AF07A; // 0x9c(0x04)
	float GrabFloat_RiseHeightDrop_84_E4177BE442124883E37CA6A0283A5017; // 0xa0(0x04)
	float GrabFloat_RiseHeightSwing_85_84FE15B749DBFBA2347C7EBADB280691; // 0xa4(0x04)
	float GrabFloat_RiseHeightOther_86_9DBBAEED48916CDE73B63C918302CFDF; // 0xa8(0x04)
};

