// BlueprintGeneratedClass PsychicGrabComponent.PsychicGrabComponent_C
// Size: 0x524 (Inherited: 0xc0)
struct UPsychicGrabComponent_C : UActorComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xc0(0x08)
	struct APsychicObjectManager_C* PsyObjManager; // 0xc8(0x08)
	struct ARsBattleHero_C* grabOwner; // 0xd0(0x08)
	struct TArray<struct ABP_PsychicObjectBasic_C*> SearchList; // 0xd8(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> GrabList; // 0xe8(0x10)
	struct TArray<bool> EmptyGrabList; // 0xf8(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> SearchUniqueList; // 0x108(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> UniqueList; // 0x118(0x10)
	struct TArray<bool> EmptyUniqueList; // 0x128(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> BrainList; // 0x138(0x10)
	struct TArray<bool> EmptyBrainList; // 0x148(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> SourceList; // 0x158(0x10)
	int32_t sourceCount; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
	struct TArray<bool> EmptySourceList; // 0x170(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> ReleaseList; // 0x180(0x10)
	int32_t releaseCount; // 0x190(0x04)
	char pad_194[0x4]; // 0x194(0x04)
	struct TArray<struct ABP_PsychicObjectBasic_C*> RequestObjList; // 0x198(0x10)
	struct TArray<int32_t> RequestIndexList; // 0x1a8(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> ButtonList; // 0x1b8(0x10)
	struct TArray<int32_t> GrabObjCountList; // 0x1c8(0x10)
	struct TArray<int32_t> GrabObjCountWorkList; // 0x1d8(0x10)
	int32_t GrabObjCountUnique; // 0x1e8(0x04)
	char pad_1EC[0x4]; // 0x1ec(0x04)
	struct TArray<struct FVector> BrainPosList; // 0x1f0(0x10)
	struct TArray<int32_t> BrainZoneList; // 0x200(0x10)
	float deltaPsychic; // 0x210(0x04)
	float deltaRate; // 0x214(0x04)
	bool bPsychicCaptrue; // 0x218(0x01)
	enum class EEasingFunc EasingScanAlpha; // 0x219(0x01)
	enum class EEasingFunc EasingScanPercent; // 0x21a(0x01)
	char pad_21B[0x1]; // 0x21b(0x01)
	float CaptureFieldOffsetZ; // 0x21c(0x04)
	float MeshScaleTime; // 0x220(0x04)
	float meshScaleRate; // 0x224(0x04)
	struct UMaterialInstanceDynamic* Mid; // 0x228(0x08)
	struct UMaterialInterface* CaptureMaterial; // 0x230(0x08)
	float GrabGaugeAdd; // 0x238(0x04)
	float GrabGaugeTimer; // 0x23c(0x04)
	struct TArray<bool> bButtonShowList; // 0x240(0x10)
	struct TArray<bool> bButtonEnableList; // 0x250(0x10)
	struct TArray<bool> bActionPressed; // 0x260(0x10)
	struct TArray<bool> bShowList; // 0x270(0x10)
	bool bPsychicCombo; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	int32_t SlotMax; // 0x284(0x04)
	int32_t StackMax; // 0x288(0x04)
	int32_t GrabMax; // 0x28c(0x04)
	int32_t GrabSkillMax; // 0x290(0x04)
	int32_t ExtraMax; // 0x294(0x04)
	int32_t SourceMax; // 0x298(0x04)
	int32_t UniqueMax; // 0x29c(0x04)
	int32_t UniqueSkillMax; // 0x2a0(0x04)
	int32_t BrainMax; // 0x2a4(0x04)
	int32_t grabObjMax; // 0x2a8(0x04)
	int32_t grabSlotMax; // 0x2ac(0x04)
	int32_t GrabExMax; // 0x2b0(0x04)
	int32_t pageNo; // 0x2b4(0x04)
	bool bDbDispSphere; // 0x2b8(0x01)
	bool bDbDispSearchLine; // 0x2b9(0x01)
	bool bDbDispGrabLine; // 0x2ba(0x01)
	bool bDbDispUniqueLine; // 0x2bb(0x01)
	bool bDbDispBrainLine; // 0x2bc(0x01)
	bool bReload; // 0x2bd(0x01)
	bool bPsychicEx; // 0x2be(0x01)
	bool bShieldOn; // 0x2bf(0x01)
	enum class PsychicObjectAttackType ActionType; // 0x2c0(0x01)
	enum class PsychicGrabButtonType actionButton; // 0x2c1(0x01)
	char pad_2C2[0x2]; // 0x2c2(0x02)
	int32_t actionCombo; // 0x2c4(0x04)
	float AttackThrowStartRotSpeed; // 0x2c8(0x04)
	float AttackThrowStartInitAngle; // 0x2cc(0x04)
	float AttackThrowAllLerpTime; // 0x2d0(0x04)
	float AttackThrowAllDelayTime; // 0x2d4(0x04)
	float AttackThrowAllRadiusRandom; // 0x2d8(0x04)
	float AttackThrowAllRotSpeed; // 0x2dc(0x04)
	float AttackThrowAllCost; // 0x2e0(0x04)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct TArray<int32_t> AttackThrowAllIndexList; // 0x2e8(0x10)
	struct TArray<float> AttackThrowAllAngleList; // 0x2f8(0x10)
	struct TArray<struct FVector> AttackThrowAllOffsetList; // 0x308(0x10)
	bool bBrainField; // 0x318(0x01)
	char pad_319[0x3]; // 0x319(0x03)
	float BrainFieldDistanceBase; // 0x31c(0x04)
	float BrainFieldDistanceRange; // 0x320(0x04)
	float BrainFieldDistanceGap; // 0x324(0x04)
	float BrainFieldHeightMin; // 0x328(0x04)
	float BrainFieldHeightMax; // 0x32c(0x04)
	struct TArray<int32_t> BrainIndexList; // 0x330(0x10)
	float BrainFloatTime; // 0x340(0x04)
	float BrainFloatTimeRandom; // 0x344(0x04)
	float BrainFloatHeight; // 0x348(0x04)
	float BrainFloatHeightRandom; // 0x34c(0x04)
	float ButtonChargeTime; // 0x350(0x04)
	char pad_354[0x4]; // 0x354(0x04)
	struct TArray<bool> bButtonOn; // 0x358(0x10)
	struct TArray<float> buttonTimer; // 0x368(0x10)
	struct TArray<int32_t> buttonNotice; // 0x378(0x10)
	struct TArray<int32_t> BrainAttackObjNum; // 0x388(0x10)
	struct TArray<float> BrainAttackWaitTime; // 0x398(0x10)
	bool bUniqueSpawn; // 0x3a8(0x01)
	bool bDbDispAttachObj; // 0x3a9(0x01)
	bool bDbDispCopyObj; // 0x3aa(0x01)
	bool bPsychicGague; // 0x3ab(0x01)
	int32_t PsychicGauge; // 0x3ac(0x04)
	struct FMulticastInlineDelegate UpdatePsyActionPress; // 0x3b0(0x10)
	struct FMulticastInlineDelegate UpdatePsyActionShow; // 0x3c0(0x10)
	struct FMulticastInlineDelegate UpdatePsyActionEnable; // 0x3d0(0x10)
	struct FMulticastInlineDelegate UpdatePsyActionCount; // 0x3e0(0x10)
	bool bDodgeCheck; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	int32_t DodgeCount; // 0x3f4(0x04)
	struct ABP_PsychicObjectBasic_C* ActionPsyObj; // 0x3f8(0x08)
	struct TArray<enum class E_SASKind> SasKind; // 0x400(0x10)
	struct TArray<struct ABP_PsychicObjectBasic_C*> SasCopyList; // 0x410(0x10)
	bool bSasCopyUpdate; // 0x420(0x01)
	char pad_421[0x7]; // 0x421(0x07)
	struct FMulticastInlineDelegate UpdatePsyActionPress2; // 0x428(0x10)
	struct FMulticastInlineDelegate UpdatePsyActionShow2; // 0x438(0x10)
	struct FMulticastInlineDelegate UpdatePsyActionEnable2; // 0x448(0x10)
	struct FMulticastInlineDelegate UpdatePsyActionCount2; // 0x458(0x10)
	int32_t ButtonCountNormal; // 0x468(0x04)
	int32_t ButtonCountUnique; // 0x46c(0x04)
	bool ButtonShowNormal; // 0x470(0x01)
	bool ButtonShowUnique; // 0x471(0x01)
	bool ButtonEnableNormal; // 0x472(0x01)
	bool ButtonEnableUnique; // 0x473(0x01)
	bool bNewAttach; // 0x474(0x01)
	bool bCameraRot; // 0x475(0x01)
	char pad_476[0x2]; // 0x476(0x02)
	struct FRotator CameraRot; // 0x478(0x0c)
	struct FRotator CameraRotHrz; // 0x484(0x0c)
	struct UMaterialInstance* CaptureMaxMaterial; // 0x490(0x08)
	float CaptrueRadiusBase; // 0x498(0x04)
	float CaptrueRadiusSkill; // 0x49c(0x04)
	float CaptrueRadius; // 0x4a0(0x04)
	float SkillReloadTimeRate; // 0x4a4(0x04)
	struct ABP_PsychicObjectBasic_C* LiftUpThrowObj; // 0x4a8(0x08)
	struct TArray<float> CaptureFieldMaxScalar; // 0x4b0(0x10)
	struct TArray<struct FLinearColor> CaptureFieldMaxVector; // 0x4c0(0x10)
	struct TArray<float> CaptureFieldBaseScalar; // 0x4d0(0x10)
	struct TArray<struct FLinearColor> CaptureFieldBaseVector; // 0x4e0(0x10)
	struct TArray<int32_t> CaptureFieldScalarIndex; // 0x4f0(0x10)
	struct TArray<int32_t> CaptureFieldVectorIndex; // 0x500(0x10)
	float CaptrueMaxRate; // 0x510(0x04)
	float CaptrueAnimationTime; // 0x514(0x04)
	float CaptrueAnimationSpeedBase; // 0x518(0x04)
	float CaptrueAnimationSpeedMax; // 0x51c(0x04)
	float CaptrueMaxInterpolateScale; // 0x520(0x04)

	void DebugPrintAbolishString(struct FString str in); // Function PsychicGrabComponent.PsychicGrabComponent_C.DebugPrintAbolishString // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PrivateUpdateCaptureFieldMaterial(); // Function PsychicGrabComponent.PsychicGrabComponent_C.PrivateUpdateCaptureFieldMaterial // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PrivateInitializeCaptureFieldMaterial(); // Function PsychicGrabComponent.PsychicGrabComponent_C.PrivateInitializeCaptureFieldMaterial // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetLiftUpThrow(enum class PsychicGrabButtonType button type in, struct ABP_PsychicObjectBasic_C* psy obj in); // Function PsychicGrabComponent.PsychicGrabComponent_C.SetLiftUpThrow // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
