// UserDefinedStruct PsychicGrabMovementSizeData.PsychicGrabMovementSizeData
// Size: 0xb0 (Inherited: 0x00)
struct FPsychicGrabMovementSizeData {
	struct UCurveFloat* GrabStart_SpeedCurve_26_8CFF8B6742B34E8A73587CA28AE16B3E; // 0x00(0x08)
	struct UCurveFloat* GrabStart_RotateCurve_27_C5479FCC425552F0F4BC909DACABD64C; // 0x08(0x08)
	float GrabStart_TimeRateMin_19_87531055455DA591114A90A0F6F447A3; // 0x10(0x04)
	float GrabStart_TimeRateMax_20_9B305FDE42FE4B8E113AFD9C18ECF246; // 0x14(0x04)
	float GrabStart_SpeedRateMin_21_4BDCDFEB42E781B097C1C8A1C7B231E5; // 0x18(0x04)
	float GrabStart_SpeedRateMax_22_12CFB4B8445D7D53171CF5AD320D024F; // 0x1c(0x04)
	float GrabStart_RotateRateMin_23_3F88DDF44A62BD3BF1C14287EAF19623; // 0x20(0x04)
	float GrabStart_RotateRateMax_24_B873F84E4AAB1E5B2A24938BE2A35CAA; // 0x24(0x04)
	float GrabLiftUp_DelayTime_25_663AC25F4331CD1F940EC7AF28960224; // 0x28(0x04)
	float ParticleRateCapture_64_A5E38D3F48168D88C832D6BAB9358AA1; // 0x2c(0x04)
	float ParticleRateCaptureAura_70_EE20E5904E826BEB169C898EBBF9E27F; // 0x30(0x04)
	float ParticleRateFire_32_1B818E0143AF4082E92EF68537E3398D; // 0x34(0x04)
	float ParticleRateThunder_33_B9111F8340606DA7AF95438205E67AD6; // 0x38(0x04)
	float ParticleRateCopy_34_C6F4D1A948CA2369051EDC87038F1262; // 0x3c(0x04)
	struct FVector ParticleSizeCapture_65_94D0414A4D5528534C57A7A4EF52B696; // 0x40(0x0c)
	struct FVector ParticleSizeCaptureAura_73_1B82CF4047B9951156068D9481868BE0; // 0x4c(0x0c)
	struct FVector ParticleSizeFireMin_74_FE786F1F4B1ED1B4FBFC1ABA889BC546; // 0x58(0x0c)
	struct FVector ParticleSizeFireMax_77_A96E1CAE4E565949DECC33872B9C2E5B; // 0x64(0x0c)
	struct FVector ParticleSizeThunderMin_78_5911E3F14A47B7203DF69A92DA90E77F; // 0x70(0x0c)
	struct FVector ParticleSizeThunderMax_80_48A72BC849645E3B89B520AF9EE32AA7; // 0x7c(0x0c)
	struct FVector ParticleSizeCopy_46_678BFE374FE86F17CA214092B42E15B6; // 0x88(0x0c)
	float CameraShakeScale_58_CC171A1A444B65836186D8B32644BFAC; // 0x94(0x04)
	struct UCameraShake* CameraShakeTypeThrow_53_BA913E8F4BD8351AF46F7EB6452D2383; // 0x98(0x08)
	struct UCameraShake* CameraShakeTypeDrop_54_868DCEE54C124A080D72F1897BEA8E90; // 0xa0(0x08)
	struct UCameraShake* CameraShakeTypeSwing_55_F9E4225C44D8C3839BE84081A69ECB60; // 0xa8(0x08)
};

