// UserDefinedStruct PsychicObjectCommonParameter.PsychicObjectCommonParameter
// Size: 0x170 (Inherited: 0x00)
struct FPsychicObjectCommonParameter {
	float TickControl_ActiveDistance_173_87FDF7D34BE3488EEA2B8CA4C1ED4340; // 0x00(0x04)
	int32_t TickControl_ActorPreFrame_174_B48787B44A8E6A33C96345B770E1AC8A; // 0x04(0x04)
	int32_t TickControl_ChangePreFrame_183_41DE09FC45D5077EB313C7B6D8324CC2; // 0x08(0x04)
	bool CaptureLimit_Enable_203_9D141D3648E107C6E3206A9A2A1C1531; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float CaptureLimit_Distance_209_3A3316D245A3811AF8B1D4BEEE7F0F7E; // 0x10(0x04)
	int32_t CaptureLimit_Count_210_53BF553246321C3E8DEDA195BB309B56; // 0x14(0x04)
	struct TArray<float> Focus_DistanceList_40_15BAF8294BF458CA9E8FAEABC6A0FC76; // 0x18(0x10)
	struct TArray<int32_t> Focus_DistancePointList_125_43D69B8B48525B99BBFA17A0502AC1C2; // 0x28(0x10)
	struct TArray<float> Focus_AngleList_42_418CCED745D9D11395C0669362A9C3C3; // 0x38(0x10)
	struct TArray<int32_t> Focus_AnglePointList_126_4F8EFDAD4D0A55C554B9DE8BF6F6D342; // 0x48(0x10)
	float Focus_HeightMin_37_B87867F74D8B26B73ECB7AB5510BF17B; // 0x58(0x04)
	float Focus_HeightMax_39_BDA5C2684747D831FBB5C4BD1B50B237; // 0x5c(0x04)
	float ThrowSpeedEnemyRate_26_6FA07FCF4696C3BF6FE61CAC9CB9A45F; // 0x60(0x04)
	float ThrowHomingSpeedEnemyRate_63_8CD47A77418E06E9767918AA2A27400C; // 0x64(0x04)
	struct TArray<enum class EPsychicObjectSizeType> PsychicField_RequestSizeList_164_811A96294B399AB2CA5820AAC79312E9; // 0x68(0x10)
	int32_t PsychicField_SpawnNumMin_168_A5455C07472CCC11F7B7E0A56762BFA9; // 0x78(0x04)
	float PsychicField_SearchRadius_44_E98A8B744537699B0D4D4285BF66F391; // 0x7c(0x04)
	float PsychicField_CaptureTime_79_E5612C49405B6B4677B329925C2FD36F; // 0x80(0x04)
	float PsychicField_CaptureDelayTimeMin_154_FF2444654C22764758CDFFAD417D3A15; // 0x84(0x04)
	float PsychicField_CaptureDelayTimeMax_156_F878EB654D7CC862DE660B9E557C10D5; // 0x88(0x04)
	float PsychicField_AttractTime_152_A5892D284C2DC098B17CFEA111EDD578; // 0x8c(0x04)
	int32_t BrainField_SpawnObjectNum_108_74E382954E74ABD02A0B64BFF7774CC0; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
	struct TArray<enum class EPsychicObjectSizeType> BrainField_RequestSizeList_163_FED7A70F4AECEC7310A1D6904F75C47E; // 0x98(0x10)
	float BrainField_SpawnAngleMax_69_08D5428F407F576D84C147AC08B9AE2D; // 0xa8(0x04)
	float BrainField_SpawnAngleMin_67_266A3022418B15DE837002BD20C8611E; // 0xac(0x04)
	float BrainField_SpawnDistanceMin_71_7D58CDDB4A980D2247AFDEB6AB722CF8; // 0xb0(0x04)
	float BrainField_SpawnDistanceMax_73_88B88F474D462B0C7562998FFF8BEDB4; // 0xb4(0x04)
	float BrainField_SpawnHeightMin_75_30C9B3014B88A8CEE8F7EA993EBE8C53; // 0xb8(0x04)
	float BrainField_SpawnHeightMax_77_1CC34F7649AFE2C63F8478960A2E2CB2; // 0xbc(0x04)
	struct TArray<int32_t> BrainField_SwingObjNumLevelList_99_BFA7AC704B657DACAD2DA9B26B1D3504; // 0xc0(0x10)
	float BrainField_SwingCollisionOffset_107_93D9BFBF4F1820B0D966318CF995B262; // 0xd0(0x04)
	float BrainField_SwingCollisionEndOffset_194_4B797D13467D7BBE7D501086B16F14E9; // 0xd4(0x04)
	struct TArray<float> BrainField_SwingCollisionRadiusLevelList_130_8A12F1A24B96D0E68127EFA6F8E32163; // 0xd8(0x10)
	struct TArray<float> BrainField_SwingCollisionHalfHeightLevelList_131_A609D7534C5E261D811F34B0F04A7F87; // 0xe8(0x10)
	struct TArray<struct FVector> BrainField_SwingAttachOffsetLevelList_133_391E7B3740162AAFBB41D88BE4845457; // 0xf8(0x10)
	struct FVector BrainField_SwingAttachOffsetRandomMin_179_6B300F45471EFF1F33716185DCAAC2F2; // 0x108(0x0c)
	struct FVector BrainField_SwingAttachOffsetRandomMax_180_CD91ABBC4636F4812DCBE3ACCFB65E20; // 0x114(0x0c)
	struct TArray<int32_t> BrainField_ThrowObjNumLevelList_101_339BCA5948B75740C4347E99A4DDACCD; // 0x120(0x10)
	struct TArray<int32_t> BrainField_DropObjNumLevelList_103_52419645402EC6CD133667991793BE88; // 0x130(0x10)
	float BrainField_DropLookAtRate_91_4E2F4DA547B38E9419549DBB06ED7981; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct TArray<float> BrainField_DropCollisionRadiusLevelList_134_150B5454450BA9B0CC37BABCD967E8A8; // 0x148(0x10)
	float Respawn_RestrictRadius_145_542A461342C908B3239ED4BA4AB6607E; // 0x158(0x04)
	float Respawn_CheckInterval_146_09F6097743D5FC731EF33DB8E64542CD; // 0x15c(0x04)
	float Respawn_TimeNormal_147_1F5FC4EE4BE1E43BB818838263429382; // 0x160(0x04)
	float Respawn_TimeUnique_148_3E98346C4F8B0914B95C32899DBA9165; // 0x164(0x04)
	bool Dither_CheckDistanceEnable_190_5149E91C4EDC25C6998B28B88151B8D8; // 0x168(0x01)
	char pad_169[0x3]; // 0x169(0x03)
	float Dither_CheckDistanceApplyRadius_191_B1FEC1844186F1860C3202AAE7D701B0; // 0x16c(0x04)
};

