// UserDefinedStruct PsychicObjectSizeParameter.PsychicObjectSizeParameter
// Size: 0x114 (Inherited: 0x00)
struct FPsychicObjectSizeParameter {
	float CaptureTimeNormal_129_CB8D928B4E853543F571E88A575B2CF2; // 0x00(0x04)
	float CaptureTimeCombo_130_9FFD744B4E18A4F6E62A97985C5C00A1; // 0x04(0x04)
	float CaptureTimeComboAir_141_E4A1352B4647BEC8DEB783900EE138E9; // 0x08(0x04)
	float CaptureTimeNormalEnemy_275_E1E893724C488841B5B270B9C040EB0A; // 0x0c(0x04)
	float CaptureTimeComboEnemy_274_B73500C7477F748BD24963BFF8609EB1; // 0x10(0x04)
	float CaptureTimeComboAirEnemy_273_7BF9F5D045B1318F1959B7B4823C06CA; // 0x14(0x04)
	float ThrowSpeedNormal_142_29F37E374B3D33F981CF9BB9927D2F0D; // 0x18(0x04)
	float ThrowSpeedCombo_143_7D9CC4F740FC9215429789AFE5595737; // 0x1c(0x04)
	float ThrowSpeedCopy_144_440129BF40A43221361D34A34B8426B8; // 0x20(0x04)
	float ThrowSpeedNormalEnemy_272_1DA233124D95EEEEEA75CD9815EB3913; // 0x24(0x04)
	float ThrowSpeedComboEnemy_271_E13E190A4CCE42E84F9D93A20A790D3B; // 0x28(0x04)
	float ThrowSpeedBrainFieldEnemy_287_08BF7C194621E5F966D5FA99D1B972A7; // 0x2c(0x04)
	float ThrowSpeedPsychicFieldEnemy_279_53FC9A2C47251891B0D89487199A5479; // 0x30(0x04)
	float ThrowHomingSpeedNormal_145_994D36FA494B859F685ECFB0C3062C73; // 0x34(0x04)
	float ThrowHomingSpeedCombo_146_6765416A48D633FC8F9E5CA1BB250C7B; // 0x38(0x04)
	float ThrowHomingSpeedCopy_147_1B36189F4ADFC9153683B9B379583264; // 0x3c(0x04)
	float ThrowHomingSpeedNormalEnemy_270_D9B032414E09C219D21CA29CDA990B0B; // 0x40(0x04)
	float ThrowHomingSpeedComboEnemy_269_81CB123C4F4C3AD4E76EEA8B328448B3; // 0x44(0x04)
	float ThrowHomingSpeedBrainFieldEnemy_288_560D874D467725F8E51C849641F40F3F; // 0x48(0x04)
	struct FVector InterceptAnimationScale_282_5B8893BD44349F4CD63668AD1D71A68A; // 0x4c(0x0c)
	float AttackSphereRadius_148_E98A8B744537699B0D4D4285BF66F391; // 0x58(0x04)
	float SAS_FireValue_226_41E26CBA43B96D3B8704869057FBC256; // 0x5c(0x04)
	float SAS_FireCrash_227_D39DEC724D8994A54B4E0A96B8F58A1A; // 0x60(0x04)
	float SAS_FirePower_228_8C989BF24ED4A40B1097259443F68211; // 0x64(0x04)
	float SAS_ThunderValue_229_66C631AB4B7D2F40583F61A0A72F6299; // 0x68(0x04)
	float SAS_ThunderCrash_230_089CD9A34F99753DB7DAAFAE8A7F9E73; // 0x6c(0x04)
	float SAS_ThunderPower_231_B042B9784EEA850124638491F62045DD; // 0x70(0x04)
	float CopySpawnDistance_206_8C1A4475484CA7123C6323BE815EC63F; // 0x74(0x04)
	float ParticleRateCapture_187_7B2979F746729514F7E534A45A820857; // 0x78(0x04)
	float ParticleRateCaptureAura_171_D4FC374E444A59EAC7ACE18148A5C986; // 0x7c(0x04)
	float ParticleRateFire_172_6AA90BDE425E4231E6A07485EBFDA9FD; // 0x80(0x04)
	float ParticleRateThunder_173_87A4F56942AA02D4EA08CDBF2B09DA6C; // 0x84(0x04)
	float ParticleRateCopy_174_B6BA8FED49D388F3271EC1964B1D4F6B; // 0x88(0x04)
	struct FVector ParticleSizeCapture_194_7C820C4E47E4A432A619B598D87C6C57; // 0x8c(0x0c)
	struct FVector ParticleSizeCaptureAura_195_3A8A8A3B46051A4E634364AD0112AAA8; // 0x98(0x0c)
	struct FVector ParticleSizeFireMin_196_254C3D3B423A39714059108A57CBB011; // 0xa4(0x0c)
	struct FVector ParticleSizeFireMax_197_FE0E00494A552C6E78BF32BD952CF64B; // 0xb0(0x0c)
	struct FVector ParticleSizeThunderMin_198_4BB5F3324F215310A6F2EDACAC7C6DA5; // 0xbc(0x0c)
	struct FVector ParticleSizeThunderMax_199_04856E274EE76DD12BCB72B0626EB115; // 0xc8(0x0c)
	struct FVector ParticleSizeCopy_200_CDA4D5054750BE3FACAC8BBAEFAD6956; // 0xd4(0x0c)
	float PsychicField_LiftUpSpeed_236_0DC3853C41C9714972D6979806B20853; // 0xe0(0x04)
	float BrainField_ParticleRate_190_4A78ABD74C6BA994E0B4F78FB6401823; // 0xe4(0x04)
	float BrainField_ParticleMin_191_5F4216644A4FD439EBC0B1B2E7D86ADF; // 0xe8(0x04)
	float BrainField_ParticleRateAura_192_39000E4740CF20D5416BB189B964C37C; // 0xec(0x04)
	float BrainField_ParticleMinAura_193_8134141F4442DB716564908837BEBBD8; // 0xf0(0x04)
	float CameraShake_Scale_243_9D8EE80F47DFC8A78FF4999EFBFB1956; // 0xf4(0x04)
	struct UCameraShake* CameraShake_Throw_245_1DCE66744672417E665C0B9CA9CABF37; // 0xf8(0x08)
	struct UCameraShake* CameraShake_Drop_248_1B26468B4DB8AE1D61890FAC4D24C04B; // 0x100(0x08)
	struct UCameraShake* CameraShake_Swing_249_7B7FFF7943475DF8207466B77608F084; // 0x108(0x08)
	float Respawn_RestrictRadius_292_8019AA354356B32AF2E7E0B39F080299; // 0x110(0x04)
};

