// UserDefinedStruct PsychicGrabParameterData.PsychicGrabParameterData
// Size: 0x34 (Inherited: 0x00)
struct FPsychicGrabParameterData {
	float ReloadTimeGrab_104_8A92F7C24E6C6F0E1B000AB09B9594D0; // 0x00(0x04)
	float ReloadTimeCombo_105_E54240D54308489DE4AA15862EDCBE89; // 0x04(0x04)
	float ReloadTimeBrain_106_66DD45CF4B7B533ECB9AB58C44B9BF67; // 0x08(0x04)
	float ReloadTimeRandomRate_111_88A189B84ABF9E4C08F418A724F30E74; // 0x0c(0x04)
	float RespawnRestrictRange_122_772AB01548AB734483B89FA1FDCF8CD6; // 0x10(0x04)
	float RespawnRequeueTime_130_2D7F82A54AC351C6C37DCBA5C4F18356; // 0x14(0x04)
	float RespawnTimeNormal_126_A20867EA424FFEEA69D254A26545554F; // 0x18(0x04)
	float RespawnTimeUnique_127_E7E036C5411712E33E2B819E9EA476D6; // 0x1c(0x04)
	int32_t AttackCountSpBoomerang_116_46AA22F042E89E3CC39C14817A38474B; // 0x20(0x04)
	int32_t AttackCountSpChipsaw_117_A71B9D334E53D32F02D00E9C6BE47B99; // 0x24(0x04)
	int32_t AttackCountVM_138_55671329455BF448392A779969663145; // 0x28(0x04)
	float AttackIntervalVM_139_D0E491B04C3D346B88351E8FBF82077F; // 0x2c(0x04)
	float AttackSpreadVM_143_2C9D07E347C42DC2AAF1CEA210192B51; // 0x30(0x04)
};

