// UserDefinedStruct PsychicObjectCaptureParameter.PsychicObjectCaptureParameter
// Size: 0x40 (Inherited: 0x00)
struct FPsychicObjectCaptureParameter {
	float CaptureTime_32_14B11AE641AFDC04B372F0AD26E363B2; // 0x00(0x04)
	float VibrateStartTime_31_4DE8C47B43E5A53C2D48638CE1EB13ED; // 0x04(0x04)
	float VibrateEndTime_30_A0C85926497954FD31941F973AB85013; // 0x08(0x04)
	float VibrateRangeMin_28_170FEBB048CA0CC24ED86092DF5C5942; // 0x0c(0x04)
	float VibrateRangeMax_29_386243BA4B6454028FF08680B4211150; // 0x10(0x04)
	float VibrateSpeedRate_27_420D93054312C32F073FB3BB71F48B21; // 0x14(0x04)
	float LiftUpStartTime_26_836298A6461D76C6A796B19707F52F2F; // 0x18(0x04)
	float LiftUpEndTime_25_993CE3164A76D5356AAA458A6C28781C; // 0x1c(0x04)
	float LiftUpRangeMin_24_6FC2769D44F8E87A377A30A635519438; // 0x20(0x04)
	float LiftUpRangeMax_23_289E51D148F8BFDFDCBC7AA94CC1B4CA; // 0x24(0x04)
	struct UCurveVector* VibratePosCurve_39_73BBF5254BBF12518F9662A685B613CC; // 0x28(0x08)
	struct UCurveFloat* LiftUpHeightCurve_40_3224759248CCF24EBF82EEA11DEBA554; // 0x30(0x08)
	struct UCurveFloat* LiftUpRotCurve_41_3502DF764E095BBD0313BBA12906E0A1; // 0x38(0x08)
};

