// BlueprintGeneratedClass RsBattleHero.RsBattleHero_C
// Size: 0x1def (Inherited: 0x1b13)
struct ARsBattleHero_C : ARSBattlePlayer_C {
	char pad_1B13[0x5]; // 0x1b13(0x05)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1b18(0x08)
	struct UBP_PlayerPsychicObjectComponent_C* BP_PlayerPsychicObjectComponent; // 0x1b20(0x08)
	struct UBP_PlayerSequencerComponent_C* BP_PlayerSequencerComponent; // 0x1b28(0x08)
	struct UDamagePostEffectComponent_C* DamagePostEffectComponent; // 0x1b30(0x08)
	struct UBP_SAS_PlayerState_C* BP_SAS_PlayerState; // 0x1b38(0x08)
	struct UBP_PlayerEmissionComponent_C* BP_PlayerEmissionComponent; // 0x1b40(0x08)
	struct UPsychicGrabComponent_C* PsychicGrabComponent; // 0x1b48(0x08)
	enum class ETimelineDirection EnpcSASTimeLine__Direction_40BE0B2848433BB641F9E4A9E97A4077; // 0x1b50(0x01)
	char pad_1B51[0x7]; // 0x1b51(0x07)
	struct UTimelineComponent* EnpcSASTimeLine; // 0x1b58(0x08)
	float PsychicThrowActionTime; // 0x1b60(0x04)
	float PsychicCaptureActionTime; // 0x1b64(0x04)
	bool IsIK_Init; // 0x1b68(0x01)
	char pad_1B69[0x3]; // 0x1b69(0x03)
	struct FRotator HandRotator; // 0x1b6c(0x0c)
	struct FVector HandOffset; // 0x1b78(0x0c)
	struct FGameTimer AfterTelepoInvincibleTimer; // 0x1b84(0x0c)
	struct FName AfterTelepoInvincibleClaimantName; // 0x1b90(0x08)
	bool CanAnimOverrideSASColor; // 0x1b98(0x01)
	char pad_1B99[0x3]; // 0x1b99(0x03)
	struct FGameTimer SASSeeThroughTimer; // 0x1b9c(0x0c)
	struct TArray<struct FName> HideSASOutlineClaimantList; // 0x1ba8(0x10)
	struct FMulticastInlineDelegate DispatchPsychicUniqueSuccess; // 0x1bb8(0x10)
	struct FMulticastInlineDelegate DispatchPsychicCaptureCompleted; // 0x1bc8(0x10)
	struct FMulticastInlineDelegate DispatchPsychicCaptureCancel; // 0x1bd8(0x10)
	struct FMulticastInlineDelegate DispatchPsychicComboAttack; // 0x1be8(0x10)
	struct TSet<struct FName> PsychicEffectClaimantList; // 0x1bf8(0x50)
	int32_t UniquePsychicBonusLevel; // 0x1c48(0x04)
	bool bPrecedeInputPsychic; // 0x1c4c(0x01)
	bool bPrecedeInputPsychicUnique; // 0x1c4d(0x01)
	char pad_1C4E[0x2]; // 0x1c4e(0x02)
	struct TArray<struct FF_SASInputData> SASInputData; // 0x1c50(0x10)
	struct AMapGimmickObject* CurrentMapGimmickObject; // 0x1c60(0x08)
	bool bEnableCaptureMapGimmick; // 0x1c68(0x01)
	bool bPayPsychicCost; // 0x1c69(0x01)
	bool bPsychicComboPostProcess; // 0x1c6a(0x01)
	bool bCancelMapGimmick; // 0x1c6b(0x01)
	struct FName ClaimantNameDrive; // 0x1c6c(0x08)
	struct FGameTimer AutoStealthIntervalTimer; // 0x1c74(0x0c)
	struct FGameTimer AutoStealthTimer; // 0x1c80(0x0c)
	struct FGameTimer CoverDamageIntervalTimer; // 0x1c8c(0x0c)
	bool SkillAction_AirJump; // 0x1c98(0x01)
	bool SkillAction_BlowRecovery; // 0x1c99(0x01)
	bool SkillAttack_AirCombo1; // 0x1c9a(0x01)
	bool SkillAttack_AirLongPressAttack; // 0x1c9b(0x01)
	bool SkillAttack_WeaponCombo1; // 0x1c9c(0x01)
	bool SkillAttack_WeaponCombo2; // 0x1c9d(0x01)
	bool SkillAttack_PsychicSlam; // 0x1c9e(0x01)
	char pad_1C9F[0x1]; // 0x1c9f(0x01)
	int32_t SkillAttack_ChargeAttackLV; // 0x1ca0(0x04)
	float Skill_WeaponCrashScale; // 0x1ca4(0x04)
	float Skill_PsychicCrashScale; // 0x1ca8(0x04)
	float Skill_DownDamageUp; // 0x1cac(0x04)
	int32_t SkillAttack_BrainFieldThrowLevel; // 0x1cb0(0x04)
	int32_t SkillAttack_BrainFieldSwingLevel; // 0x1cb4(0x04)
	int32_t SkillAttack_BrainFieldChargeLevel; // 0x1cb8(0x04)
	bool bBeginPsychicDither; // 0x1cbc(0x01)
	char pad_1CBD[0x3]; // 0x1cbd(0x03)
	struct TArray<struct AActor*> PsychicDitherIgnoreList; // 0x1cc0(0x10)
	struct FMulticastInlineDelegate DispatchPsychicUniqueInputStart; // 0x1cd0(0x10)
	float PsychicDitherTimer; // 0x1ce0(0x04)
	float PsychicDitherTimerMax; // 0x1ce4(0x04)
	struct FMulticastInlineDelegate DispatchPsychicUniqueEnd; // 0x1ce8(0x10)
	float PsychicDitherEndTime; // 0x1cf8(0x04)
	char pad_1CFC[0x4]; // 0x1cfc(0x04)
	struct TArray<struct FName> SeeThroughPostProcessClaimantNameList; // 0x1d00(0x10)
	float Param_CancelSASCostRate; // 0x1d10(0x04)
	int32_t SASStackNum; // 0x1d14(0x04)
	struct FMulticastInlineDelegate DispatchPsychicUniqueAimBegin; // 0x1d18(0x10)
	bool bCaptureTypeCombo; // 0x1d28(0x01)
	enum class E_SASKind EnpcSASDirectionKind; // 0x1d29(0x01)
	char pad_1D2A[0x6]; // 0x1d2a(0x06)
	struct FAssassinAttackData Param_AssassinAttack; // 0x1d30(0x40)
	float Skill_AerialAttackPsychicGaugeUp; // 0x1d70(0x04)
	bool Skill_PinchStatusUp; // 0x1d74(0x01)
	char pad_1D75[0x3]; // 0x1d75(0x03)
	float Skill_DriveCrashScale; // 0x1d78(0x04)
	bool SkillAction_NoStockBrainField; // 0x1d7c(0x01)
	bool bIgnoreBrainFieldStock; // 0x1d7d(0x01)
	char pad_1D7E[0x2]; // 0x1d7e(0x02)
	struct URSAtomComponentBase* BrainFieldBackGroundVoiceHandle; // 0x1d80(0x08)
	float Skill_PinchAttackUpRate; // 0x1d88(0x04)
	float Skill_PinchDamageDownRate; // 0x1d8c(0x04)
	bool Skill_BrainFieldOverKill; // 0x1d90(0x01)
	bool Skill_AutoPickUp; // 0x1d91(0x01)
	char pad_1D92[0x2]; // 0x1d92(0x02)
	int32_t SkillAttack_PsychicComboAddLevel; // 0x1d94(0x04)
	int32_t SkillAttack_AerialPsychicComboAddLevel; // 0x1d98(0x04)
	bool IsEnpcUseDuelPole; // 0x1d9c(0x01)
	bool bPsychicInputButtonPressed; // 0x1d9d(0x01)
	enum class E_SASKindNative LastUseSASKind; // 0x1d9e(0x01)
	char pad_1D9F[0x1]; // 0x1d9f(0x01)
	int32_t LastUseSASCount; // 0x1da0(0x04)
	char pad_1DA4[0x4]; // 0x1da4(0x04)
	struct URSAtomComponentBase* PsychicComboCaptureSEHandle; // 0x1da8(0x08)
	float Skill_JustDodgeUpRecoveryValue; // 0x1db0(0x04)
	char pad_1DB4[0x4]; // 0x1db4(0x04)
	struct FSkillSASRecoverData Skill_SasRecover; // 0x1db8(0x18)
	bool IsEnpcSasCamera; // 0x1dd0(0x01)
	bool IsEnpcSasTimeDilation; // 0x1dd1(0x01)
	bool Skill_OverkillBonus; // 0x1dd2(0x01)
	char pad_1DD3[0x1]; // 0x1dd3(0x01)
	int32_t SkillAction_AirDodgeCount; // 0x1dd4(0x04)
	float Skill_BrainFieldDamageCut; // 0x1dd8(0x04)
	float SasRecastRecoveryDelayTime; // 0x1ddc(0x04)
	enum class EPlayerPsychicActionParam LastFlyingPsychicPattern; // 0x1de0(0x01)
	enum class RSAttackInputKind LastBrainFieldChargeAttackInputKind; // 0x1de1(0x01)
	char pad_1DE2[0x2]; // 0x1de2(0x02)
	float EnpcSasTimeDilationTimer; // 0x1de4(0x04)
	int32_t SkillAttack_BackStepAttackCount; // 0x1de8(0x04)
	bool bSasTelepoAttackAirResetOnce; // 0x1dec(0x01)
	bool bTelepoComboSetting; // 0x1ded(0x01)
	bool bTelepoComboSettingAir; // 0x1dee(0x01)

	bool EventManagerStart(bool EnableTick, bool Visibility); // Function RsBattleHero.RsBattleHero_C.EventManagerStart // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void EndEnpcSasDirectionTimeDilation(); // Function RsBattleHero.RsBattleHero_C.EndEnpcSasDirectionTimeDilation // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SASCancelEffectAndSEInterface(bool bEffect, bool bSE, bool bDummy); // Function RsBattleHero.RsBattleHero_C.SASCancelEffectAndSEInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void TelepoComboSettingCoordinate(bool bEnableAttack, bool bPrevEnableAttack, bool bEnableAttackAir, bool bPrevEnableAttackAir); // Function RsBattleHero.RsBattleHero_C.TelepoComboSettingCoordinate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
