// BlueprintGeneratedClass RSBattleCharacter.RSBattleCharacter_C
// Size: 0xfed (Inherited: 0x8f0)
struct ARSBattleCharacter_C : ARSCharacterBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x8f0(0x08)
	struct UBP_DamageFloatingControlComponent_C* BP_DamageFloatingControlComponent; // 0x8f8(0x08)
	struct UBPC_RenderScarComponent_C* BPC_RenderScarComponent; // 0x900(0x08)
	struct UBP_HpEventComponent_C* BP_HpEventComponent; // 0x908(0x08)
	struct UBP_RSCharacterCommonDataComponent_C* BP_RSCharacterCommonDataComponent; // 0x910(0x08)
	struct UBP_AssetLoadComponent_C* BP_AssetLoadComponent; // 0x918(0x08)
	struct UParticleManageComponent_C* WeakDamageParticleManageComponent; // 0x920(0x08)
	struct UCapsuleComponent* CharacterOverlapCapsuleComponent; // 0x928(0x08)
	struct UBP_EventParamComponent_C* BP_CharacterEventComponent; // 0x930(0x08)
	struct UBP_GhostTrailComponent_C* BP_GhostTrailComponent; // 0x938(0x08)
	struct UHateTargetComponent* HateTarget; // 0x940(0x08)
	struct UCharactersParameterComponent* CharactersParameter; // 0x948(0x08)
	struct UDamageArrayComponent* DamageArray; // 0x950(0x08)
	struct UDynamicMaterialControllerComponent* DynamicMaterialController; // 0x958(0x08)
	struct UAutoAimComponent* AutoAim; // 0x960(0x08)
	struct UHoveringComponent* Hovering; // 0x968(0x08)
	struct UContinualMoveComponent* ContinualMove; // 0x970(0x08)
	struct UMoveImpulseComponent* MoveImpulse; // 0x978(0x08)
	struct UHitStopComponent* HitStop; // 0x980(0x08)
	struct UHitBitComponent* HitBit; // 0x988(0x08)
	struct UHitCheckReceiverComponent* HitCheckReceiver; // 0x990(0x08)
	struct UDamageResponseComponent* DamageResponse; // 0x998(0x08)
	struct UDamageAcceptComponent* DamageAccept; // 0x9a0(0x08)
	struct UDamageCalcComponent* DamageCalc; // 0x9a8(0x08)
	struct UTeamComponent* Team; // 0x9b0(0x08)
	struct UDamagePropertyMediatorComponent* DamagePropertyMediator; // 0x9b8(0x08)
	struct UMovementPropertyMediator* MovementPropertyMediator; // 0x9c0(0x08)
	struct FName BattleCharaClaimantName; // 0x9c8(0x08)
	int32_t CharactersParameterOffset; // 0x9d0(0x04)
	bool UseCharactersParameterName; // 0x9d4(0x01)
	char pad_9D5[0x3]; // 0x9d5(0x03)
	struct FName CharactersParameterName; // 0x9d8(0x08)
	struct UDataTable* CharactersParameterTable; // 0x9e0(0x08)
	bool UseDeadCharacterName; // 0x9e8(0x01)
	char pad_9E9[0x3]; // 0x9e9(0x03)
	struct FName HateParamName; // 0x9ec(0x08)
	char pad_9F4[0x4]; // 0x9f4(0x04)
	struct UDataTable* HateParamTable; // 0x9f8(0x08)
	bool bNotifyAnimEnd; // 0xa00(0x01)
	bool bReserveAnimEnd; // 0xa01(0x01)
	char pad_A02[0x2]; // 0xa02(0x02)
	float MinRadomX; // 0xa04(0x04)
	float MaxRadomX; // 0xa08(0x04)
	float MinRadomY; // 0xa0c(0x04)
	float MaxRadomY; // 0xa10(0x04)
	float MinRadomZ; // 0xa14(0x04)
	float MaxRandomZ; // 0xa18(0x04)
	bool bNotDamageMotion; // 0xa1c(0x01)
	enum class ECharaDeadType CharaDeadType; // 0xa1d(0x01)
	char pad_A1E[0x2]; // 0xa1e(0x02)
	float FrameDamageTimer; // 0xa20(0x04)
	char pad_A24[0x4]; // 0xa24(0x04)
	struct UParticleSystem* BadStateFlameParticle; // 0xa28(0x08)
	struct TSoftObjectPtr<UParticleSystem> BadStateFlameSoftReference; // 0xa30(0x28)
	struct URSParticleSystemComponentBase* BadStateFlameParticleHandle; // 0xa58(0x08)
	int32_t CurrentAttackAttribute; // 0xa60(0x04)
	char pad_A64[0x4]; // 0xa64(0x04)
	struct UParticleSystem* BadStateElecParticle; // 0xa68(0x08)
	struct TSoftObjectPtr<UParticleSystem> BadStateElecSoftReference; // 0xa70(0x28)
	struct URSParticleSystemComponentBase* BadStateElecParticleHandle; // 0xa98(0x08)
	struct FGameTimer BadEffectWetChangeTimer; // 0xaa0(0x0c)
	char pad_AAC[0x4]; // 0xaac(0x04)
	struct TArray<struct AActor*> AttackHitActorList; // 0xab0(0x10)
	float AreaChangeGravityScale; // 0xac0(0x04)
	int32_t OutlineMaterialIndex; // 0xac4(0x04)
	bool OutlineMaterialEnabled; // 0xac8(0x01)
	bool OutlineMaterialForceEnabled; // 0xac9(0x01)
	char pad_ACA[0x2]; // 0xaca(0x02)
	float OutlineMaterialLength; // 0xacc(0x04)
	bool UseDefaultCapsuleShadow; // 0xad0(0x01)
	bool UseForceMeshShadow; // 0xad1(0x01)
	char pad_AD2[0x6]; // 0xad2(0x06)
	struct FCharactersParameterTable CharacterParameterTableData; // 0xad8(0x1f8)
	struct UMaterialInstanceDynamic* SkinMaterial; // 0xcd0(0x08)
	bool AreaChangeSave; // 0xcd8(0x01)
	char pad_CD9[0x7]; // 0xcd9(0x07)
	struct UParticleSystem* BadStateConfusionParticle; // 0xce0(0x08)
	struct TSoftObjectPtr<UParticleSystem> BadStateConfusionSoftReference; // 0xce8(0x28)
	struct FVector BadStateConfusionParticleScale; // 0xd10(0x0c)
	struct FName BadStateConfusionParticleSocketName; // 0xd1c(0x08)
	char pad_D24[0x4]; // 0xd24(0x04)
	struct URSParticleSystemComponentBase* BadStateConfusionParticleHandle; // 0xd28(0x08)
	int32_t GroupID; // 0xd30(0x04)
	bool IsEventWeak; // 0xd34(0x01)
	char pad_D35[0x3]; // 0xd35(0x03)
	struct FVector ProvokeParticleScale; // 0xd38(0x0c)
	char pad_D44[0x4]; // 0xd44(0x04)
	struct TMap<struct FName, bool> InvalidDamageRequests; // 0xd48(0x50)
	struct TMap<struct FName, struct UParticleSystemComponent*> AnimNotifyStateEffectHandle; // 0xd98(0x50)
	bool IsGraceDamage; // 0xde8(0x01)
	char pad_DE9[0x3]; // 0xde9(0x03)
	float IgnoreEffectLoopSeconds; // 0xdec(0x04)
	bool IsRatioDamage; // 0xdf0(0x01)
	char pad_DF1[0x3]; // 0xdf1(0x03)
	int32_t SubGroupID; // 0xdf4(0x04)
	bool IsHitDelayDeath; // 0xdf8(0x01)
	char pad_DF9[0x3]; // 0xdf9(0x03)
	struct FFNotifyAttackData NotifyAttackData; // 0xdfc(0x10)
	char pad_E0C[0x4]; // 0xe0c(0x04)
	struct AActor* FinishActor; // 0xe10(0x08)
	bool bAccelerating; // 0xe18(0x01)
	bool bBadEffectWetDirEnable; // 0xe19(0x01)
	char pad_E1A[0x2]; // 0xe1a(0x02)
	float WetOnChangeSeconds; // 0xe1c(0x04)
	float WetOffChangeSeconds; // 0xe20(0x04)
	bool bInBeginPlay; // 0xe24(0x01)
	bool bBindHitSlow; // 0xe25(0x01)
	bool UseDither; // 0xe26(0x01)
	bool UseDitherBefore; // 0xe27(0x01)
	struct FCharacterDither CameraDitherData; // 0xe28(0x20)
	bool SetupCelLookMat; // 0xe48(0x01)
	char pad_E49[0x7]; // 0xe49(0x07)
	struct UParticleSystemComponent* BadStateIconHandle; // 0xe50(0x08)
	struct TArray<struct URSParticleSystemComponentBase*> CameraDitherParticleList; // 0xe58(0x10)
	struct UDataTable* CameraDitherDataTableAsset; // 0xe68(0x08)
	bool bOccupiedCameraAttention; // 0xe70(0x01)
	char pad_E71[0x7]; // 0xe71(0x07)
	struct TMap<struct FName, bool> SuperArmorRequests; // 0xe78(0x50)
	bool MeshFitGroundMultipleChecks; // 0xec8(0x01)
	bool IsLeader; // 0xec9(0x01)
	char pad_ECA[0x2]; // 0xeca(0x02)
	int32_t RushBrainFieldLocation; // 0xecc(0x04)
	bool RushBrainFieldLongAway; // 0xed0(0x01)
	char pad_ED1[0x7]; // 0xed1(0x07)
	struct ABP_MakeEventActorBase_C* BrainCrashEvent; // 0xed8(0x08)
	bool IsPartsInvincible; // 0xee0(0x01)
	bool bAreaChange; // 0xee1(0x01)
	bool bNoTipsCheckBadStatusOil; // 0xee2(0x01)
	bool bNoTipsCheckBadStatusFlooded; // 0xee3(0x01)
	bool bIsBrainCrashEventFlag; // 0xee4(0x01)
	char pad_EE5[0x3]; // 0xee5(0x03)
	struct UDataTable* DTEnemyAnimScaleHitStop; // 0xee8(0x08)
	enum class HCSkillAttackType ReceiveAttackType; // 0xef0(0x01)
	bool bEnableNormalAttackReactionCoefficient; // 0xef1(0x01)
	bool bEnablePsychicAttackReactionCoefficient; // 0xef2(0x01)
	char pad_EF3[0x1]; // 0xef3(0x01)
	float ReactionCoefficientReactionSRate; // 0xef4(0x04)
	float ReactionCoefficientReactionLRate; // 0xef8(0x04)
	float ReactionCoefficientDownRate; // 0xefc(0x04)
	float ReactionCoefficientCrashRate; // 0xf00(0x04)
	bool IsHitDDInstantKill; // 0xf04(0x01)
	char pad_F05[0x3]; // 0xf05(0x03)
	struct FVector2D BrainCrashDamageDisplayOffset; // 0xf08(0x08)
	bool bDamageDisplayOffset; // 0xf10(0x01)
	bool IsNoFinishBrainCrash; // 0xf11(0x01)
	char pad_F12[0x6]; // 0xf12(0x06)
	struct FST_DisplayDamageBrainCrashInfo DisplayBrainCrashDamageInfo; // 0xf18(0x30)
	bool IsDisplayBossHp; // 0xf48(0x01)
	char pad_F49[0x3]; // 0xf49(0x03)
	float BossDispBCDamageSecond; // 0xf4c(0x04)
	struct FName BrainCrashDamageDisplayPointName; // 0xf50(0x08)
	float InScreenTolerance; // 0xf58(0x04)
	float BossDelayResetCrashSecond; // 0xf5c(0x04)
	float BattlefieldFenceAppearRate; // 0xf60(0x04)
	bool IsFindBattlefieldFenceOnce; // 0xf64(0x01)
	bool bCanSetTick; // 0xf65(0x01)
	bool IsFrameDamage; // 0xf66(0x01)
	char pad_F67[0x9]; // 0xf67(0x09)
	struct FTransform BrainFieldNormalTransform; // 0xf70(0x30)
	bool IsStartFindBattlefieldFence; // 0xfa0(0x01)
	enum class ERootMotionMode LastRootMotionMode; // 0xfa1(0x01)
	bool bDisableMeshFitGround; // 0xfa2(0x01)
	char pad_FA3[0x5]; // 0xfa3(0x05)
	struct TArray<struct FName> DiableMeshFitGroundClaimantList; // 0xfa8(0x10)
	float UnaffectedTimeDilation; // 0xfb8(0x04)
	float UnaffectedDilationTimer; // 0xfbc(0x04)
	enum class EAnimNotifyTimeDilationMode UnaffectedDilationMode; // 0xfc0(0x01)
	bool IsActiveUpdateUnaffectedTimeDilation; // 0xfc1(0x01)
	char pad_FC2[0x6]; // 0xfc2(0x06)
	struct FString ClaimantNameUnaffectedTimeDilation; // 0xfc8(0x10)
	struct UCurveFloat* UnaffectedCameraAttentionActorCurveOut; // 0xfd8(0x08)
	struct UCurveFloat* UnaffectedCameraAttentionFovCurveOut; // 0xfe0(0x08)
	float UnaffectedCameraAttentionTimer; // 0xfe8(0x04)
	bool IsActiveUpdateUnaffectedCameraAttention; // 0xfec(0x01)

	void CheckExecuteAnimNotifyCharacterKind(enum class ECharaExecuteNotifyKind kind, bool bExecute); // Function RSBattleCharacter.RSBattleCharacter_C.CheckExecuteAnimNotifyCharacterKind // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ClearFlyingForceInterface(); // Function RSBattleCharacter.RSBattleCharacter_C.ClearFlyingForceInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ClearFlyingInterface(struct FName ClaimantName); // Function RSBattleCharacter.RSBattleCharacter_C.ClearFlyingInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetFlyingInterface(struct FName ClaimantName); // Function RSBattleCharacter.RSBattleCharacter_C.SetFlyingInterface // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
