// BlueprintGeneratedClass RSBattlePlayer.RSBattlePlayer_C
// Size: 0x1b13 (Inherited: 0xfed)
struct ARSBattlePlayer_C : ARSBattleCharacter_C {
	char pad_FED[0x3]; // 0xfed(0x03)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xff0(0x08)
	struct UBP_ReactionDilationComponent_C* BP_ReactionDilationComponent; // 0xff8(0x08)
	struct UBP_EnemyAddDamageShakeComponent_C* BP_EnemyAddDamageShakeComponent; // 0x1000(0x08)
	struct UPlayerAsyncScriptComponent* PlayerAsyncScript; // 0x1008(0x08)
	struct UBP_PlayerActionStateSASLink_C* BP_PlayerActionStateSASLink; // 0x1010(0x08)
	struct UBP_PlayerActionStateEndBrainCrash_C* BP_PlayerActionStateEndBrainCrash; // 0x1018(0x08)
	struct UBP_AttachmentManageComponent_C* BP_AttachmentManageComponent; // 0x1020(0x08)
	struct UBP_PlayerActionStateSprintTurnBack_C* BP_PlayerActionStateSprintTurnBack; // 0x1028(0x08)
	struct UDamagePartCollisionComponent* DamagePartCollision; // 0x1030(0x08)
	struct UBP_PlayerActionStateRessurect_C* BP_PlayerActionStateRessurect; // 0x1038(0x08)
	struct UBP_PlayerActionStateRevive_C* BP_PlayerActionStateRevive; // 0x1040(0x08)
	struct UBP_PlayerActionStateControlPsychicObject_C* BP_PlayerActionStateControlPsychicObject; // 0x1048(0x08)
	struct UBP_PlayerActionStateEventMotion_C* BP_PlayerActionStateEventMotion; // 0x1050(0x08)
	struct UBP_PlayerActionStateRecoverBlowDamage_C* BP_PlayerActionStateRecoverBlowDamage; // 0x1058(0x08)
	struct UBP_PlayerActionStateDrive_C* BP_PlayerActionStateDrive; // 0x1060(0x08)
	struct UBP_PlayerDriveComponent_C* BP_PlayerDriveComponent; // 0x1068(0x08)
	struct UBP_PlayerActionStateCaptureMapGimmick_C* BP_PlayerActionStateCaptureMapGimmick; // 0x1070(0x08)
	struct UBP_PlayerActionStateCancelMapGimmick_C* BP_PlayerActionStateCancelMapGimmick; // 0x1078(0x08)
	struct UBP_PlayerAIEvaluateLocationComponent_C* BP_PlayerAIEvaluateLocationComponent; // 0x1080(0x08)
	struct UBP_PlayerCameraComponent_C* BP_PlayerCameraComponent; // 0x1088(0x08)
	struct UBP_PlayerUpperActionStatePsychicAttack_C* BP_PlayerUpperActionStatePsychicAttack; // 0x1090(0x08)
	struct UBP_PlayerUpperActionStateCapture_C* BP_PlayerUpperActionStateCapture; // 0x1098(0x08)
	struct UBP_PlayerMaterialManageComponent_C* BP_PlayerMaterialManageComponent; // 0x10a0(0x08)
	struct UBP_PlayerActionStateDamageBrainCrash_C* BP_PlayerActionStateDamageBrainCrash; // 0x10a8(0x08)
	struct UPlayerLookAtComponent* PlayerLookAtComponent; // 0x10b0(0x08)
	struct URSStateManageComponent* RSStateManage_Upper; // 0x10b8(0x08)
	struct URSStateManageComponent* RSStateManage; // 0x10c0(0x08)
	struct UPlayerScriptComponent* PlayerScript; // 0x10c8(0x08)
	struct UBP_CounterComponent_C* BP_CounterComponent; // 0x10d0(0x08)
	struct UBP_SASTelepoComponent_C* BP_SASTelepoComponent; // 0x10d8(0x08)
	struct UBP_InterceptComponent_C* BP_InterceptComponent; // 0x10e0(0x08)
	struct UBP_PlayerHardenComponent_C* BP_PlayerHardenComponent; // 0x10e8(0x08)
	struct UBP_FacialAnim_C* BP_FacialAnim; // 0x10f0(0x08)
	struct UBP_WeaponManageComponent_C* BP_WeaponManageComponent; // 0x10f8(0x08)
	struct UBP_PlayerStealthComponent_C* BP_PlayerStealthComponent; // 0x1100(0x08)
	struct UBP_PlayerUpperActionStateAttack_C* BP_PlayerUpperActionStateAttack; // 0x1108(0x08)
	struct UBP_PlayerActionStateAfterEvent_C* BP_PlayerActionStateAfterEvent; // 0x1110(0x08)
	struct UBP_PlayerUpperActionStateDamageSAS_C* BP_PlayerUpperActionStateDamageSAS; // 0x1118(0x08)
	struct UBP_PlayerUpperActionStateChangeBattle_C* BP_PlayerUpperActionStateChangeBattle; // 0x1120(0x08)
	struct UBP_PlayerActionStateWalkRun_C* BP_PlayerActionStateWalkRun; // 0x1128(0x08)
	struct UBP_PlayerActionStateIdle_C* BP_PlayerActionStateIdle; // 0x1130(0x08)
	struct UBP_TargetSearchComponent_C* BP_TargetSearchComponent; // 0x1138(0x08)
	struct UBP_JumpComponent_C* BP_JumpComponent; // 0x1140(0x08)
	struct UBP_PlayerAIComponent_C* BP_PlayerAIComponent; // 0x1148(0x08)
	struct UBP_PlayerActionStateDead_C* BP_PlayerActionStateDead; // 0x1150(0x08)
	struct UBP_AttackEmitter_C* BP_AttackEmitter; // 0x1158(0x08)
	struct UBP_PlayerActionStateUseItem_C* BP_PlayerActionStateUseItem; // 0x1160(0x08)
	struct UBP_PlayerActionStateBoringIdle_C* BP_PlayerActionStateBoringIdle; // 0x1168(0x08)
	struct UBP_UseItemComponent_C* BP_ItemUseComponent; // 0x1170(0x08)
	struct UBP_JustDodge_C* BP_JustDodge; // 0x1178(0x08)
	struct UBP_BonusGhostBridgeComponent_C* BP_BonusGhostBridgeComponent; // 0x1180(0x08)
	struct UBP_BonusGhostTrailComponent_C* BP_BonusGhostTrailComponent; // 0x1188(0x08)
	struct UBP_SASCutIn_C* BP_SASCutIn; // 0x1190(0x08)
	struct UBP_PlayerGauge_C* BP_PlayerGauge; // 0x1198(0x08)
	struct UBP_PlayerActionStateWakeUp_C* BP_PlayerActionStateWakeUp; // 0x11a0(0x08)
	struct UBP_PlayerActionStateDown_C* BP_PlayerActionStateDown; // 0x11a8(0x08)
	struct UBP_PlayerActionStateDamageBlow_C* BP_PlayerActionStateDamageBlow; // 0x11b0(0x08)
	struct UBP_PlayerDamageReactionInfo_C* BP_PlayerDamageReactionInfo; // 0x11b8(0x08)
	struct UBP_SASRecastGauge_C* BP_SASRecastGauge; // 0x11c0(0x08)
	struct UBP_PlayerActionStateEvent_C* BP_PlayerActionStateEvent; // 0x11c8(0x08)
	struct UPlayerInputComponent_C* PlayerInputComponent; // 0x11d0(0x08)
	struct UBP_AttackAcceleratorBase_C* BP_AttackAcceleratorBase; // 0x11d8(0x08)
	struct UBP_PlayerUpperActionStateIdle_C* BP_PlayerUpperActionStateIdle; // 0x11e0(0x08)
	struct UBP_PlayerActionStateDamage_C* BP_PlayerActionStateDamage; // 0x11e8(0x08)
	struct UBP_PlayerActionStateAttack_C* BP_PlayerActionStateAttack; // 0x11f0(0x08)
	struct UBP_PlayerActionStateDodge_C* BP_PlayerActionStateDodge; // 0x11f8(0x08)
	struct UBP_PlayerActionStateLand_C* BP_PlayerActionStateLand; // 0x1200(0x08)
	struct UBP_PlayerActionStateFall_C* BP_PlayerActionStateFall; // 0x1208(0x08)
	struct UBP_PlayerActionStateJump_C* BP_PlayerActionStateJump; // 0x1210(0x08)
	struct UBP_PlayerActionStateSprintBrake_C* BP_PlayerActionStateSprintBrake; // 0x1218(0x08)
	struct UBP_PlayerActionStateSprint_C* BP_PlayerActionStateSprint; // 0x1220(0x08)
	struct USprintComponentBP_C* SprintBP; // 0x1228(0x08)
	struct UStepComponentBP_C* StepComponentBP; // 0x1230(0x08)
	struct UCheatCommandListenerComponent* CheatCommandListener; // 0x1238(0x08)
	struct UCutCameraComponent* CutCamera; // 0x1240(0x08)
	struct UAttackInputComponent* AttackInput; // 0x1248(0x08)
	struct UMoveInputComponent* MoveInput; // 0x1250(0x08)
	struct UPlayerCameraRotationComponent_C* PlayerCameraRotationComponent; // 0x1258(0x08)
	struct UPlayerShadeNoiseComponent* PlayerShadeNoise; // 0x1260(0x08)
	struct UCameraComponent* Camera; // 0x1268(0x08)
	struct USpringArmComponent* SpringArm; // 0x1270(0x08)
	float BaseTurnRate; // 0x1278(0x04)
	float BaseLookUpRate; // 0x127c(0x04)
	float DirectionControllRotationSpeed; // 0x1280(0x04)
	struct FName PlayerStatusTableRowName; // 0x1284(0x08)
	float BttleIdleKeepAftAttackSec; // 0x128c(0x04)
	struct FName DefaultStatusClaimantName; // 0x1290(0x08)
	struct FMulticastInlineDelegate OnMovementCollisionLand; // 0x1298(0x10)
	struct UPlayerAnimControllerComponent* PlayerAnimConRef; // 0x12a8(0x08)
	float MoveInputScale; // 0x12b0(0x04)
	bool bJumpMoveInput; // 0x12b4(0x01)
	enum class RSAttackInputKind LastInputAttackType; // 0x12b5(0x01)
	char pad_12B6[0x2]; // 0x12b6(0x02)
	struct UPlayerLookAtComponent* LookAtRef; // 0x12b8(0x08)
	struct TArray<bool> IsSASInput; // 0x12c0(0x10)
	float CameraLagSpeed; // 0x12d0(0x04)
	float CameraLagMaxDistance; // 0x12d4(0x04)
	bool IsCameraLag; // 0x12d8(0x01)
	bool bInputDodge; // 0x12d9(0x01)
	char pad_12DA[0x2]; // 0x12da(0x02)
	float ChangeMontagePlayRate; // 0x12dc(0x04)
	struct UAnimMontage* ChangeMontageRef; // 0x12e0(0x08)
	float StartSpringArmLength; // 0x12e8(0x04)
	float StartSpringArmPitch; // 0x12ec(0x04)
	bool bReserveChangeCombo; // 0x12f0(0x01)
	bool bUpdateHUD; // 0x12f1(0x01)
	char pad_12F2[0x2]; // 0x12f2(0x02)
	struct FVector FallVelocity; // 0x12f4(0x0c)
	enum class EPlayerComboPattern ComboPatternFirst; // 0x1300(0x01)
	enum class EPlayerComboPattern ComboPatternSecond; // 0x1301(0x01)
	char pad_1302[0x2]; // 0x1302(0x02)
	int32_t PlayerIndex; // 0x1304(0x04)
	struct UBP_PlayerFixParamater_C* PlayerFixParam; // 0x1308(0x08)
	struct TArray<struct FRSBeamEffectInfo> ConnectEffectInfoList; // 0x1310(0x10)
	struct TArray<struct ABP_WeaponBase_C*> RegisterThrowWeaponList; // 0x1320(0x10)
	struct FGameTimer BattleOffTimer; // 0x1330(0x0c)
	char pad_133C[0x4]; // 0x133c(0x04)
	struct TArray<struct AActor*> ThrowWeaponTargetList; // 0x1340(0x10)
	struct FName EventInvalidDamageClaimantName; // 0x1350(0x08)
	struct URSParticleSystemComponentBase* EffectHandleBadStateFlooded; // 0x1358(0x08)
	struct URSParticleSystemComponentBase* EffectHandleBadStateOil; // 0x1360(0x08)
	struct UAnimMontage* UpperBlendAnimMontage; // 0x1368(0x08)
	struct UAnimMontage* LowerBlendAnimMontage; // 0x1370(0x08)
	struct FPlayerAnimMontageSet AnimMontageSet; // 0x1378(0xe8)
	struct FMulticastInlineDelegate OnChangePsychicObjShow; // 0x1460(0x10)
	struct FMulticastInlineDelegate OnChangePsychicObjEnable; // 0x1470(0x10)
	struct FMulticastInlineDelegate OnChangePsychicObjUse; // 0x1480(0x10)
	struct FMulticastInlineDelegate OnChangePsychicObjCount; // 0x1490(0x10)
	struct TArray<struct FName> CheckStartAttackFlag; // 0x14a0(0x10)
	struct TSoftObjectPtr<UParticleSystem> BadStateOilParticleSoftReference; // 0x14b0(0x28)
	struct UParticleSystem* BadStateOilParticle; // 0x14d8(0x08)
	struct TSoftObjectPtr<UParticleSystem> BadStateFloodedParticleSoftReference; // 0x14e0(0x28)
	struct UParticleSystem* BadStateFloodedParticle; // 0x1508(0x08)
	struct TArray<struct ABP_SASCopyPlayerActor_C*> CopyPlayerList; // 0x1510(0x10)
	enum class ESASCopyStatus CopyWeaponStatus; // 0x1520(0x01)
	char pad_1521[0x3]; // 0x1521(0x03)
	struct FGameTimer CopyWeaponTImer; // 0x1524(0x0c)
	bool bReserveCopyWeaponVisibleOn; // 0x1530(0x01)
	char pad_1531[0x3]; // 0x1531(0x03)
	struct FVector InputDodgeMoveStick; // 0x1534(0x0c)
	struct ABP_PlayerManager_C* PlayerManager; // 0x1540(0x08)
	struct UBP_ENpcComponent_C* ENPCCompRef; // 0x1548(0x08)
	struct FMulticastInlineDelegate OnChangePsychicObjShow2; // 0x1550(0x10)
	struct FMulticastInlineDelegate OnChangePsychicObjEnable2; // 0x1560(0x10)
	struct FMulticastInlineDelegate OnChangePsychicObjUse2; // 0x1570(0x10)
	struct FMulticastInlineDelegate OnChangePsychicObjCount2; // 0x1580(0x10)
	struct FVector2D FixCameraLeftStick; // 0x1590(0x08)
	bool bFreeCheck; // 0x1598(0x01)
	char pad_1599[0x3]; // 0x1599(0x03)
	int32_t FreeCheckNo; // 0x159c(0x04)
	enum class RSPartyPlayerKind PartyPlayerKind; // 0x15a0(0x01)
	bool isInputEnable; // 0x15a1(0x01)
	char pad_15A2[0x6]; // 0x15a2(0x06)
	struct FMulticastInlineDelegate DispatchMontageBlendingOut; // 0x15a8(0x10)
	struct UDataTable* PresetCameraDataTable; // 0x15b8(0x08)
	struct FGameTimer DisableCameraControlTimer; // 0x15c0(0x0c)
	bool bDebugPause; // 0x15cc(0x01)
	enum class ERSGamepadInputName AI_BUTTON_ATTACK; // 0x15cd(0x01)
	enum class ERSGamepadInputName AI_BUTTON_DODGE; // 0x15ce(0x01)
	enum class ERSGamepadInputName AI_BUTTON_JUMP; // 0x15cf(0x01)
	enum class ERSGamepadInputName AI_BUTTON_ITEM; // 0x15d0(0x01)
	char pad_15D1[0x7]; // 0x15d1(0x07)
	struct FMulticastInlineDelegate OnTelepoDodgeBegin; // 0x15d8(0x10)
	struct FMulticastInlineDelegate OnTelepoDodgeEnd; // 0x15e8(0x10)
	struct FMulticastInlineDelegate DispatchChangeWalkRunStateKind; // 0x15f8(0x10)
	bool bObstructPsychicActionSAS; // 0x1608(0x01)
	bool bObstructPsychicActionPsychic; // 0x1609(0x01)
	bool bObstructPsychicActionAttack; // 0x160a(0x01)
	bool bObstructPsychicActionDrive; // 0x160b(0x01)
	char pad_160C[0x4]; // 0x160c(0x04)
	struct UAnimMontage* ObstructAnimMontage; // 0x1610(0x08)
	bool bObstructPsychicActionBrainCrash; // 0x1618(0x01)
	enum class EPlayerID CoverDamagePlayerID; // 0x1619(0x01)
	bool bReserveCoverDamage; // 0x161a(0x01)
	enum class EPlayerID LastCoverDamagePlayerID; // 0x161b(0x01)
	char pad_161C[0x4]; // 0x161c(0x04)
	struct TArray<struct FVector> LastGroundLocation; // 0x1620(0x10)
	struct ULevelSequence* ObstructSequencer; // 0x1630(0x08)
	bool bBeginningBattleState; // 0x1638(0x01)
	enum class EPlayerReviveCableStep ReviveCableStep; // 0x1639(0x01)
	bool bUpdateDriveHUD; // 0x163a(0x01)
	bool bExecReviveDirection; // 0x163b(0x01)
	enum class ERSGamepadInputName AI_BUTTON_PSYCHIC; // 0x163c(0x01)
	char pad_163D[0x3]; // 0x163d(0x03)
	struct UDataTable* RedCodeDataTable; // 0x1640(0x08)
	struct TArray<struct ABP_CableBase_C*> RedCodeActor; // 0x1648(0x10)
	struct TArray<struct ABP_CableBase_C*> BrainCodeActor; // 0x1658(0x10)
	int32_t EyeIndex; // 0x1668(0x04)
	char pad_166C[0x4]; // 0x166c(0x04)
	struct FMulticastInlineDelegate DispatchMontageEnded; // 0x1670(0x10)
	struct UAttackComponentBaseBP_C* CurrentAttackComponent; // 0x1680(0x08)
	enum class EPlayerDownType EventDownParam; // 0x1688(0x01)
	bool SkillAttack_AirDodgeAttack; // 0x1689(0x01)
	bool bComboInputEnd; // 0x168a(0x01)
	bool bResurrectCameraOn; // 0x168b(0x01)
	char pad_168C[0x4]; // 0x168c(0x04)
	struct UBP_SASHologramAttackCheck_C* SASHologramAttackCheckComponent; // 0x1690(0x08)
	struct TArray<struct FName> PauseTimerClaimantList; // 0x1698(0x10)
	struct FMulticastInlineDelegate DispatchAttackActorHit; // 0x16a8(0x10)
	struct UAnimMontage* EndBrainCrashMontage; // 0x16b8(0x08)
	struct UDataTable* BattleParticleDataTable; // 0x16c0(0x08)
	struct URSParticleSystemComponentBase* BattleParticleHeadHandle; // 0x16c8(0x08)
	struct URSParticleSystemComponentBase* BattleParticleRightHandHandle; // 0x16d0(0x08)
	struct URSParticleSystemComponentBase* BattleParticleLeftHandHandle; // 0x16d8(0x08)
	struct TArray<struct FName> BattleParticleClaimantList; // 0x16e0(0x10)
	enum class EPlayerBattleParticleType BattleParticleType; // 0x16f0(0x01)
	char pad_16F1[0x7]; // 0x16f1(0x07)
	struct TArray<struct FName> VisionFogClaimantList; // 0x16f8(0x10)
	struct TArray<struct FWireNeon> WireNeonDataTableData; // 0x1708(0x10)
	struct TArray<struct FFPlayerBattleParticleData> BattleParticleDataList; // 0x1718(0x10)
	struct URSParticleSystemComponentBase* ForceBrainTalkParticle; // 0x1728(0x08)
	float DelayDeactivateBattleParticleTimer; // 0x1730(0x04)
	char pad_1734[0x4]; // 0x1734(0x04)
	struct FMulticastInlineDelegate DispatchTimerPause; // 0x1738(0x10)
	bool bTalkLookAt; // 0x1748(0x01)
	char pad_1749[0x3]; // 0x1749(0x03)
	struct FVector TalkLookAtLocation; // 0x174c(0x0c)
	struct FMulticastInlineDelegate DispatchTalkTurn; // 0x1758(0x10)
	bool bEventSprintFlag; // 0x1768(0x01)
	char pad_1769[0x3]; // 0x1769(0x03)
	float DefaultCameraLength; // 0x176c(0x04)
	struct FCameraTriggerInfo BrainFieldCameraSetting; // 0x1770(0x28)
	bool bInvisibleMask; // 0x1798(0x01)
	bool bEnablePsychicComboFlag; // 0x1799(0x01)
	bool bIsEnableSAS; // 0x179a(0x01)
	char pad_179B[0x1]; // 0x179b(0x01)
	float AttackMoveParam_Distance; // 0x179c(0x04)
	float AttackMoveParam_Time; // 0x17a0(0x04)
	enum class EEasingFunc AttackMoveParam_EaseType; // 0x17a4(0x01)
	char pad_17A5[0x3]; // 0x17a5(0x03)
	float AttackMoveParam_EaseBlendExp; // 0x17a8(0x04)
	struct FVector AttackMoveParam_MoveDir; // 0x17ac(0x0c)
	float AttackMove_Timer; // 0x17b8(0x04)
	float AttackMove_PrevDistance; // 0x17bc(0x04)
	bool bAttackMove_RotateTarget; // 0x17c0(0x01)
	bool bAttackMove_RotateRight; // 0x17c1(0x01)
	char pad_17C2[0x2]; // 0x17c2(0x02)
	struct FVector CrashChanceCursorOffset; // 0x17c4(0x0c)
	struct FVector HPGaugeOffset; // 0x17d0(0x0c)
	bool bIsBindSASStart; // 0x17dc(0x01)
	char pad_17DD[0x3]; // 0x17dd(0x03)
	struct TArray<bool> bContentsOpenFlag; // 0x17e0(0x10)
	bool bSuspendFlag; // 0x17f0(0x01)
	char pad_17F1[0x7]; // 0x17f1(0x07)
	struct AActor* AttackMoveParam_Target; // 0x17f8(0x08)
	struct FVector AttackMoveParam_BeginLocation; // 0x1800(0x0c)
	bool bCheckChargeTelepo; // 0x180c(0x01)
	char pad_180D[0x3]; // 0x180d(0x03)
	float TelepoAttackEnchantTimer; // 0x1810(0x04)
	bool bExJustDodgeFlag; // 0x1814(0x01)
	char pad_1815[0x3]; // 0x1815(0x03)
	float ExJustDodgeAttackRate; // 0x1818(0x04)
	float ExJustDodgeCrashRate; // 0x181c(0x04)
	struct TArray<struct FName> SuperArmorClaimantList; // 0x1820(0x10)
	bool bLocationChangeFlag; // 0x1830(0x01)
	enum class EPlayerDownType CurrentDownType; // 0x1831(0x01)
	char pad_1832[0x2]; // 0x1832(0x02)
	float TimerAccessoryInvalidDamageAfter; // 0x1834(0x04)
	float NpcWarpDitherRate; // 0x1838(0x04)
	bool bExecNpcRevive; // 0x183c(0x01)
	bool bExecTalkEvent; // 0x183d(0x01)
	char pad_183E[0x2]; // 0x183e(0x02)
	struct FFPlayerBattleVoice BattleVoiceData; // 0x1840(0x80)
	bool bPlayAbleBattleStartVoice; // 0x18c0(0x01)
	char pad_18C1[0x7]; // 0x18c1(0x07)
	struct TArray<struct FName> DisableFootIKClaimantNameList; // 0x18c8(0x10)
	bool bExecDynamicEvent; // 0x18d8(0x01)
	char pad_18D9[0x3]; // 0x18d9(0x03)
	float AddDamageMotionBlendRate; // 0x18dc(0x04)
	int32_t PlayerDeadCount; // 0x18e0(0x04)
	int32_t LastThrowPsychicComboLevel; // 0x18e4(0x04)
	bool bDisableActionBoringIdle; // 0x18e8(0x01)
	char pad_18E9[0x3]; // 0x18e9(0x03)
	float DiscoverIconOffset; // 0x18ec(0x04)
	bool bEnableJustDodgeAttack; // 0x18f0(0x01)
	bool bUseENPCOutline; // 0x18f1(0x01)
	bool SkillAttack_JustDodgeAttack; // 0x18f2(0x01)
	char pad_18F3[0x5]; // 0x18f3(0x05)
	struct TArray<struct FName> DamageCollisionInvincibleClaimantList; // 0x18f8(0x10)
	struct ABP_SeeThroughJustDodgeCutin_C* SasSeeThroughCutIn; // 0x1908(0x08)
	bool bExecSasSeeThroughCutIn; // 0x1910(0x01)
	char pad_1911[0x3]; // 0x1911(0x03)
	float SasSeeThroughCutinTimer; // 0x1914(0x04)
	struct FFPlayerBattleVoiceFacialAnimType BattleVoiceFacialAnimTypeCache; // 0x1918(0x10)
	struct UDataTable* BattleVoiceFacialAnimTypeDT; // 0x1928(0x08)
	struct TArray<struct USoundAtomCue*> GameOverVoiceData; // 0x1930(0x10)
	float FallTimer; // 0x1940(0x04)
	float PsychicComboEndTimer; // 0x1944(0x04)
	bool bEnableChaseAttack_PsychicComboTimer; // 0x1948(0x01)
	bool bBattleEm1500; // 0x1949(0x01)
	char pad_194A[0x6]; // 0x194a(0x06)
	struct FMulticastInlineDelegate TutorialSuccess_Jump; // 0x1950(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_Psychic; // 0x1960(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_Lockon; // 0x1970(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_Attack; // 0x1980(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_Dodge; // 0x1990(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_ChangeLockon; // 0x19a0(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_LaunchAttack; // 0x19b0(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_Dash; // 0x19c0(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_StepInAttack; // 0x19d0(0x10)
	struct FMulticastInlineDelegate TutorialSuccess_PsychicCombo; // 0x19e0(0x10)
	bool bTutorialFlag; // 0x19f0(0x01)
	bool bOldInAerial; // 0x19f1(0x01)
	bool bExecMeshFitGround; // 0x19f2(0x01)
	char pad_19F3[0x1]; // 0x19f3(0x01)
	int32_t SyncResultCounter; // 0x19f4(0x04)
	bool bDecideAttackMoveLocation; // 0x19f8(0x01)
	char pad_19F9[0x3]; // 0x19f9(0x03)
	struct FVector AttackMoveParam_GoalLocation; // 0x19fc(0x0c)
	enum class EJustDodgeAttackSlowStep JustDodgeAttackSlowStep; // 0x1a08(0x01)
	bool bJustDodgeSlowWeaonAttack; // 0x1a09(0x01)
	char pad_1A0A[0x2]; // 0x1a0a(0x02)
	float JustDodgeAttackSlowTimer; // 0x1a0c(0x04)
	float JustDodgeAttackTimeDilation; // 0x1a10(0x04)
	float ParamJustDodgeCutInTimeDilation; // 0x1a14(0x04)
	float JustDodgeAttackSlowTime; // 0x1a18(0x04)
	char pad_1A1C[0x4]; // 0x1a1c(0x04)
	struct UBP_NPCMetamorphosisComponent_C* RefNPCMetamorphosis; // 0x1a20(0x08)
	float StartBattleWaitTime; // 0x1a28(0x04)
	float MaxStepHeightAtBeginPlay; // 0x1a2c(0x04)
	struct FMulticastInlineDelegate Dispatch_AreaChange; // 0x1a30(0x10)
	float possibleBrainCrashRange; // 0x1a40(0x04)
	enum class EPlayerInputSASReadyType CurrentInputSasReadyType; // 0x1a44(0x01)
	char pad_1A45[0x3]; // 0x1a45(0x03)
	struct FFCombinationVisionData CombinationVisionData; // 0x1a48(0x2c)
	int32_t CombinationVisionLearnLevel; // 0x1a74(0x04)
	struct UBP_EnpcDamageMoveComponent_C* EnpcDamageMoveCompRef; // 0x1a78(0x08)
	bool bEnableDispNoDamage; // 0x1a80(0x01)
	bool bCanDropData; // 0x1a81(0x01)
	char pad_1A82[0x6]; // 0x1a82(0x06)
	struct TArray<struct FName> DisableBehaviorTreeClaimantNameList; // 0x1a88(0x10)
	float WeaponEmissiveValue; // 0x1a98(0x04)
	bool bNoCopyAttackFlag; // 0x1a9c(0x01)
	char pad_1A9D[0x3]; // 0x1a9d(0x03)
	float StoredStealthDelayTimer; // 0x1aa0(0x04)
	enum class RSAttackInputKind LastInputAttackTypeSub; // 0x1aa4(0x01)
	bool bStoreLockTargetBeforeBrainCrash; // 0x1aa5(0x01)
	bool bItemUseNoMotion; // 0x1aa6(0x01)
	bool bUseDirectionControlForAI; // 0x1aa7(0x01)
	bool bFallAbleGroundCheckResult; // 0x1aa8(0x01)
	bool bManageCheckFall; // 0x1aa9(0x01)
	char pad_1AAA[0x6]; // 0x1aaa(0x06)
	struct FMulticastInlineDelegate TutorialSuccess_AttackSub; // 0x1ab0(0x10)
	bool bInputAttackSUb; // 0x1ac0(0x01)
	bool bStopEndDriveMode; // 0x1ac1(0x01)
	bool bReserveInitializeDrive; // 0x1ac2(0x01)
	bool bExecTelepoFadeOut; // 0x1ac3(0x01)
	enum class RSAttackInputKind RegisterAttackKind; // 0x1ac4(0x01)
	bool bExecutedLibraryUpdate; // 0x1ac5(0x01)
	char pad_1AC6[0x2]; // 0x1ac6(0x02)
	struct TArray<struct URSParticleSystemComponentBase*> EventEndParticleList; // 0x1ac8(0x10)
	enum class EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOptionDefault; // 0x1ad8(0x01)
	bool bExecuteCombinationAttack; // 0x1ad9(0x01)
	bool bSasAttackTelepoFlag; // 0x1ada(0x01)
	char pad_1ADB[0x1]; // 0x1adb(0x01)
	float SASSelectSlowRate; // 0x1adc(0x04)
	float ReserveDriveTime; // 0x1ae0(0x04)
	float ReserveDriveExtendTime; // 0x1ae4(0x04)
	struct FMulticastInlineDelegate Dispatch_ItemApply; // 0x1ae8(0x10)
	bool bSkipResetEventAction; // 0x1af8(0x01)
	char pad_1AF9[0x7]; // 0x1af9(0x07)
	struct TArray<struct FF_AssultVisionRequestPool> PoolAssultVisionRequest; // 0x1b00(0x10)
	bool bUseMeshFootGroundFromFoot; // 0x1b10(0x01)
	bool bMeshFitChangeLocation; // 0x1b11(0x01)
	bool bInputLockTargetChanged; // 0x1b12(0x01)

	void GetPlayerWeaponManage(struct UBP_WeaponManageComponent_C* WeaponManage); // Function RSBattlePlayer.RSBattlePlayer_C.GetPlayerWeaponManage // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	enum class EEnemyTribe GetEnemyTribe(); // Function RSBattlePlayer.RSBattlePlayer_C.GetEnemyTribe // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsEnemyConsiderDownDead(); // Function RSBattlePlayer.RSBattlePlayer_C.IsEnemyConsiderDownDead // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1685580
	bool SetEnemyConsiderDownDead(bool bEnable); // Function RSBattlePlayer.RSBattlePlayer_C.SetEnemyConsiderDownDead // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
