// BlueprintGeneratedClass RSBattleEnemy.RSBattleEnemy_C
// Size: 0x2088 (Inherited: 0xfed)
struct ARSBattleEnemy_C : ARSBattleCharacter_C {
	char pad_FED[0x3]; // 0xfed(0x03)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xff0(0x08)
	struct UEnemyScrollCheckComponent* EnemyTargetLookCheck; // 0xff8(0x08)
	struct UEnemyPathAreaCheckComponent* EnemyPathAreaCheck; // 0x1000(0x08)
	struct UEnemyCalcGoalComponent* EnemyCalcGoal; // 0x1008(0x08)
	struct UChangeWeakStateComponent_C* ChangeWeakStateComponent; // 0x1010(0x08)
	struct UBP_EnemyGoalComponent_C* BP_EnemyGoalComponent; // 0x1018(0x08)
	struct UBP_EnemyChangePlayRate_C* BP_EnemyChangePlayRate; // 0x1020(0x08)
	struct UBP_EnemyChangeTimeDilationComponent_C* BP_EnemyChangeTimeDilationComponent; // 0x1028(0x08)
	struct UEnemyScriptComponent* EnemyScript; // 0x1030(0x08)
	struct UBP_EnemyAroundWeakEffectComponent_C* BP_EnemyAroundWeakEffectComponent; // 0x1038(0x08)
	struct UEnemyLookCheckComponent* EnemyLookCheck; // 0x1040(0x08)
	struct UBP_Discover_Component_C* BP_Discover_Component; // 0x1048(0x08)
	struct UBP_EnemyAddDamageShakeComponent_C* BP_EnemyAddDamageShakeComponent; // 0x1050(0x08)
	struct UBP_EnemyDamageRagdollComponent_C* BP_EnemyDamageRagdollComponent; // 0x1058(0x08)
	struct UBP_EnemyDamageMoveComponent_C* BP_EnemyDamageMoveComponent; // 0x1060(0x08)
	struct UBP_EnemySpawnComponent_C* BP_EnemySpawnComponent; // 0x1068(0x08)
	struct UBP_EnemyDeadMoveComponent_C* BP_EnemyDeadMoveComponent; // 0x1070(0x08)
	struct UBP_EnemyAvatarMaterial_C* BP_EnemyAvatarMaterial; // 0x1078(0x08)
	struct UBP_EnemyAvatar_C* BP_EnemyAvatar; // 0x1080(0x08)
	struct UStealthWeakComponent_C* StealthWeakComponent; // 0x1088(0x08)
	struct USearchingComponent* Searching; // 0x1090(0x08)
	struct UEnemyDatatableAccessorComponent_C* EnemyDatatableAccessorComponent; // 0x1098(0x08)
	struct UEnemyAnimControllerComponent* AnimCon; // 0x10a0(0x08)
	struct UAIAttackedInfoComponent_C* AIAttackedInfoComponent; // 0x10a8(0x08)
	struct UVanishEnemyComponent_C* VanishComponent; // 0x10b0(0x08)
	struct FName BBKey_BattleAIState; // 0x10b8(0x08)
	struct FName EnemyStatusRowName; // 0x10c0(0x08)
	float SleepAIDistance; // 0x10c8(0x04)
	struct FName DefaultStatusClaimantName; // 0x10cc(0x08)
	struct FName EnemyClaimantName; // 0x10d4(0x08)
	struct FName EnemyDeadClaimantName; // 0x10dc(0x08)
	float DeadEmissiveSec; // 0x10e4(0x04)
	float DeadVanishSec; // 0x10e8(0x04)
	bool bDeadStaging; // 0x10ec(0x01)
	char pad_10ED[0x3]; // 0x10ed(0x03)
	float DeadStagingPastSec; // 0x10f0(0x04)
	float DeadVanishEffectSec; // 0x10f4(0x04)
	float DeadStagingTotalSec; // 0x10f8(0x04)
	char pad_10FC[0x4]; // 0x10fc(0x04)
	struct USoundAtomCue* DeadFinishSE; // 0x1100(0x08)
	float CapsuleRad; // 0x1108(0x04)
	float SearchRange; // 0x110c(0x04)
	float SearchAngle; // 0x1110(0x04)
	float SensingArea; // 0x1114(0x04)
	struct FVector InitPos; // 0x1118(0x0c)
	bool IsFirstAttack; // 0x1124(0x01)
	bool IsInitLayout; // 0x1125(0x01)
	enum class EnemyInitLayoutAnimKind InitLayout; // 0x1126(0x01)
	char pad_1127[0x1]; // 0x1127(0x01)
	struct ATargetPoint* targetPos; // 0x1128(0x08)
	float TargetRange; // 0x1130(0x04)
	bool IsWander; // 0x1134(0x01)
	char pad_1135[0x3]; // 0x1135(0x03)
	float TargetRangeCheck; // 0x1138(0x04)
	bool IsBattleFinish; // 0x113c(0x01)
	bool IsNotSearchTableData; // 0x113d(0x01)
	char pad_113E[0x2]; // 0x113e(0x02)
	float EnableMoveArea; // 0x1140(0x04)
	float DistanceFromEnemyInitToPlayer; // 0x1144(0x04)
	float SpeedScale; // 0x1148(0x04)
	float ShortDistance; // 0x114c(0x04)
	bool IsBrainAccess; // 0x1150(0x01)
	char pad_1151[0x7]; // 0x1151(0x07)
	struct TArray<struct UDamagePartCollisionComponent*> DamagePartComponents; // 0x1158(0x10)
	bool IsBoss; // 0x1168(0x01)
	char pad_1169[0x3]; // 0x1169(0x03)
	float LongDistance; // 0x116c(0x04)
	bool IsBrainSuccess; // 0x1170(0x01)
	bool IsMoveEnable; // 0x1171(0x01)
	bool IsHitDamage; // 0x1172(0x01)
	char pad_1173[0x1]; // 0x1173(0x01)
	float DownTime; // 0x1174(0x04)
	float DownTimer; // 0x1178(0x04)
	bool IsLandCheck; // 0x117c(0x01)
	bool IsBlowOnce; // 0x117d(0x01)
	bool bNoNavMove; // 0x117e(0x01)
	char pad_117F[0x1]; // 0x117f(0x01)
	struct FRotator DamageRot; // 0x1180(0x0c)
	bool IsNotDamageAngle; // 0x118c(0x01)
	char pad_118D[0x3]; // 0x118d(0x03)
	float NoNavMoveInterpSpeed; // 0x1190(0x04)
	bool IsFreeCheck; // 0x1194(0x01)
	bool IsCreateWeapon; // 0x1195(0x01)
	char pad_1196[0x2]; // 0x1196(0x02)
	float TargetDistance; // 0x1198(0x04)
	float MotionFootParam; // 0x119c(0x04)
	bool IsMotionFootParamUse; // 0x11a0(0x01)
	char pad_11A1[0x7]; // 0x11a1(0x07)
	struct TArray<bool> MotionFootParamCheck; // 0x11a8(0x10)
	struct TArray<struct FName> MotionFootParamName; // 0x11b8(0x10)
	struct TArray<struct FTransform> MotionFootParam_Trans; // 0x11c8(0x10)
	struct TArray<float> MotionFootParam_Alpha; // 0x11d8(0x10)
	float DeadTimer; // 0x11e8(0x04)
	bool IsBossDead; // 0x11ec(0x01)
	char pad_11ED[0x3]; // 0x11ed(0x03)
	struct TArray<float> MotionFootParam_Timer; // 0x11f0(0x10)
	float MotionFootParam_Time; // 0x1200(0x04)
	bool IsRagdollEnable; // 0x1204(0x01)
	bool IsRagdoll; // 0x1205(0x01)
	bool IsRagdollDownEnable; // 0x1206(0x01)
	bool IsRagdollDown; // 0x1207(0x01)
	struct FName RagdollDownBoneName; // 0x1208(0x08)
	float RagdollDownBlend; // 0x1210(0x04)
	float RagdollDownBackToTime; // 0x1214(0x04)
	struct FName RagdollBoneName; // 0x1218(0x08)
	float RagdollBlend; // 0x1220(0x04)
	float RagdollBackToTime; // 0x1224(0x04)
	struct FName RagdollPowerBoneName; // 0x1228(0x08)
	struct FVector RagdollPowerObj; // 0x1230(0x0c)
	float RagdollPowerObjS; // 0x123c(0x04)
	float RagdollPowerObjM; // 0x1240(0x04)
	float RagdollPowerObjL; // 0x1244(0x04)
	float RagdollPowerObjScale; // 0x1248(0x04)
	bool IsBerserk; // 0x124c(0x01)
	char pad_124D[0x3]; // 0x124d(0x03)
	float FlyUpTimer; // 0x1250(0x04)
	float FlyUpTime; // 0x1254(0x04)
	float FlyUpHeight; // 0x1258(0x04)
	char pad_125C[0x4]; // 0x125c(0x04)
	struct UCurveFloat* FlyUpCurve; // 0x1260(0x08)
	float FlyGroundHeight; // 0x1268(0x04)
	char pad_126C[0x4]; // 0x126c(0x04)
	struct UDataTable* AiDataTable; // 0x1270(0x08)
	bool IsBattleEnemy; // 0x1278(0x01)
	bool IsFlyMove; // 0x1279(0x01)
	bool IsJumpEnd; // 0x127a(0x01)
	bool IsDamageMotionEnd; // 0x127b(0x01)
	bool IsFoodedFlg; // 0x127c(0x01)
	bool IsMoveAnim; // 0x127d(0x01)
	bool IsBrainCrashDead; // 0x127e(0x01)
	bool IsWait; // 0x127f(0x01)
	bool IsHitCheck; // 0x1280(0x01)
	char pad_1281[0x3]; // 0x1281(0x03)
	int32_t WeakNo; // 0x1284(0x04)
	bool IsWeakEffect; // 0x1288(0x01)
	char pad_1289[0x3]; // 0x1289(0x03)
	float WeakMaterialEmissiveScale; // 0x128c(0x04)
	float WeakMaterialEmissiveTimer; // 0x1290(0x04)
	bool IsHitWeakMaterial; // 0x1294(0x01)
	bool WeakMaterialRateMax; // 0x1295(0x01)
	bool IsMotionCancel; // 0x1296(0x01)
	char pad_1297[0x1]; // 0x1297(0x01)
	struct UCurveVector* WeakMaterialEmissiveCurve; // 0x1298(0x08)
	float MoveTimer; // 0x12a0(0x04)
	float MoveTime; // 0x12a4(0x04)
	bool IsWeakObjectRecommend; // 0x12a8(0x01)
	bool IsWeakDamage; // 0x12a9(0x01)
	char pad_12AA[0x2]; // 0x12aa(0x02)
	float BrainCrashEffectOffset; // 0x12ac(0x04)
	struct TArray<struct FWeakObjectEntryEnemy> WeakObjectEntry; // 0x12b0(0x10)
	struct FWeakObjectRecommendEnemy WeakPoint; // 0x12c0(0x2c)
	struct FName WeakName; // 0x12ec(0x08)
	float DistanceFromEnemyToPlayer; // 0x12f4(0x04)
	int32_t WeakEffectNum; // 0x12f8(0x04)
	char pad_12FC[0x4]; // 0x12fc(0x04)
	struct FCharactersParameterBasic CharactersParameterBasicData; // 0x1300(0x68)
	float OldWeakMaterialRate; // 0x1368(0x04)
	float OldWeakEffectRate; // 0x136c(0x04)
	bool IsWeakUiDamageHit; // 0x1370(0x01)
	char pad_1371[0x3]; // 0x1371(0x03)
	float MoveDistance; // 0x1374(0x04)
	bool IsMoveWalk; // 0x1378(0x01)
	char pad_1379[0x7]; // 0x1379(0x07)
	struct UAnimMontage* BaseMontage; // 0x1380(0x08)
	struct TArray<struct UAnimMontage*> BaseMontageOld; // 0x1388(0x10)
	struct UAnimMontage* BaseDamageMontage; // 0x1398(0x08)
	bool IsMontageDamageData; // 0x13a0(0x01)
	char pad_13A1[0x3]; // 0x13a1(0x03)
	int32_t ArmorNo; // 0x13a4(0x04)
	struct TArray<struct UDamagePartCollisionComponent*> WeakComponent; // 0x13a8(0x10)
	bool MoveFlyToFail; // 0x13b8(0x01)
	char pad_13B9[0x3]; // 0x13b9(0x03)
	float FlyMoveTimer; // 0x13bc(0x04)
	struct TArray<enum class EObjectTypeQuery> eEnemyCollisionType; // 0x13c0(0x10)
	bool IsBeginPlayEnd; // 0x13d0(0x01)
	char pad_13D1[0x3]; // 0x13d1(0x03)
	float StealthTimer; // 0x13d4(0x04)
	float StealthTime; // 0x13d8(0x04)
	bool IsCheckGround; // 0x13dc(0x01)
	char pad_13DD[0x3]; // 0x13dd(0x03)
	float CheckGroundHeightTop; // 0x13e0(0x04)
	float CheckGroundHeightBottom; // 0x13e4(0x04)
	struct UParticleSystem* BrainCrashHitWeak; // 0x13e8(0x08)
	bool IsBattleStart; // 0x13f0(0x01)
	char pad_13F1[0x3]; // 0x13f1(0x03)
	float ArmorFlashTimer; // 0x13f4(0x04)
	float ArmorFlashScale; // 0x13f8(0x04)
	struct FName StealthRateName; // 0x13fc(0x08)
	struct FName StealthVanishName; // 0x1404(0x08)
	struct FName SeeThroughStealthRateName; // 0x140c(0x08)
	char pad_1414[0x4]; // 0x1414(0x04)
	struct FString SeeThroughWeakSphereUse; // 0x1418(0x10)
	struct FString SeeThroughWeakSphereLocation; // 0x1428(0x10)
	bool IsDeadStartNotify; // 0x1438(0x01)
	char pad_1439[0x3]; // 0x1439(0x03)
	struct FVector DamageDir; // 0x143c(0x0c)
	enum class EEnemyStealthState StealthState; // 0x1448(0x01)
	bool bIsInvisibleHPGauge; // 0x1449(0x01)
	bool IsBranchAction; // 0x144a(0x01)
	char pad_144B[0x1]; // 0x144b(0x01)
	float IgnoreAiMoveSeconds; // 0x144c(0x04)
	struct TArray<struct FName> AvatarMaterialNames; // 0x1450(0x10)
	struct FName AddBaseColor_OilName; // 0x1460(0x08)
	float StealthStartHP; // 0x1468(0x04)
	bool IsBT_ForceBreak; // 0x146c(0x01)
	char pad_146D[0x3]; // 0x146d(0x03)
	struct FVector StealthRunAwayTarget; // 0x1470(0x0c)
	bool bCollisionHitWall; // 0x147c(0x01)
	bool bUniqueAction; // 0x147d(0x01)
	bool bDebugEnableEnsure_TableNotFound; // 0x147e(0x01)
	enum class EEnemyFormType FormType; // 0x147f(0x01)
	struct UParticleSystem* CommonDeadEffect; // 0x1480(0x08)
	struct UParticleSystem* BrainCrashDeadEffect; // 0x1488(0x08)
	struct UParticleSystem* AvatarDeadEffect; // 0x1490(0x08)
	struct UParticleSystem* BrainCrashAvatarDeadEffect; // 0x1498(0x08)
	bool bNotVanish; // 0x14a0(0x01)
	bool IsCoreDrop; // 0x14a1(0x01)
	bool CanDropData; // 0x14a2(0x01)
	char pad_14A3[0x5]; // 0x14a3(0x05)
	struct TSoftObjectPtr<UParticleSystem> BrainCrashHitWeakEffectSoftRef; // 0x14a8(0x28)
	struct TSoftObjectPtr<UParticleSystem> CommonDeadEffectSoftRef; // 0x14d0(0x28)
	struct TSoftObjectPtr<UParticleSystem> BrainCrashDeadEffectSoftRef; // 0x14f8(0x28)
	struct TSoftObjectPtr<UParticleSystem> AvatarDeadEffectSoftRef; // 0x1520(0x28)
	struct TSoftObjectPtr<UParticleSystem> BrainCrashAvatarDeadEffectSoftRef; // 0x1548(0x28)
	bool IsEventWait; // 0x1570(0x01)
	bool IsEventBerserk; // 0x1571(0x01)
	bool IsSpawn; // 0x1572(0x01)
	char pad_1573[0x1]; // 0x1573(0x01)
	float SpawnStartDistance; // 0x1574(0x04)
	enum class EnemyActionAnimKind ActionSpawn; // 0x1578(0x01)
	char pad_1579[0x7]; // 0x1579(0x07)
	struct TArray<enum class ECollisionEnabled> CollisionState; // 0x1580(0x10)
	bool IsSpawnTarget; // 0x1590(0x01)
	enum class EnemyKind SpawnEnemyKind; // 0x1591(0x01)
	bool IsBeforeBrainAccess; // 0x1592(0x01)
	char pad_1593[0x1]; // 0x1593(0x01)
	float ProgressBerserkProbability; // 0x1594(0x04)
	bool IsDelayDead; // 0x1598(0x01)
	char pad_1599[0x3]; // 0x1599(0x03)
	float DelayDeadTime; // 0x159c(0x04)
	struct FHCHitResult DeadBeforeHitResult; // 0x15a0(0x1b8)
	float targetAngle; // 0x1758(0x04)
	char pad_175C[0x4]; // 0x175c(0x04)
	struct ARSBattleCharacter_C* TargetCharacter; // 0x1760(0x08)
	bool IsHeightCheck; // 0x1768(0x01)
	char pad_1769[0x7]; // 0x1769(0x07)
	struct TArray<bool> IsTickEnableComponentArray; // 0x1770(0x10)
	float TickIntervalCounter; // 0x1780(0x04)
	float TickIntervalMax; // 0x1784(0x04)
	float TickIntervalDefault; // 0x1788(0x04)
	char pad_178C[0x4]; // 0x178c(0x04)
	struct TArray<struct FBadStateParticleData> EnemyBadStateFlameParticleData; // 0x1790(0x10)
	struct TArray<struct URSParticleSystemComponentBase*> EnemyBadStateFlameParticleHandles; // 0x17a0(0x10)
	struct TArray<struct FBadStateParticleData> EnemyBadStateElecParticleData; // 0x17b0(0x10)
	struct TArray<struct URSParticleSystemComponentBase*> EnemyBadStateElecParticleHandles; // 0x17c0(0x10)
	struct TArray<struct FBadStateParticleData> EnemyBadStateOilParticleData; // 0x17d0(0x10)
	struct TArray<struct URSParticleSystemComponentBase*> EnemyBadStateOilParticleHandles; // 0x17e0(0x10)
	struct TArray<struct FBadStateParticleData> EnemyBadStateFloodedParticleData; // 0x17f0(0x10)
	struct TArray<struct URSParticleSystemComponentBase*> EnemyBadStateFloodedParticleHandles; // 0x1800(0x10)
	enum class EPlayerID TargetID; // 0x1810(0x01)
	char pad_1811[0x3]; // 0x1811(0x03)
	int32_t TargetIndex; // 0x1814(0x04)
	float DamageRatio; // 0x1818(0x04)
	bool IsBendsDirection; // 0x181c(0x01)
	bool IsOverWriteMotion; // 0x181d(0x01)
	bool IsMotionReception; // 0x181e(0x01)
	char pad_181F[0x1]; // 0x181f(0x01)
	struct UEnemyAnimControllerComponent* EnemyAnimConRef; // 0x1820(0x08)
	struct UAnimMontage* BlendingOutMontage; // 0x1828(0x08)
	struct UAnimMontage* UseBlendOutMontage; // 0x1830(0x08)
	bool IsStealthInfinite; // 0x1838(0x01)
	char pad_1839[0x3]; // 0x1839(0x03)
	float DownBonusScale; // 0x183c(0x04)
	bool HideWeak; // 0x1840(0x01)
	char pad_1841[0x3]; // 0x1841(0x03)
	float TickIntervalMaxSimple; // 0x1844(0x04)
	float TickIntervalDefaultSimple; // 0x1848(0x04)
	bool IsSpawnNow; // 0x184c(0x01)
	char pad_184D[0x3]; // 0x184d(0x03)
	float SpawnWaitDelayTime; // 0x1850(0x04)
	float SpawnStartDelayTime; // 0x1854(0x04)
	float SpawnUpdateTime; // 0x1858(0x04)
	enum class Enum_EnemySpawnState SpawnState; // 0x185c(0x01)
	char pad_185D[0x3]; // 0x185d(0x03)
	struct TMap<char, struct FAiParamEnemy> AiTableDataMap; // 0x1860(0x50)
	float DeadEnemyHitStopSeconds; // 0x18b0(0x04)
	float DeadEnemyHitStopRate; // 0x18b4(0x04)
	enum class EPlayerHitStopType HitStop_Type; // 0x18b8(0x01)
	char pad_18B9[0x3]; // 0x18b9(0x03)
	float HitStop_Seconds; // 0x18bc(0x04)
	float HitStop_Rate; // 0x18c0(0x04)
	bool HitStop_IsStart; // 0x18c4(0x01)
	char pad_18C5[0x3]; // 0x18c5(0x03)
	float HitStop_StartDelayTime; // 0x18c8(0x04)
	bool HitStop_IsTarget; // 0x18cc(0x01)
	bool HitStop_AllThrow; // 0x18cd(0x01)
	char pad_18CE[0x2]; // 0x18ce(0x02)
	float DamageAngle; // 0x18d0(0x04)
	char pad_18D4[0x4]; // 0x18d4(0x04)
	struct TArray<struct TSoftObjectPtr<USoundAtomCueSheet>> CueSheetRefs; // 0x18d8(0x10)
	struct TArray<struct USoundAtomCueSheet*> CueSheetObjs; // 0x18e8(0x10)
	bool IsReturn; // 0x18f8(0x01)
	bool IsReturnNow; // 0x18f9(0x01)
	char pad_18FA[0x2]; // 0x18fa(0x02)
	float ReturnupdateTime; // 0x18fc(0x04)
	enum class Enum_EnemySpawnState ReturnState; // 0x1900(0x01)
	char pad_1901[0x3]; // 0x1901(0x03)
	float SpawnCurrentWaitDelayTime; // 0x1904(0x04)
	float SpawnCurrentStartDelayTime; // 0x1908(0x04)
	float SpawnCurrentUpdateTime; // 0x190c(0x04)
	float ReturnCurrentUpdateTime; // 0x1910(0x04)
	enum class Enum_EnemySound SoundType; // 0x1914(0x01)
	bool IsReverseBlowMotion; // 0x1915(0x01)
	char pad_1916[0x2]; // 0x1916(0x02)
	struct TSoftObjectPtr<ULevelSequence> BrainCrashSequenceReference; // 0x1918(0x28)
	struct TSoftObjectPtr<ULevelSequence> BrainCrashSequenceReference2; // 0x1940(0x28)
	struct ULevelSequence* BrainCrashSequenceInstance; // 0x1968(0x08)
	bool IsBlowTurnaround; // 0x1970(0x01)
	bool IsDownTurnaround; // 0x1971(0x01)
	char pad_1972[0x2]; // 0x1972(0x02)
	float FlyUpWaitTimer; // 0x1974(0x04)
	float FlyUpWaitTime; // 0x1978(0x04)
	enum class EnemyActionAnimKind BerserkSignAction; // 0x197c(0x01)
	bool IsReleaseDelayDeath; // 0x197d(0x01)
	char pad_197E[0x2]; // 0x197e(0x02)
	int32_t ReleaseDelayDeathWait; // 0x1980(0x04)
	bool bCrashChanceDown; // 0x1984(0x01)
	bool HitCrashDamage; // 0x1985(0x01)
	bool IsChangingCrashDamageMaterial; // 0x1986(0x01)
	char pad_1987[0x1]; // 0x1987(0x01)
	struct UCurveVector* CrashDamageMaterialVectorCurve; // 0x1988(0x08)
	float CrashDamageMaterialTime; // 0x1990(0x04)
	float possibleBrainCrashRange; // 0x1994(0x04)
	float CrashDamageMaterialScale; // 0x1998(0x04)
	bool IsUniqueBadState; // 0x199c(0x01)
	bool IsDamageRotation; // 0x199d(0x01)
	char pad_199E[0x2]; // 0x199e(0x02)
	float DamageMoveScale; // 0x19a0(0x04)
	struct FVector DamageLocation; // 0x19a4(0x0c)
	struct FRotator CrashChanceBrainRotate; // 0x19b0(0x0c)
	float CrashDamageHighRate; // 0x19bc(0x04)
	bool IsNewLaunch; // 0x19c0(0x01)
	char pad_19C1[0x7]; // 0x19c1(0x07)
	struct UAnimMontage* AnimMontage; // 0x19c8(0x08)
	bool IsEnableLaunch; // 0x19d0(0x01)
	bool IsRequestAddDamageMontage; // 0x19d1(0x01)
	char pad_19D2[0x2]; // 0x19d2(0x02)
	float WeakHitReactionSRate; // 0x19d4(0x04)
	float WeakHitReactionLRate; // 0x19d8(0x04)
	float WeakHitDownRate; // 0x19dc(0x04)
	bool bIsDispHp; // 0x19e0(0x01)
	char pad_19E1[0x3]; // 0x19e1(0x03)
	float DispHpTimer; // 0x19e4(0x04)
	float CurrentDispHpTimer; // 0x19e8(0x04)
	float EnemyCameraShakeRangeL; // 0x19ec(0x04)
	float EnemyCameraShakeRangeM; // 0x19f0(0x04)
	float EnemyCameraShakeRangeS; // 0x19f4(0x04)
	struct USoundAtomCue* ArmorBreakSE; // 0x19f8(0x08)
	bool bDebugReactionLFlash; // 0x1a00(0x01)
	bool bNotReflectContainer; // 0x1a01(0x01)
	bool bCrashChanceFly; // 0x1a02(0x01)
	enum class HCSkillAttribute CurBadStateMaterial; // 0x1a03(0x01)
	bool IsWinceCounter; // 0x1a04(0x01)
	char pad_1A05[0x3]; // 0x1a05(0x03)
	int32_t WinceCounter; // 0x1a08(0x04)
	bool IsPressDown; // 0x1a0c(0x01)
	bool EnablePressDown; // 0x1a0d(0x01)
	bool IsAcceptKnockBackCounter; // 0x1a0e(0x01)
	bool EnableKnockBackCounter; // 0x1a0f(0x01)
	bool EnableWinceCounter; // 0x1a10(0x01)
	char pad_1A11[0x3]; // 0x1a11(0x03)
	int32_t WinceCount; // 0x1a14(0x04)
	bool isKnockBackCounter; // 0x1a18(0x01)
	char pad_1A19[0x7]; // 0x1a19(0x07)
	struct ULevelSequence* BrainCrashSequenceInstance2; // 0x1a20(0x08)
	bool bDiscoveredTarget; // 0x1a28(0x01)
	char pad_1A29[0x3]; // 0x1a29(0x03)
	float DiscoverIconOffsetHeight; // 0x1a2c(0x04)
	bool bEnableFitGround; // 0x1a30(0x01)
	char pad_1A31[0x3]; // 0x1a31(0x03)
	float FitGroundSpeed; // 0x1a34(0x04)
	float FitGroundAngleLimit; // 0x1a38(0x04)
	bool bChangingWeakDamageMaterial; // 0x1a3c(0x01)
	char pad_1A3D[0x3]; // 0x1a3d(0x03)
	float WeakDamageMaterialTime; // 0x1a40(0x04)
	float WeakDamageMaterialScale; // 0x1a44(0x04)
	struct FName WeakMaterialSlotName; // 0x1a48(0x08)
	struct UMaterialInstanceDynamic* WeakMaterialInst; // 0x1a50(0x08)
	struct UCurveVector* WeakDamageMaterialVectorCurve; // 0x1a58(0x08)
	bool bBeforeUniqueObjState; // 0x1a60(0x01)
	bool bUniqueObjState; // 0x1a61(0x01)
	char pad_1A62[0x2]; // 0x1a62(0x02)
	float AvoidInvalidLength; // 0x1a64(0x04)
	struct TArray<enum class EnemyAliveAnimKind> AvoidEnableActionKind; // 0x1a68(0x10)
	struct TArray<float> AvoidProbabilityList; // 0x1a78(0x10)
	bool bEnableAvoidObject; // 0x1a88(0x01)
	char pad_1A89[0x7]; // 0x1a89(0x07)
	struct ABP_co2000Base_C* BrainCoreReference; // 0x1a90(0x08)
	struct TSoftObjectPtr<ULevelSequence> BossBrainCrashSequenceReference; // 0x1a98(0x28)
	struct TSoftObjectPtr<ULevelSequence> BossBrainCrashSequenceReference2; // 0x1ac0(0x28)
	struct ULevelSequence* BossBrainCrashSequenceInstance; // 0x1ae8(0x08)
	struct ULevelSequence* BossBrainCrashSequenceInstance2; // 0x1af0(0x08)
	bool IsLastBossBrainCrash; // 0x1af8(0x01)
	char pad_1AF9[0x3]; // 0x1af9(0x03)
	float MaxCrashResistance; // 0x1afc(0x04)
	bool bPressDownLoop; // 0x1b00(0x01)
	char pad_1B01[0x3]; // 0x1b01(0x03)
	float PressLoopTime; // 0x1b04(0x04)
	float TargetHeight; // 0x1b08(0x04)
	float HeightFromEnemyToPlayer; // 0x1b0c(0x04)
	float HeightFromEnemyInitToPlayer; // 0x1b10(0x04)
	bool bEnableDiscoverIcon; // 0x1b14(0x01)
	char pad_1B15[0x3]; // 0x1b15(0x03)
	float CheckCapsuleRadius; // 0x1b18(0x04)
	bool bEnableRequestIK; // 0x1b1c(0x01)
	char pad_1B1D[0x3]; // 0x1b1d(0x03)
	struct UCurveFloat* WeakMaterialRateCurveData; // 0x1b20(0x08)
	enum class EDeadFactor MyDeadFactor; // 0x1b28(0x01)
	char pad_1B29[0x7]; // 0x1b29(0x07)
	struct TArray<bool> bStartWeakAroundEffect; // 0x1b30(0x10)
	bool bEnableLookAt; // 0x1b40(0x01)
	bool bUpdateBadStateMaterial; // 0x1b41(0x01)
	char pad_1B42[0x2]; // 0x1b42(0x02)
	float BadStateMaterialCurveTime; // 0x1b44(0x04)
	bool bBrainCrashMiss; // 0x1b48(0x01)
	bool IsChangeCharacterCollision; // 0x1b49(0x01)
	char pad_1B4A[0x6]; // 0x1b4a(0x06)
	struct UCurveFloat* MoveScaleCurveData; // 0x1b50(0x08)
	bool bReceivedNotifyLookAt; // 0x1b58(0x01)
	bool bEnableWander; // 0x1b59(0x01)
	char pad_1B5A[0x2]; // 0x1b5a(0x02)
	float CoreWeakEffect_CommonRate; // 0x1b5c(0x04)
	float CoreWeakEffect_AttachRate; // 0x1b60(0x04)
	float LaunchDownTime; // 0x1b64(0x04)
	bool IsLaunchDown; // 0x1b68(0x01)
	char pad_1B69[0x7]; // 0x1b69(0x07)
	struct UCurveFloat* CurBadStateCurve; // 0x1b70(0x08)
	struct UCurveFloat* BadStateCurveFlame; // 0x1b78(0x08)
	struct UCurveFloat* BadStateCurveElec; // 0x1b80(0x08)
	struct TArray<struct FName> DebugPrintSlotName; // 0x1b88(0x10)
	struct TArray<char> DebugIgnoreActions; // 0x1b98(0x10)
	int32_t BadStateStartDamageMotion; // 0x1ba8(0x04)
	bool bEnableFitGroundTmp; // 0x1bac(0x01)
	bool EndFitGround; // 0x1bad(0x01)
	bool IsStartHideArmor; // 0x1bae(0x01)
	bool bBrainFieldSealWeakParticle; // 0x1baf(0x01)
	struct FName BrainFieldClaimantName; // 0x1bb0(0x08)
	bool bDamageFloating; // 0x1bb8(0x01)
	char pad_1BB9[0x7]; // 0x1bb9(0x07)
	struct TArray<float> SaveBodyEmissiveValue; // 0x1bc0(0x10)
	bool bExecLowProcess; // 0x1bd0(0x01)
	char pad_1BD1[0x3]; // 0x1bd1(0x03)
	struct FVector BrainInitPos; // 0x1bd4(0x0c)
	enum class EnemyMoveAnimKind DownUpMoveAnimKind; // 0x1be0(0x01)
	char pad_1BE1[0x3]; // 0x1be1(0x03)
	float ReactionChangeDilationTimer; // 0x1be4(0x04)
	struct FName TopHeightSocketName; // 0x1be8(0x08)
	bool bIdleMove; // 0x1bf0(0x01)
	char pad_1BF1[0x7]; // 0x1bf1(0x07)
	struct URSParticleSystemComponentBase* DeadEffectHandle; // 0x1bf8(0x08)
	bool bDisableWeakAroundEffect; // 0x1c00(0x01)
	bool bLaunchIgnorePriority; // 0x1c01(0x01)
	enum class EnemyDamageDownAnimKind SavedDamageDown; // 0x1c02(0x01)
	char pad_1C03[0x5]; // 0x1c03(0x05)
	struct FBadStateAddParticleData EnemyBadStateAddFlameParticleData; // 0x1c08(0x28)
	struct FBadStateAddParticleData EnemyBadStateAddElecParticleData; // 0x1c30(0x28)
	struct FBadStateAddParticleData EnemyBadStateAddOilParticleData; // 0x1c58(0x28)
	struct FBadStateAddParticleData EnemyBadStateAddFloodedParticleData; // 0x1c80(0x28)
	float BadStateAddEffectOffset; // 0x1ca8(0x04)
	float TickIntervalSeconds; // 0x1cac(0x04)
	bool bEnableEnemyGoal; // 0x1cb0(0x01)
	bool bAdjustCharaCapsule; // 0x1cb1(0x01)
	char pad_1CB2[0x2]; // 0x1cb2(0x02)
	struct FName AdjustCharaCapsuleName; // 0x1cb4(0x08)
	struct FVector AdjustCharaCapsuleOffset; // 0x1cbc(0x0c)
	float AdjustCharaCapsuleInterpTime; // 0x1cc8(0x04)
	float CurrentAdjustCharaCapsuleInterpTime; // 0x1ccc(0x04)
	bool bAdjustInterpCharaCapsule; // 0x1cd0(0x01)
	char pad_1CD1[0x7]; // 0x1cd1(0x07)
	struct TArray<struct FName> WeakTargetSocketName; // 0x1cd8(0x10)
	struct UParticleSystem* CrashChanceLoopEffect; // 0x1ce8(0x08)
	struct TSoftObjectPtr<UParticleSystem> CrashChanceLoopEffectSoftReference; // 0x1cf0(0x28)
	struct URSParticleSystemComponentBase* CrashChanceLoopEffectHandle; // 0x1d18(0x08)
	bool bNewDamageFloating; // 0x1d20(0x01)
	bool IsLaunchTurnaround; // 0x1d21(0x01)
	char pad_1D22[0x2]; // 0x1d22(0x02)
	struct FName EyeSocketName; // 0x1d24(0x08)
	struct FEnemyFindChangeParam FindChangeParam; // 0x1d2c(0x10)
	enum class EEnemyFindPlayerType LastDetectIcon; // 0x1d3c(0x01)
	bool IsSpecialDownFlyRot; // 0x1d3d(0x01)
	char ChangeCharaCollisionNo; // 0x1d3e(0x01)
	char pad_1D3F[0x1]; // 0x1d3f(0x01)
	struct TArray<struct UCapsuleComponent*> CharaCollisionList; // 0x1d40(0x10)
	bool bInvincible; // 0x1d50(0x01)
	char pad_1D51[0x3]; // 0x1d51(0x03)
	float BaseMontageStartTime; // 0x1d54(0x04)
	bool PreviousMaterialSwitchStealth; // 0x1d58(0x01)
	char pad_1D59[0x7]; // 0x1d59(0x07)
	struct FMaterialSwitchCache MaterialSwitchCache; // 0x1d60(0x10)
	enum class EnemyMoveAnimKind SpawnMoveAnim; // 0x1d70(0x01)
	char pad_1D71[0x3]; // 0x1d71(0x03)
	struct FName UniqueName; // 0x1d74(0x08)
	bool IsHiddenFirstDiscoverIcon; // 0x1d7c(0x01)
	bool IsStartOnStealth; // 0x1d7d(0x01)
	bool IsIgnoreRestrictAttackOther; // 0x1d7e(0x01)
	bool IsIgnoreAllowance; // 0x1d7f(0x01)
	bool IsNoCheckCaptureArea; // 0x1d80(0x01)
	bool IsChangeSearchAngle; // 0x1d81(0x01)
	char pad_1D82[0x2]; // 0x1d82(0x02)
	float ChangeSearchAngle; // 0x1d84(0x04)
	bool IsAlwaysChangeSearchAngle; // 0x1d88(0x01)
	bool IsChangeSearchRange; // 0x1d89(0x01)
	char pad_1D8A[0x2]; // 0x1d8a(0x02)
	float ChangeSearchRange; // 0x1d8c(0x04)
	bool IsAlwaysChangeSearchRange; // 0x1d90(0x01)
	bool IsChangeSensingArea; // 0x1d91(0x01)
	char pad_1D92[0x2]; // 0x1d92(0x02)
	float ChangeSensingArea; // 0x1d94(0x04)
	bool IsAlwaysSensingArea; // 0x1d98(0x01)
	bool IsChangeCaptureArea; // 0x1d99(0x01)
	char pad_1D9A[0x2]; // 0x1d9a(0x02)
	float ChangeCaptureArea; // 0x1d9c(0x04)
	bool IsAlwaysCaptureArea; // 0x1da0(0x01)
	bool IsChangeTerritoryArea; // 0x1da1(0x01)
	char pad_1DA2[0x2]; // 0x1da2(0x02)
	float ChangeTerritoryArea; // 0x1da4(0x04)
	bool IsAlwaysTerritoryArea; // 0x1da8(0x01)
	bool IsChangeRepopTime; // 0x1da9(0x01)
	char pad_1DAA[0x2]; // 0x1daa(0x02)
	float ChangeRepopTime; // 0x1dac(0x04)
	bool IsChangeRepopRange; // 0x1db0(0x01)
	char pad_1DB1[0x3]; // 0x1db1(0x03)
	float ChangeRepopRange; // 0x1db4(0x04)
	bool IsChangeRepopTimeTerritory; // 0x1db8(0x01)
	char pad_1DB9[0x3]; // 0x1db9(0x03)
	float ChangeRepopTimeTerritory; // 0x1dbc(0x04)
	float DamageStealthHalfTime; // 0x1dc0(0x04)
	bool IsStealthHalfNeedUpdate; // 0x1dc4(0x01)
	char pad_1DC5[0x3]; // 0x1dc5(0x03)
	float StealthHalfParam; // 0x1dc8(0x04)
	bool IsStealthHalfParamUp; // 0x1dcc(0x01)
	bool IsNotAddedBattleManager; // 0x1dcd(0x01)
	bool IsHitWeek; // 0x1dce(0x01)
	char pad_1DCF[0x1]; // 0x1dcf(0x01)
	struct TArray<enum class HCSkillExtraType> SkillExtraType; // 0x1dd0(0x10)
	struct URSParticleSystemComponentBase* DetectIconEffect; // 0x1de0(0x08)
	struct FGameTimer DetectIconTimer; // 0x1de8(0x0c)
	bool IsDownSasFlagIgnoreDownTrigger; // 0x1df4(0x01)
	bool IsKnockbackSasFlagIgnoreKnockbackTrigger; // 0x1df5(0x01)
	bool IsDownSasFlagIgnoreDownTriggerFlag; // 0x1df6(0x01)
	bool IsKnockbackSasFlagIgnoreKnockbackTriggerFlag; // 0x1df7(0x01)
	bool bEnableWeak; // 0x1df8(0x01)
	char pad_1DF9[0x7]; // 0x1df9(0x07)
	struct UAnimMontage* ReserveMontage; // 0x1e00(0x08)
	struct UBP_EnemyFixParam_C* EnemyFixParam; // 0x1e08(0x08)
	bool IsChangeSearchParam; // 0x1e10(0x01)
	char pad_1E11[0x3]; // 0x1e11(0x03)
	int32_t ET_StopID; // 0x1e14(0x04)
	struct FGameTimer LostActionTimer; // 0x1e18(0x0c)
	float EnableLostActionTime; // 0x1e24(0x04)
	bool bDisableLostAction; // 0x1e28(0x01)
	char pad_1E29[0x3]; // 0x1e29(0x03)
	float LostActionProbability; // 0x1e2c(0x04)
	struct TArray<struct FST_emLostActionInfo> LostActionInfoList; // 0x1e30(0x10)
	float ActivityAreaOutTimer; // 0x1e40(0x04)
	float ActivityAreaOutDistance; // 0x1e44(0x04)
	struct FVector InitGroundPos; // 0x1e48(0x0c)
	float LostMoveTimeMin; // 0x1e54(0x04)
	float LostMoveTime_Max; // 0x1e58(0x04)
	float LostMoveRotationRate; // 0x1e5c(0x04)
	bool bUseDefaultSpawnSearchParam; // 0x1e60(0x01)
	char pad_1E61[0x7]; // 0x1e61(0x07)
	struct TSoftObjectPtr<ULevelSequence> GeneralBrainCrashSequenceReference; // 0x1e68(0x28)
	struct ULevelSequence* GeneralBrainCrashSequenceInstance; // 0x1e90(0x08)
	struct ARSLevelSequenceActor* GeneralBcSequencerActor; // 0x1e98(0x08)
	struct UCurveFloat* NormalWeakMaterialRateCurveData; // 0x1ea0(0x08)
	float NormalWeakMaterialScale; // 0x1ea8(0x04)
	char pad_1EAC[0x4]; // 0x1eac(0x04)
	struct UCurveFloat* NormalWeakMaterialEmissiveCurve; // 0x1eb0(0x08)
	float NormalWeakMaterialEmissiveMax; // 0x1eb8(0x04)
	float NormalWeakMaterialEmissiveMin; // 0x1ebc(0x04)
	float NormalWeakMaterialRateMax; // 0x1ec0(0x04)
	float NormalWeakMaterialRateMin; // 0x1ec4(0x04)
	bool bStopWeakEmissive; // 0x1ec8(0x01)
	bool bEnemyArmorBreak; // 0x1ec9(0x01)
	bool bNoBrainCore; // 0x1eca(0x01)
	bool bHitReactionTrigger; // 0x1ecb(0x01)
	char pad_1ECC[0x4]; // 0x1ecc(0x04)
	struct UCurveFloat* BadStateCurveFlameEnd; // 0x1ed0(0x08)
	struct UCurveFloat* BadStateCurveElecEnd; // 0x1ed8(0x08)
	struct ABP_EnemyManager_C* LEnemyManager; // 0x1ee0(0x08)
	enum class Enum_EnemyAiType CurrentAiType; // 0x1ee8(0x01)
	char pad_1EE9[0x7]; // 0x1ee9(0x07)
	struct TMap<enum class Enum_EnemyAiType, struct FST_emChangeAiTypeInfo> ChangeAiTypeInfoList; // 0x1ef0(0x50)
	enum class EMovementMode SpawnMovementMode; // 0x1f40(0x01)
	char pad_1F41[0x3]; // 0x1f41(0x03)
	float NormalWeakMaterialEmissivePowerMin; // 0x1f44(0x04)
	float NormalWeakMaterialEmissivePowerMax; // 0x1f48(0x04)
	float WeakMaterialEmissivePowerMax; // 0x1f4c(0x04)
	float WeakMaterialPointRateMax; // 0x1f50(0x04)
	enum class EAssassinAttackHit AssassinAttackHitType; // 0x1f54(0x01)
	bool IsRepop; // 0x1f55(0x01)
	char pad_1F56[0x2]; // 0x1f56(0x02)
	float RepopTime; // 0x1f58(0x04)
	float RepopRange; // 0x1f5c(0x04)
	int32_t RepopProbability; // 0x1f60(0x04)
	bool IsAreaOut; // 0x1f64(0x01)
	char pad_1F65[0x3]; // 0x1f65(0x03)
	struct FGameTimer AreaOutTimer; // 0x1f68(0x0c)
	int32_t areaOutSequence; // 0x1f74(0x04)
	bool IsStealthEndLaunch; // 0x1f78(0x01)
	bool IsStealthEndLaunchEdit; // 0x1f79(0x01)
	bool EnableDeadEffect; // 0x1f7a(0x01)
	bool bNoDisplayDiscoverIcon; // 0x1f7b(0x01)
	char pad_1F7C[0x4]; // 0x1f7c(0x04)
	struct TArray<enum class EnemyMoveAnimKind> GoHomeAminKind; // 0x1f80(0x10)
	struct FName RowNameAnimScaleHitStop; // 0x1f90(0x08)
	bool IsAnimScaleChangingHitStop; // 0x1f98(0x01)
	bool IsAnimScaleChangingHitStopSlow; // 0x1f99(0x01)
	bool bDiscoveredOnce; // 0x1f9a(0x01)
	bool bDiscoverClosed; // 0x1f9b(0x01)
	bool IsBrainCrashDamageDown; // 0x1f9c(0x01)
	bool IsUseBrainCrashAfterMotion; // 0x1f9d(0x01)
	char pad_1F9E[0x2]; // 0x1f9e(0x02)
	struct FGameTimer PathAreaOutTimer; // 0x1fa0(0x0c)
	enum class EEnemyTickPriorityType TickProirity; // 0x1fac(0x01)
	char pad_1FAD[0x3]; // 0x1fad(0x03)
	float TickSumRealSeconds; // 0x1fb0(0x04)
	float TickRealSeconds; // 0x1fb4(0x04)
	bool ExecTick; // 0x1fb8(0x01)
	char pad_1FB9[0x3]; // 0x1fb9(0x03)
	float TickSumActorSeconds; // 0x1fbc(0x04)
	float TickActorSeconds; // 0x1fc0(0x04)
	bool IsOutOfBattlefield; // 0x1fc4(0x01)
	bool bDefeatedMainPlayer; // 0x1fc5(0x01)
	char pad_1FC6[0x2]; // 0x1fc6(0x02)
	float UroOffLength; // 0x1fc8(0x04)
	bool UpdateWeakMaterialEnable; // 0x1fcc(0x01)
	char pad_1FCD[0x3]; // 0x1fcd(0x03)
	struct TArray<struct FString> WeakSlotNameList; // 0x1fd0(0x10)
	float OldWeakMaterialEmissiveTime; // 0x1fe0(0x04)
	bool EnableUpdateSeeThrought; // 0x1fe4(0x01)
	bool EndSetSpawnParam; // 0x1fe5(0x01)
	bool SimpleEnemy; // 0x1fe6(0x01)
	enum class Enum_EnemyBrainFieldProgress BrainFieldProgress; // 0x1fe7(0x01)
	bool bUseWaitNoInterpolation; // 0x1fe8(0x01)
	char pad_1FE9[0x3]; // 0x1fe9(0x03)
	struct FRotator InitRotationRate; // 0x1fec(0x0c)
	bool DisableCheckAreaOut; // 0x1ff8(0x01)
	bool StopUpdateEnemyTickEnable; // 0x1ff9(0x01)
	bool StopUpdateAreaCheck; // 0x1ffa(0x01)
	char pad_1FFB[0x1]; // 0x1ffb(0x01)
	struct FName HitStop_Skillname; // 0x1ffc(0x08)
	bool HitStop_SlowOnce; // 0x2004(0x01)
	char pad_2005[0x3]; // 0x2005(0x03)
	float NoAttackTargetChangeSecond; // 0x2008(0x04)
	bool SetHideWeakEffect; // 0x200c(0x01)
	bool SetVisibleWeakEffect; // 0x200d(0x01)
	char pad_200E[0x2]; // 0x200e(0x02)
	float MaxEvDitherTime; // 0x2010(0x04)
	float CurrentEvDitherTime; // 0x2014(0x04)
	bool bEvDitherDisp; // 0x2018(0x01)
	char pad_2019[0x7]; // 0x2019(0x07)
	struct ABP_TriggerEffectManager_C* TrgEffMgr; // 0x2020(0x08)
	char EnumBossBattleBegineAction; // 0x2028(0x01)
	bool IsHideCoreTimingOld; // 0x2029(0x01)
	bool IsCrashChanceLoopStart; // 0x202a(0x01)
	bool IsDuringEventSpawnNow; // 0x202b(0x01)
	char pad_202C[0x4]; // 0x202c(0x04)
	struct UAnimMontage* DeadMontage; // 0x2030(0x08)
	struct UAnimMontage* DownDeadMontage; // 0x2038(0x08)
	float UniqueTickEnableRange; // 0x2040(0x04)
	float AreaOutTime; // 0x2044(0x04)
	bool IsDeadMainTick; // 0x2048(0x01)
	char pad_2049[0x3]; // 0x2049(0x03)
	float HitFloorTimer; // 0x204c(0x04)
	bool bEnableTickMeshOnly; // 0x2050(0x01)
	char pad_2051[0x3]; // 0x2051(0x03)
	float AreaOutOffsetRange; // 0x2054(0x04)
	float AllowanceWaitSeconds; // 0x2058(0x04)
	bool IsTickMove; // 0x205c(0x01)
	bool bAlreadyDroppedItem; // 0x205d(0x01)
	bool bEnableDeadCleanup_DroppedItem; // 0x205e(0x01)
	bool IsEventDeath; // 0x205f(0x01)
	bool bUpDownWait; // 0x2060(0x01)
	bool NoChangeAnimRateCrashChanceAccelerate; // 0x2061(0x01)
	char pad_2062[0x2]; // 0x2062(0x02)
	int32_t NowMinTickCount; // 0x2064(0x04)
	struct UActorComponent* DebugEnemyBtlLog; // 0x2068(0x08)
	int32_t ActorLocationID; // 0x2070(0x04)
	int32_t ActorAreaID; // 0x2074(0x04)
	bool IsRepopping; // 0x2078(0x01)
	bool IsCheckSameFloor; // 0x2079(0x01)
	bool bPlayedPressKillMontage; // 0x207a(0x01)
	char pad_207B[0x5]; // 0x207b(0x05)
	struct ABP_PsychicObjectBasic_C* StateUniqueObject; // 0x2080(0x08)

	bool GetAndUpdateContinuousSameDamageReaction(); // Function RSBattleEnemy.RSBattleEnemy_C.GetAndUpdateContinuousSameDamageReaction // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool IsNeedResetStateMachine(float ElapsedTime, float ResetSecond); // Function RSBattleEnemy.RSBattleEnemy_C.IsNeedResetStateMachine // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void getEmPosDiscover(struct FVector discoverPos); // Function RSBattleEnemy.RSBattleEnemy_C.getEmPosDiscover // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void em1130_EnableWeak(bool bEnable, bool return); // Function RSBattleEnemy.RSBattleEnemy_C.em1130_EnableWeak // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
