// UserDefinedStruct S_BattleSimulatorLevelInfo.S_BattleSimulatorLevelInfo
// Size: 0x66 (Inherited: 0x00)
struct FS_BattleSimulatorLevelInfo {
	struct TArray<struct FName> BGInfos_3_324516CC4A9856EFC2541FB6279BC291; // 0x00(0x10)
	struct TArray<struct FName> NObjInfos_8_228BFF7D471DB968D92BB3A5B96BAAC5; // 0x10(0x10)
	struct TArray<struct FName> EnemyInfos_9_D9945E3545229ED8E76555B58790AF16; // 0x20(0x10)
	struct TArray<struct FName> EventInfos_10_E4A2F7F4404449876A21D2A08EFC0AE7; // 0x30(0x10)
	struct TArray<struct FName> NPCInfos_11_27311D014E38627734E4C8AABE417C59; // 0x40(0x10)
	struct TArray<struct FName> ArrangePointInfos_13_05C9B6EB4759019510BA9FBAD88226AB; // 0x50(0x10)
	bool ReplaceBGInfos_23_70DAF75E4B04CD116FE4AA84BA86C089; // 0x60(0x01)
	bool ReplaceNObjInfos_25_EF327743471BE49F158CDDAE1B645D3F; // 0x61(0x01)
	bool ReplaceEnemyInfos_26_D94337524205D1083D13C19B40850EF2; // 0x62(0x01)
	bool ReplaceEventInfos_27_1441870B40A2752DBF6FA3A45BFD95AC; // 0x63(0x01)
	bool ReplaceNPCInfos_30_E2B19B73462CC9FAE828AA8CAB3F0F56; // 0x64(0x01)
	bool ReplaceArrangePointInfos_28_C37F065F4FA50D1B3A9233B677EF78BE; // 0x65(0x01)
};

