// UserDefinedStruct SPsychicCaptureMaterial.SPsychicCaptureMaterial
// Size: 0xa0 (Inherited: 0x00)
struct FSPsychicCaptureMaterial {
	struct FLinearColor BaseColor_43_81175ED34D6A5799CDBF52B091089544; // 0x00(0x10)
	struct FLinearColor PatternColor_44_B2132BBE46886DD5227D76AD30E8E914; // 0x10(0x10)
	float BaseMaxPower_26_E0709CD5446C1E51930EC4ADDE50DC17; // 0x20(0x04)
	float BaseMinPower_27_5659AB6345FCAAD9C28DF3BA171EE32B; // 0x24(0x04)
	float BaseTimeRange_28_419DBF5A4DD18F65D148A690848FA0D7; // 0x28(0x04)
	float PatternDensity_29_42849F24472C8CE03152CEBCCDFAC83F; // 0x2c(0x04)
	float PatternMap1Density_30_DABC08124F9BC94AD68195BF1A348385; // 0x30(0x04)
	float PatternMap1UVScaleX_31_5FA9BA724BCAE785C5FE9CA3D8C378C9; // 0x34(0x04)
	float PatternMap1UVScaleY_32_068A66C84AE78F94F6861B9FBF3EC21D; // 0x38(0x04)
	float PatternMap1UVSpeedX_33_89342A044AE4F15043F3BE8E4546F008; // 0x3c(0x04)
	float PatternMap1UVSpeedY_34_C89C83EB4603D44553C14981DC40C18A; // 0x40(0x04)
	float PatternMap2ScaleX_35_CB3A2DD94436E4B1BA1989B63E45AD2E; // 0x44(0x04)
	float PatternMap2ScaleY_36_14279C144BEABE662743E49023A0771E; // 0x48(0x04)
	float PatternMap2UVSpeedX_37_F37451AA46B9D96A8F849EA6CC9FB3F0; // 0x4c(0x04)
	float PatternMap2UVSpeedY_38_FA382A6744D86ED0535AEAADF9F45181; // 0x50(0x04)
	float PatternMaxPower_46_6D41D36F46B559FB998879AFBD1EDDFF; // 0x54(0x04)
	float PatternMinPower_49_B1D235EE46490E1096517F9A8E987F7A; // 0x58(0x04)
	float PatternScale_40_120DFE524B2EB7E625D1AD9376990A43; // 0x5c(0x04)
	bool PatternUseGreenChannel_42_90F49A7746E18F52B79F63B4AA831073; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	struct FLinearColor StartEmissiveColor_52_17F0294E4086FB7B54AD5A96AAA68B4E; // 0x64(0x10)
	char pad_74[0x4]; // 0x74(0x04)
	struct TSoftObjectPtr<UCurveVector> StartEmissiveCurve_55_7194151A4084162B11F1B0B0AB8B026D; // 0x78(0x28)
};

