// UserDefinedStruct SStaticBGEffectParameter.SStaticBGEffectParameter
// Size: 0x1c (Inherited: 0x00)
struct FSStaticBGEffectParameter {
	float EffectRandomTimeMinSeconds_19_13DC266C4DCECEBAF39E2D9C7D7EF7B6; // 0x00(0x04)
	float EffectRandomTimeMaxSeconds_20_28ABCB1F400A3E1E83E69E877759139F; // 0x04(0x04)
	float BlockNoiseUVFlipRandomTimeMinSeconds_25_6BB853274B393643574F9FA56B52E5AF; // 0x08(0x04)
	float BlockNoiseUVFlipRandomTimeMaxSeconds_26_8ADEE3904CA617184E46ED9C555C6A7F; // 0x0c(0x04)
	int32_t BlockNoiseUVFlipRandomPercentage_27_FECF20474ECA12D49CFB4AB0E8FEC373; // 0x10(0x04)
	bool BlockNoiseUVFlipAwakeEffect_30_EE0F077F45695B0AAAED1BA0B6D3200D; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	int32_t BlockNoiseValueStartRandomPercentage_33_BAA66FFD418EE78FD8F0308CE9836B98; // 0x18(0x04)
};

