// UserDefinedStruct ST_DamageFloatingData.ST_DamageFloatingData
// Size: 0x20 (Inherited: 0x00)
struct FST_DamageFloatingData {
	float Weight_5_0B3F7220453CD2FF3F3F80880C167407; // 0x00(0x04)
	float Attenuation_8_A51F0865483B26CE0372158524D6D08A; // 0x04(0x04)
	float FlyFallCoefficient_10_80FCA7ED474F364D1CE161B3CB815B5B; // 0x08(0x04)
	float FlyMaxFallSpeed_13_9E36D11D42A4016CF2A0C1BFEE80A52A; // 0x0c(0x04)
	float NormalFallCoefficient_16_83716C654575A2BE2FA75AAC9567F240; // 0x10(0x04)
	float NormalMaxFallSpeed_17_5DAB7764457B98251FB8F3A37B2FAD3E; // 0x14(0x04)
	float LimitFloatingHeight_20_0204CBFE497FF5D55EAB7D924C89793B; // 0x18(0x04)
	float IgnoreLandingCheckTime_24_0ADC759442FEC46E9B5C76B8FE15C2CC; // 0x1c(0x04)
};

