// UserDefinedStruct ST_DisplayDamageBrainCrashInfo.ST_DisplayDamageBrainCrashInfo
// Size: 0x2c (Inherited: 0x00)
struct FST_DisplayDamageBrainCrashInfo {
	int32_t Damage_17_681CF0B448EB45C907473CA40AED8932; // 0x00(0x04)
	struct FVector Position3D_18_6E3E7D054AAA2168DBB2CD8626B24542; // 0x04(0x0c)
	bool IsPlayer_19_EE88FB5E472A5B22ED9E229165A4B3EC; // 0x10(0x01)
	bool IsCritical_20_019847C3427181D66E1A8CA9D428F9AD; // 0x11(0x01)
	bool IsSasCritical_21_B4A679C54808FF1E4D3477899971042B; // 0x12(0x01)
	bool IsBrainCrashCritical_22_8A5F33C24181772A5993F9B0E6F0EEA3; // 0x13(0x01)
	bool IsHeal_23_1D612C7E4DB97DD7E385499F5FBAB547; // 0x14(0x01)
	bool IsWeak_25_E32271814E642B900CCBF6920E141668; // 0x15(0x01)
	bool IsNoDamage_24_FA8962EB4C53CCAE527517AF9AF7EB5D; // 0x16(0x01)
	char pad_17[0x1]; // 0x17(0x01)
	struct ARSBattleCharacter_C* CrashTarget_26_C5E3B03241D44903770CB8A6504431A2; // 0x18(0x08)
	int32_t CrashBonus_27_3879EF2B4865F537346A0B9BECF8D0E4; // 0x20(0x04)
	struct FVector2D Offset_28_ED2BA5CF47DCD9C8A2A687804C89EA87; // 0x24(0x08)
};

