// UserDefinedStruct struct_work_caption.struct_work_caption
// Size: 0x91 (Inherited: 0x00)
struct Fstruct_work_caption {
	bool IsChoice_1_75425DEB493591DABC26B59B7F05523C; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t ChoiceNum_39_BD8ACCF644DD0F3040DF0B8BFD0EAFB6; // 0x04(0x04)
	int32_t DefaultChoiceIndex_19_6FF68CD044630ABE8ABB888FDD6BAC90; // 0x08(0x04)
	int32_t CancelChoiceIndex_53_EA2DC0B84224EE0BFD0251AEDAB0B770; // 0x0c(0x04)
	struct FString Talker_16_DDBF51D64FF38B00FD7E479468E37A03; // 0x10(0x10)
	struct FString Message_0_7_8064631045EC8036CC7537A573CBD84C; // 0x20(0x10)
	struct FString Message_1_6_C1D10F2F4C748F61D96E2C91D9D43B33; // 0x30(0x10)
	struct FString Message_2_42_161BA36E41135DEE373002AC025C430F; // 0x40(0x10)
	struct FString Message_3_44_AD0A41804DE90770BAD5C2A845A9FB57; // 0x50(0x10)
	struct FString Message_4_49_6FEB84CE4FE541B35AC321A044F193D9; // 0x60(0x10)
	int32_t WindowType_35_489B14534EA919DE9E1DB08369A2ED58; // 0x70(0x04)
	float DrawSecond_13_F48E671041163B068FB841A0AC4E1B59; // 0x74(0x04)
	bool FlagEnableSkip_30_E6D1180B4A370743CBBE9584A4EE52FA; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct URSAtomComponentBase* Voice_36_EDCB08FB4AA6A321312AAEA7A8142B7E; // 0x80(0x08)
	bool IsSkipVoiceEnd_32_27B6AFA64971B37247E72CB582365C2C; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	int32_t Result_10_DD0F506F4BEC5F33A2631288FF24247C; // 0x8c(0x04)
	bool IsMessageWithVoice_46_7AE3EA554FC0B4746B368490DD8806DE; // 0x90(0x01)
};

