// UserDefinedStruct struct_ui_equip_item_list.struct_ui_equip_item_list
// Size: 0x39 (Inherited: 0x00)
struct Fstruct_ui_equip_item_list {
	struct FName ID_2_C827FA294CF1DF70346D368BDED759E3; // 0x00(0x08)
	int32_t Index_20_EC8EBFFF4E0CC9DBF6F8B6997AB75DB5; // 0x08(0x04)
	int32_t CurrentNum_5_E611C53D4A9E61D42D254EB1CA31C9F2; // 0x0c(0x04)
	int32_t MaxNum_7_4C584AAF4681F54976FEEFB30649036D; // 0x10(0x04)
	bool IsNew_9_778EB6E44C508EAE9FE478B4846A0DB1; // 0x14(0x01)
	enum class EItemRarity Rarity_12_EEB271D149175F4588CD3DA3C5FAED77; // 0x15(0x01)
	bool IsEquip_17_24B7C59B4870DA320167BB8D9ADCD385; // 0x16(0x01)
	char pad_17[0x1]; // 0x17(0x01)
	int32_t IDNumber_23_223996854A2CCB71C9BFEDA6C6A82364; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FString ItemNameString_34_6D0B71C24414191E00E6CDA0B8E7BD7A; // 0x20(0x10)
	int32_t AttackPoint_33_8BF5BA0348C51F0E00D9BABE7627AEE1; // 0x30(0x04)
	int32_t LastAcquisitionTime_42_A1D2B52F499432B4D429458CEFE34ED5; // 0x34(0x04)
	bool IsEnable_44_CE651A1444E3C4C5F33F04849D4ABA7C; // 0x38(0x01)
};

