// WidgetBlueprintGeneratedClass ui_menu_battle_control.ui_menu_battle_control_C
// Size: 0x8a4 (Inherited: 0x528)
struct Uui_menu_battle_control_C : UUIMenuBattleControl {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x528(0x08)
	struct UWidgetAnimation* Out; // 0x530(0x08)
	struct UWidgetAnimation* In; // 0x538(0x08)
	struct UWidgetAnimation* damage_critical; // 0x540(0x08)
	struct UWidgetAnimation* damage_normal; // 0x548(0x08)
	struct UWB_ui_Brain_gauge_en_C* brain_gauge_enemy_boss; // 0x550(0x08)
	struct UWB_ui_BrainCrash_gauge2_C* BrainCrash_gauge_boss; // 0x558(0x08)
	struct UWB_ui_Sas_button_03_C* cv_button; // 0x560(0x08)
	struct UImage* cv_Unacquired_1; // 0x568(0x08)
	struct UImage* cv_Unacquired_2; // 0x570(0x08)
	struct UImage* cv_Unacquired_3; // 0x578(0x08)
	struct UImage* cv_Unacquired_4; // 0x580(0x08)
	struct UWB_ui_Vitality_en_01_C* hp_enemy_boss; // 0x588(0x08)
	struct UWB_ui_Vitality_pl_01_C* hp_p0; // 0x590(0x08)
	struct UImage* hp_p0_base_set; // 0x598(0x08)
	struct UBorder* hp_p0_Icon_Status_set; // 0x5a0(0x08)
	struct UBorder* hp_p0_vitality_num_set; // 0x5a8(0x08)
	struct UWB_ui_Vitality_pl_02_C* hp_p1; // 0x5b0(0x08)
	struct UWB_ui_Vitality_pl_03_C* hp_p2; // 0x5b8(0x08)
	struct UImage* Icon_Status01; // 0x5c0(0x08)
	struct UImage* Icon_Status02; // 0x5c8(0x08)
	struct UImage* Icon_Status03; // 0x5d0(0x08)
	struct UImage* Icon_Status04; // 0x5d8(0x08)
	struct UImage* Icon_Status05; // 0x5e0(0x08)
	struct UWB_ui_Item_Menu_1_C* item_menu; // 0x5e8(0x08)
	struct UWB_ui_Parts_minimap_1_C* Minimap; // 0x5f0(0x08)
	struct UOverlay* OverlayShadow; // 0x5f8(0x08)
	struct UOverlay* overlayWidgets_2; // 0x600(0x08)
	struct UOverlay* overlayWidgets_3; // 0x608(0x08)
	struct UImage* SAS_Base; // 0x610(0x08)
	struct UWB_ui_Sas_button_02_C* sas_button; // 0x618(0x08)
	struct UImage* sas_none_1; // 0x620(0x08)
	struct UImage* sas_none_2; // 0x628(0x08)
	struct UImage* sas_none_3; // 0x630(0x08)
	struct UImage* sas_none_4; // 0x638(0x08)
	struct UWB_ui_Sas_page_01_C* Sas_page; // 0x640(0x08)
	struct UWB_ui_Sas_menu_control_C* sas_page_menu; // 0x648(0x08)
	struct USizeBox* Size_psychic_gauge; // 0x650(0x08)
	struct UREDTextBlock* Text_party_vitality_pl_1_num1; // 0x658(0x08)
	struct UREDTextBlock* Text_party_vitality_pl_1_num2; // 0x660(0x08)
	struct UREDTextBlock* Text_party_vitality_pl_1_slash; // 0x668(0x08)
	struct UREDTextBlock* Text_pl_01; // 0x670(0x08)
	struct UWB_ui_Brain_bonus1_C* WB_ui_Brain_bonus1; // 0x678(0x08)
	struct UWB_ui_Brain_frame3_C* WB_ui_Brain_frame3; // 0x680(0x08)
	struct UWB_ui_Brain_gauge3_C* WB_ui_Brain_gauge3; // 0x688(0x08)
	struct UWB_ui_Brain_gauge_en_frame_C* WB_ui_Brain_gauge_en_frame; // 0x690(0x08)
	struct UWB_ui_Item_Menu_2_C* WB_ui_Item_Menu_3; // 0x698(0x08)
	struct UWB_ui_LevelUp_C* WB_ui_LevelUp; // 0x6a0(0x08)
	struct UWB_ui_Log_C* WB_ui_Log; // 0x6a8(0x08)
	struct UWB_ui_MapGuide_C* WB_ui_MapGuide; // 0x6b0(0x08)
	struct UWB_ui_MiniMes_C* WB_ui_MiniMes; // 0x6b8(0x08)
	struct UWB_ui_ObjectGuide_C* WB_ui_ObjectGuide; // 0x6c0(0x08)
	struct UWB_ui_PK_action_icon_1_C* WB_ui_PK_action_icon; // 0x6c8(0x08)
	struct UWB_ui_PK_action_icon_1_C* WB_ui_PK_action_icon_L; // 0x6d0(0x08)
	struct UWB_ui_PK_action_icon_1_C* WB_ui_PK_action_icon_R; // 0x6d8(0x08)
	struct UWB_ui_PK_psychic_gauge_1_C* WB_ui_PK_psychic_gauge_2; // 0x6e0(0x08)
	struct UWB_ui_PK_psychic_gauge_2_C* WB_ui_PK_psychic_gauge_3; // 0x6e8(0x08)
	struct UWB_ui_PK_psychic_timer_1_C* WB_ui_PK_psychic_timer_2; // 0x6f0(0x08)
	struct UWB_ui_Sas_frame_02_C* WB_ui_Sas_frame_1; // 0x6f8(0x08)
	struct UWB_ui_Sas_frame_02_C* WB_ui_Sas_frame_2; // 0x700(0x08)
	struct UWB_ui_Sas_frame_02_C* WB_ui_Sas_frame_3; // 0x708(0x08)
	struct UWB_ui_Sas_frame_02_C* WB_ui_Sas_frame_4; // 0x710(0x08)
	struct UWB_ui_Sas_hologram_01_C* WB_ui_Sas_hologram_01; // 0x718(0x08)
	struct UWB_ui_Success_C* WB_ui_Success; // 0x720(0x08)
	struct UWB_ui_TeamKizuna_C* WB_ui_TeamKizuna; // 0x728(0x08)
	struct UWB_ui_Vitality_en_01_frame_C* WB_ui_Vitality_en_01_frame; // 0x730(0x08)
	struct UWB_ui_Vitality_pl_02_frame_C* WB_ui_Vitality_pl_02_frame; // 0x738(0x08)
	struct UWB_ui_Vitality_pl_03_frame_C* WB_ui_Vitality_pl_03_frame; // 0x740(0x08)
	struct UWB_ui_BrainCrash_gauge_C* BrainCrashGauge; // 0x748(0x08)
	struct ARSBattleCharacter_C* BackupBrainTarget; // 0x750(0x08)
	float BackupBrainRate; // 0x758(0x04)
	float BrainCrashGaugeDrawTime; // 0x75c(0x04)
	struct UWB_ui_Intercept_1_C* WB_Icon_Intercept; // 0x760(0x08)
	struct AActor* InterceptTarget; // 0x768(0x08)
	int32_t InterceptState; // 0x770(0x04)
	bool IsActiveIntercept; // 0x774(0x01)
	bool PsychicWeightGaugeInitFlag; // 0x775(0x01)
	bool FlagTown; // 0x776(0x01)
	char pad_777[0x1]; // 0x777(0x01)
	struct TArray<struct UWB_ui_PK_weight_gauge_1_C*> WbPsychicWeightGauge; // 0x778(0x10)
	struct TArray<int32_t> PsychicWeightGaugeCurrentIndex; // 0x788(0x10)
	struct TArray<struct AActor*> PsychicWeightGaugeCurrentTarget; // 0x798(0x10)
	int32_t PsychicWeightGaugeWorkNum; // 0x7a8(0x04)
	int32_t PsychicWeightGaugeButtonNum; // 0x7ac(0x04)
	bool DebugSasHidePsychicGauge; // 0x7b0(0x01)
	char pad_7B1[0x7]; // 0x7b1(0x07)
	struct TArray<bool> PsychicWeightGaugeEnableFlag; // 0x7b8(0x10)
	struct TArray<bool> PsychicWeightGaugeEnableFlagWork; // 0x7c8(0x10)
	struct TArray<struct AActor*> PsychicWeightGaugeTarget; // 0x7d8(0x10)
	struct TArray<struct AActor*> PsychicWeightGaugeTargetWork; // 0x7e8(0x10)
	struct TArray<bool> PsychicWeightGaugeSuccessFlag; // 0x7f8(0x10)
	struct TArray<enum class EPsychicWeightGaugeSize> PsychicWeightGaugeSize; // 0x808(0x10)
	struct TArray<int32_t> PsychicWeightGaugeMaxLevel; // 0x818(0x10)
	bool FlagAjito; // 0x828(0x01)
	bool FlagDroneGuide; // 0x829(0x01)
	bool FlagExpBonus; // 0x82a(0x01)
	bool FlagMiniTips; // 0x82b(0x01)
	char pad_82C[0x4]; // 0x82c(0x04)
	struct UWB_ui_Brain_tutorial1_C* WB_ui_Brain_tutorial1; // 0x830(0x08)
	enum class EHelpTutorial CurrentTipsID; // 0x838(0x01)
	bool FlagMiniTipsPrioTop; // 0x839(0x01)
	char pad_83A[0x6]; // 0x83a(0x06)
	struct TArray<enum class EHelpTutorial> MiniTipsWorkList; // 0x840(0x10)
	struct TArray<bool> MiniTipsWorkPrioList; // 0x850(0x10)
	int32_t MiniTipsNum; // 0x860(0x04)
	float MiniTipsDrawTime; // 0x864(0x04)
	float MiniTipsTime; // 0x868(0x04)
	int32_t MiniTipsState; // 0x86c(0x04)
	bool FlagPsychicTimerActive; // 0x870(0x01)
	char pad_871[0x7]; // 0x871(0x07)
	struct TArray<bool> PsychicWeightGaugeExFlag; // 0x878(0x10)
	struct UWB_ui_Success_C* WidgetMiniTipsSuccess; // 0x888(0x08)
	bool DebugFlagDrawShortcutGuide; // 0x890(0x01)
	bool FlagPlayerWait; // 0x891(0x01)
	char pad_892[0x2]; // 0x892(0x02)
	int32_t ShortcutGuideState; // 0x894(0x04)
	bool ShortcutGuideWaitFlag; // 0x898(0x01)
	char pad_899[0x3]; // 0x899(0x03)
	float ShortcutGuideTimer; // 0x89c(0x04)
	bool FlagPsychicChaseCenter; // 0x8a0(0x01)
	bool FlagPsychicChaseL; // 0x8a1(0x01)
	bool FlagPsychicChaseR; // 0x8a2(0x01)
	bool FlagSasHologram; // 0x8a3(0x01)

	void MiniTipsSuccessUpdate(); // Function ui_menu_battle_control.ui_menu_battle_control_C.MiniTipsSuccessUpdate // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateDrawWidgetSuccess(); // Function ui_menu_battle_control.ui_menu_battle_control_C.UpdateDrawWidgetSuccess // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateDrawWidgetLevelUp(); // Function ui_menu_battle_control.ui_menu_battle_control_C.UpdateDrawWidgetLevelUp // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetDrawModeYuitosChildhood(); // Function ui_menu_battle_control.ui_menu_battle_control_C.SetDrawModeYuitosChildhood // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool MiniMapModelDelete(); // Function ui_menu_battle_control.ui_menu_battle_control_C.MiniMapModelDelete // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
