// WidgetBlueprintGeneratedClass WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C
// Size: 0x7e8 (Inherited: 0x588)
struct UWB_ui_SaveLoadList_Parts_1_C : UUISaveLoadList {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x588(0x08)
	struct UWidgetAnimation* decision_5; // 0x590(0x08)
	struct UWidgetAnimation* select_in_5; // 0x598(0x08)
	struct UWidgetAnimation* select_5; // 0x5a0(0x08)
	struct UWidgetAnimation* Default_5; // 0x5a8(0x08)
	struct UWidgetAnimation* decision_4; // 0x5b0(0x08)
	struct UWidgetAnimation* select_in_4; // 0x5b8(0x08)
	struct UWidgetAnimation* select_4; // 0x5c0(0x08)
	struct UWidgetAnimation* Default_4; // 0x5c8(0x08)
	struct UWidgetAnimation* decision_3; // 0x5d0(0x08)
	struct UWidgetAnimation* select_in_3; // 0x5d8(0x08)
	struct UWidgetAnimation* select_3; // 0x5e0(0x08)
	struct UWidgetAnimation* Default_3; // 0x5e8(0x08)
	struct UWidgetAnimation* decision_2; // 0x5f0(0x08)
	struct UWidgetAnimation* select_in_2; // 0x5f8(0x08)
	struct UWidgetAnimation* select_2; // 0x600(0x08)
	struct UWidgetAnimation* default_none; // 0x608(0x08)
	struct UWidgetAnimation* Default_2; // 0x610(0x08)
	struct UImage* Base_2; // 0x618(0x08)
	struct UImage* Base_black; // 0x620(0x08)
	struct UOverlay* Clear_2; // 0x628(0x08)
	struct UOverlay* Clear_3; // 0x630(0x08)
	struct UBorder* Clear_Color; // 0x638(0x08)
	struct UImage* Clear_Line_2; // 0x640(0x08)
	struct UImage* Clear_Line_3; // 0x648(0x08)
	struct UImage* End_Contents_Mark; // 0x650(0x08)
	struct UImage* Frame_2; // 0x658(0x08)
	struct UImage* ghost_frame; // 0x660(0x08)
	struct UREDImageBase* icon_PL_Ex_2; // 0x668(0x08)
	struct UImage* Image_capture_2; // 0x670(0x08)
	struct UImage* Image_slot_2; // 0x678(0x08)
	struct UImage* neon_2; // 0x680(0x08)
	struct UImage* neon_1_add; // 0x688(0x08)
	struct UImage* neon_2_add; // 0x690(0x08)
	struct UImage* NEON_base; // 0x698(0x08)
	struct UImage* Noise_2; // 0x6a0(0x08)
	struct UImage* Text_Base; // 0x6a8(0x08)
	struct UREDTextBlock* Text_save_List_Auto; // 0x6b0(0x08)
	struct UREDTextBlock* Text_save_List_Clear_2; // 0x6b8(0x08)
	struct UREDTextBlock* Text_save_List_Clear_3; // 0x6c0(0x08)
	struct UREDTextBlock* Text_save_list_Day_3; // 0x6c8(0x08)
	struct UREDTextBlock* Text_save_list_Day_4; // 0x6d0(0x08)
	struct UREDTextBlock* Text_save_list_Day_hh; // 0x6d8(0x08)
	struct UREDTextBlock* Text_save_list_Day_mm; // 0x6e0(0x08)
	struct UREDTextBlock* Text_save_list_Day_num_2; // 0x6e8(0x08)
	struct UREDTextBlock* Text_save_list_Day_ss; // 0x6f0(0x08)
	struct UREDTextBlock* Text_save_list_Info; // 0x6f8(0x08)
	struct UREDTextBlock* Text_save_list_PL_; // 0x700(0x08)
	struct UREDTextBlock* Text_save_list_PL_Lv; // 0x708(0x08)
	struct UREDTextBlock* Text_save_list_PL_Lv_num; // 0x710(0x08)
	struct UREDTextBlock* Text_save_list_PL_Name; // 0x718(0x08)
	struct UREDTextBlock* Text_save_list_Time_2; // 0x720(0x08)
	struct UREDTextBlock* Text_save_list_Time_3; // 0x728(0x08)
	struct UREDTextBlock* Text_save_list_Time_4; // 0x730(0x08)
	struct UREDTextBlock* Text_save_list_Time_hh; // 0x738(0x08)
	struct UREDTextBlock* Text_save_list_Time_mm; // 0x740(0x08)
	struct UREDTextBlock* Text_save_list_Time_ss; // 0x748(0x08)
	struct UREDTextBlock* Text_save_list_Title_2; // 0x750(0x08)
	struct UREDTextBlock* Text_save_list_Title_3; // 0x758(0x08)
	struct UImage* Thubnail_Shade; // 0x760(0x08)
	struct TArray<struct UTexture2D*> ScreenTexture; // 0x768(0x10)
	struct FLinearColor OutLineInfo; // 0x778(0x10)
	struct FLinearColor OutLineTitle; // 0x788(0x10)
	struct FSlateColor LevelColor_Max; // 0x798(0x28)
	struct FSlateColor LevelColor; // 0x7c0(0x28)

	bool SetLevelFontColor(bool LevelMax); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.SetLevelFontColor // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetFontColor(enum class SaveLoadListClearType dataType, struct UTextBlock* text); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.SetFontColor // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetDataFontOutLineColor(enum class SaveLoadListType dataType, struct UTextBlock* text); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.SetDataFontOutLineColor // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool SetTitleFontOutLineColor(enum class SaveLoadListType dataType, struct UTextBlock* text); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.SetTitleFontOutLineColor // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetScreenTexture(int32_t ImageType, struct UTexture2D* ImageData); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.SetScreenTexture // (Event|Protected|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void Construct(); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_SaveLoadList_Parts_2(int32_t EntryPoint); // Function WB_ui_SaveLoadList_Parts_2.WB_ui_SaveLoadList_Parts_1_C.ExecuteUbergraph_WB_ui_SaveLoadList_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

