// WidgetBlueprintGeneratedClass WB_ui_ShopContents_Parts_2.WB_ui_ShopContents_Parts_1_C
// Size: 0x400 (Inherited: 0x388)
struct UWB_ui_ShopContents_Parts_1_C : UUIBase {
	struct UWidgetAnimation* unselect; // 0x388(0x08)
	struct UWidgetAnimation* decision; // 0x390(0x08)
	struct UWidgetAnimation* select_out; // 0x398(0x08)
	struct UWidgetAnimation* select_in; // 0x3a0(0x08)
	struct UWidgetAnimation* select; // 0x3a8(0x08)
	struct UWidgetAnimation* Default; // 0x3b0(0x08)
	struct UImage* Base_Neon_2; // 0x3b8(0x08)
	struct UImage* Base_select_3; // 0x3c0(0x08)
	struct UImage* Frame_2; // 0x3c8(0x08)
	struct UImage* Frame_1_select; // 0x3d0(0x08)
	struct UImage* Frame_2_select; // 0x3d8(0x08)
	struct UImage* neon_2; // 0x3e0(0x08)
	struct UImage* neon_1_add; // 0x3e8(0x08)
	struct UImage* neon_2_add; // 0x3f0(0x08)
	struct UREDTextBlock* Text_shop_category_2; // 0x3f8(0x08)

	void UpdateShopFont2OutlineMaterial(); // Function WB_ui_ShopContents_Parts_2.WB_ui_ShopContents_Parts_1_C.UpdateShopFont2OutlineMaterial // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
};

