// WidgetBlueprintGeneratedClass WB_ui_KeyboardList_Parts_2.WB_ui_KeyboardList_Parts_1_C
// Size: 0x558 (Inherited: 0x460)
struct UWB_ui_KeyboardList_Parts_1_C : UUIConfigKeyboardMouseListIndex {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x460(0x08)
	struct UWidgetAnimation* select_2_out; // 0x468(0x08)
	struct UWidgetAnimation* select_2_in; // 0x470(0x08)
	struct UWidgetAnimation* select_3; // 0x478(0x08)
	struct UWidgetAnimation* Default_3; // 0x480(0x08)
	struct UWidgetAnimation* select_R2; // 0x488(0x08)
	struct UWidgetAnimation* select_L2; // 0x490(0x08)
	struct UWidgetAnimation* cancel_R2; // 0x498(0x08)
	struct UWidgetAnimation* cancel_L2; // 0x4a0(0x08)
	struct UWidgetAnimation* decision_R; // 0x4a8(0x08)
	struct UWidgetAnimation* decision_L; // 0x4b0(0x08)
	struct UWidgetAnimation* change_R_L; // 0x4b8(0x08)
	struct UWidgetAnimation* change_L_R; // 0x4c0(0x08)
	struct UWidgetAnimation* select_R_out; // 0x4c8(0x08)
	struct UWidgetAnimation* select_R_in; // 0x4d0(0x08)
	struct UWidgetAnimation* select_R; // 0x4d8(0x08)
	struct UWidgetAnimation* select_L_out; // 0x4e0(0x08)
	struct UWidgetAnimation* select_L_in; // 0x4e8(0x08)
	struct UWidgetAnimation* select_L; // 0x4f0(0x08)
	struct UWidgetAnimation* Default; // 0x4f8(0x08)
	struct UOverlay* Frame_Set_2; // 0x500(0x08)
	struct UOverlay* Frame_Set_3; // 0x508(0x08)
	struct UImage* icon_font_3; // 0x510(0x08)
	struct UImage* icon_font_4; // 0x518(0x08)
	struct UImage* icon_font_6; // 0x520(0x08)
	struct UImage* icon_font_7; // 0x528(0x08)
	struct UImage* icon_font_8; // 0x530(0x08)
	struct UREDOverlay* pg_set_3; // 0x538(0x08)
	struct UREDOverlay* pg_set_4; // 0x540(0x08)
	struct UREDTextBlock* Text_keyboard_list_2; // 0x548(0x08)
	struct UREDTextBlock* Text_keyboard_list_5; // 0x550(0x08)

	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_KeyboardList_Parts_2.WB_ui_KeyboardList_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void Construct(); // Function WB_ui_KeyboardList_Parts_2.WB_ui_KeyboardList_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_KeyboardList_Parts_2(int32_t EntryPoint); // Function WB_ui_KeyboardList_Parts_2.WB_ui_KeyboardList_Parts_1_C.ExecuteUbergraph_WB_ui_KeyboardList_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

