// WidgetBlueprintGeneratedClass WB_ui_BrainMap_LineEffect_2.WB_ui_BrainMap_LineEffect_1_C
// Size: 0x3d0 (Inherited: 0x388)
struct UWB_ui_BrainMap_LineEffect_1_C : UUIBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x388(0x08)
	struct UWidgetAnimation* decision_3; // 0x390(0x08)
	struct UWidgetAnimation* decision; // 0x398(0x08)
	struct UImage* Line_eff_2; // 0x3a0(0x08)
	struct UImage* Line_eff_3; // 0x3a8(0x08)
	struct UImage* Line_eff_4; // 0x3b0(0x08)
	struct UImage* Line_eff_5; // 0x3b8(0x08)
	struct UImage* Line_eff_6; // 0x3c0(0x08)
	struct UImage* Line_eff_base; // 0x3c8(0x08)

	void OnInitialized(); // Function WB_ui_BrainMap_LineEffect_2.WB_ui_BrainMap_LineEffect_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_BrainMap_LineEffect_2(int32_t EntryPoint); // Function WB_ui_BrainMap_LineEffect_2.WB_ui_BrainMap_LineEffect_1_C.ExecuteUbergraph_WB_ui_BrainMap_LineEffect_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

