// WidgetBlueprintGeneratedClass WB_ui_SasLink.WB_ui_SasLink_C
// Size: 0x690 (Inherited: 0x3c0)
struct UWB_ui_SasLink_C : UUISASLink {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c0(0x08)
	struct UWidgetAnimation* out_NotConnect; // 0x3c8(0x08)
	struct UWidgetAnimation* in_NotConnect; // 0x3d0(0x08)
	struct UWidgetAnimation* default_NotConnect; // 0x3d8(0x08)
	struct UWidgetAnimation* out_max; // 0x3e0(0x08)
	struct UWidgetAnimation* in_max; // 0x3e8(0x08)
	struct UWidgetAnimation* default_max; // 0x3f0(0x08)
	struct UWidgetAnimation* Out; // 0x3f8(0x08)
	struct UWidgetAnimation* In; // 0x400(0x08)
	struct UWidgetAnimation* default_none; // 0x408(0x08)
	struct UWidgetAnimation* Default; // 0x410(0x08)
	struct UImage* Bond_Base; // 0x418(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x420(0x08)
	struct UOverlay* Chara_Set; // 0x428(0x08)
	struct UImage* Chara_Set_Base_2; // 0x430(0x08)
	struct UImage* Chara_Set_Frame_2; // 0x438(0x08)
	struct UImage* chara_slot_icon_2; // 0x440(0x08)
	struct UImage* Face_a2; // 0x448(0x08)
	struct UImage* Line_8; // 0x450(0x08)
	struct UImage* Line_9; // 0x458(0x08)
	struct UImage* Line_10; // 0x460(0x08)
	struct UImage* Line_11; // 0x468(0x08)
	struct UImage* Line_12; // 0x470(0x08)
	struct UImage* NotConnect_Frame_2; // 0x478(0x08)
	struct UImage* NotConnect_Frame_3; // 0x480(0x08)
	struct UOverlay* NotConnect_Set; // 0x488(0x08)
	struct UOverlay* Overlay_2; // 0x490(0x08)
	struct UOverlay* PG_All_Set; // 0x498(0x08)
	struct UBorder* PG_Text_bond_num; // 0x4a0(0x08)
	struct UREDRetainerBox* REDRetainerBox_Menu; // 0x4a8(0x08)
	struct UImage* SAS_Base; // 0x4b0(0x08)
	struct UImage* sas_frame_pattern; // 0x4b8(0x08)
	struct UImage* sas_icon; // 0x4c0(0x08)
	struct UImage* sas_icon_add; // 0x4c8(0x08)
	struct UImage* Skill_List_Base; // 0x4d0(0x08)
	struct UImage* Skill_List_Frame_3; // 0x4d8(0x08)
	struct UImage* Skill_List_Frame_4; // 0x4e0(0x08)
	struct UImage* Skill_List_Frame_1top; // 0x4e8(0x08)
	struct UImage* Skill_List_Frame_1under; // 0x4f0(0x08)
	struct UREDTextBlock* Text_saslink_bond_1num; // 0x4f8(0x08)
	struct UREDTextBlock* Text_saslink_charaname_2; // 0x500(0x08)
	struct UREDTextBlock* Text_saslink_NotConnect_2; // 0x508(0x08)
	struct UREDTextBlock* Text_saslink_sasname_2; // 0x510(0x08)
	struct UUniformGridPanel* UniformGridPanel_1; // 0x518(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_3; // 0x520(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_4; // 0x528(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_5; // 0x530(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_6; // 0x538(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_7; // 0x540(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_8; // 0x548(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_9; // 0x550(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_10; // 0x558(0x08)
	struct UWB_ui_SasLink_chara_parts_1_C* WB_ui_SasLink_chara_parts_11; // 0x560(0x08)
	struct UWB_ui_SasLink_popup_1_C* WB_ui_SasLink_popup_2; // 0x568(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_2; // 0x570(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_3; // 0x578(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_4; // 0x580(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_5; // 0x588(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_6; // 0x590(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_7; // 0x598(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_8; // 0x5a0(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_9; // 0x5a8(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_10; // 0x5b0(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_11; // 0x5b8(0x08)
	struct UWB_ui_SasLink_skill_parts_1_C* WB_ui_SasLink_skill_parts_1_12; // 0x5c0(0x08)
	struct UWB_ui_SasLink_slot_parts_1_C* WB_ui_SasLink_slot_parts_2; // 0x5c8(0x08)
	struct FMulticastInlineDelegate SetScene; // 0x5d0(0x10)
	bool IsContentsChange; // 0x5e0(0x01)
	bool IsMax; // 0x5e1(0x01)
	bool IsMaxWork; // 0x5e2(0x01)
	bool IsEnd; // 0x5e3(0x01)
	char pad_5E4[0x4]; // 0x5e4(0x04)
	struct TArray<struct UWB_ui_SasLink_chara_parts_1_C*> CharaIconList; // 0x5e8(0x10)
	struct TArray<enum class EPlayerID> CharaIDList; // 0x5f8(0x10)
	int32_t MaxUpper; // 0x608(0x04)
	int32_t MaxUnder; // 0x60c(0x04)
	int32_t StateIndex; // 0x610(0x04)
	int32_t StatePosition; // 0x614(0x04)
	int32_t StateMember; // 0x618(0x04)
	int32_t CursorMember; // 0x61c(0x04)
	struct TArray<struct UWB_ui_SasLink_skill_parts_1_C*> SkillNameList; // 0x620(0x10)
	struct TArray<struct UImage*> SkillLineList; // 0x630(0x10)
	bool MouseDecideFlag; // 0x640(0x01)
	char pad_641[0x7]; // 0x641(0x07)
	struct TArray<enum class E_SASKindNative> SASList; // 0x648(0x10)
	struct TArray<enum class EPlayerID> CharaList; // 0x658(0x10)
	enum class EPlayerID playerId; // 0x668(0x01)
	enum class EPlayerID CurrentCharaID; // 0x669(0x01)
	char pad_66A[0x6]; // 0x66a(0x06)
	struct UTextBlock* textHelp; // 0x670(0x08)
	struct UWB_ui_Guide_C* GuideWidget; // 0x678(0x08)
	struct FMulticastInlineDelegate SetPopupMode; // 0x680(0x10)

	void UpdateSkillEffectCell(); // Function WB_ui_SasLink.WB_ui_SasLink_C.UpdateSkillEffectCell // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InitSasMemberCursor(); // Function WB_ui_SasLink.WB_ui_SasLink_C.InitSasMemberCursor // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InitChangeTab(); // Function WB_ui_SasLink.WB_ui_SasLink_C.InitChangeTab // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InitOpenMenu(); // Function WB_ui_SasLink.WB_ui_SasLink_C.InitOpenMenu // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetupGuideWidget(); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetupGuideWidget // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetupHelpText(); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetupHelpText // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PCGetMouseDecide(bool decideFlag); // Function WB_ui_SasLink.WB_ui_SasLink_C.PCGetMouseDecide // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void PCCharaSelectEnable(bool Enable); // Function WB_ui_SasLink.WB_ui_SasLink_C.PCCharaSelectEnable // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetSasInfo(enum class E_SASKindNative SasID); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetSasInfo // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetCharaInfo(enum class EPlayerID CharaID); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetCharaInfo // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetCurrentSkill(); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetCurrentSkill // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ProcSasMember(); // Function WB_ui_SasLink.WB_ui_SasLink_C.ProcSasMember // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ProcSasPosition(); // Function WB_ui_SasLink.WB_ui_SasLink_C.ProcSasPosition // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InitMember(); // Function WB_ui_SasLink.WB_ui_SasLink_C.InitMember // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void isEndMenu(bool IsEnd); // Function WB_ui_SasLink.WB_ui_SasLink_C.isEndMenu // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void GetOutAnimationIndex(int32_t Index); // Function WB_ui_SasLink.WB_ui_SasLink_C.GetOutAnimationIndex // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void GetInAnimationIndex(int32_t Index); // Function WB_ui_SasLink.WB_ui_SasLink_C.GetInAnimationIndex // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void InitializeCommonParts(struct UTextBlock* textHelp, struct UWB_ui_Guide_C* guide); // Function WB_ui_SasLink.WB_ui_SasLink_C.InitializeCommonParts // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetContentsChange(bool IsChange); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetContentsChange // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateClose(int32_t SubState); // Function WB_ui_SasLink.WB_ui_SasLink_C.StateClose // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateLoop(int32_t SubState); // Function WB_ui_SasLink.WB_ui_SasLink_C.StateLoop // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateOpen(int32_t SubState); // Function WB_ui_SasLink.WB_ui_SasLink_C.StateOpen // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateNone(int32_t SubState); // Function WB_ui_SasLink.WB_ui_SasLink_C.StateNone // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void Construct(); // Function WB_ui_SasLink.WB_ui_SasLink_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_SasLink.WB_ui_SasLink_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_SasLink.WB_ui_SasLink_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void  ‚¤ãƒ™ãƒ³ãƒˆ CharaSelectM(struct FRedMouseArgument argument, struct UUserWidget* pWidget); // Function WB_ui_SasLink.WB_ui_SasLink_C. ‚¤ãƒ™ãƒ³ãƒˆ CharaSelectM // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_SasLink(int32_t EntryPoint); // Function WB_ui_SasLink.WB_ui_SasLink_C.ExecuteUbergraph_WB_ui_SasLink // (Final|UbergraphFunction|HasDefaults) // @ game+0x1685580
	void SetPopupMode__DelegateSignature(bool IsPopup); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetPopupMode__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetScene__DelegateSignature(enum class EUIMain3DCharacterSceneID SceneID); // Function WB_ui_SasLink.WB_ui_SasLink_C.SetScene__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
};

