// WidgetBlueprintGeneratedClass WB_ui_GameOver_Parts_2.WB_ui_GameOver_Parts_1_C
// Size: 0x4f8 (Inherited: 0x388)
struct UWB_ui_GameOver_Parts_1_C : UUIBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x388(0x08)
	struct UWidgetAnimation* out_title; // 0x390(0x08)
	struct UWidgetAnimation* out_retry; // 0x398(0x08)
	struct UWidgetAnimation* In; // 0x3a0(0x08)
	struct UWidgetAnimation* Default; // 0x3a8(0x08)
	struct UImage* BG_Black; // 0x3b0(0x08)
	struct UImage* BG_Emblem_2; // 0x3b8(0x08)
	struct UImage* BG_Grid; // 0x3c0(0x08)
	struct UImage* BG_Retry; // 0x3c8(0x08)
	struct UImage* Ghost_size; // 0x3d0(0x08)
	struct UImage* Ghost_Title_Line; // 0x3d8(0x08)
	struct UImage* Help; // 0x3e0(0x08)
	struct UImage* Help_base; // 0x3e8(0x08)
	struct UImage* Line_2; // 0x3f0(0x08)
	struct UImage* Line_1_add; // 0x3f8(0x08)
	struct UImage* Line_2_add; // 0x400(0x08)
	struct UImage* none_Ghost_BG_add; // 0x408(0x08)
	struct UREDRetainerBox* REDRetainerBox_eff; // 0x410(0x08)
	struct UREDRetainerBox* REDRetainerBox_Menu; // 0x418(0x08)
	struct UREDRetainerBox* REDRetainerBox_Menu_add; // 0x420(0x08)
	struct UREDRetainerBox* REDRetainerBox_Menu_base; // 0x428(0x08)
	struct UImage* retry_1L_add; // 0x430(0x08)
	struct UImage* retry_1R_add; // 0x438(0x08)
	struct UImage* retry_2L_add; // 0x440(0x08)
	struct UImage* retry_2R_add; // 0x448(0x08)
	struct UImage* retry_3_add; // 0x450(0x08)
	struct UImage* retry_4L_add; // 0x458(0x08)
	struct UImage* retry_4R_add; // 0x460(0x08)
	struct UREDTextBlock* Text_GameOver_2; // 0x468(0x08)
	struct UREDTextBlock* Text_GameOver_3; // 0x470(0x08)
	struct UImage* Text_gameover_base; // 0x478(0x08)
	struct UImage* title_1L1; // 0x480(0x08)
	struct UImage* title_1L2; // 0x488(0x08)
	struct UImage* title_1R1; // 0x490(0x08)
	struct UImage* title_1R2; // 0x498(0x08)
	struct UImage* title_2L; // 0x4a0(0x08)
	struct UImage* title_2R; // 0x4a8(0x08)
	struct UImage* title_3L; // 0x4b0(0x08)
	struct UImage* title_3R; // 0x4b8(0x08)
	struct UImage* title_eff_2; // 0x4c0(0x08)
	struct UImage* title_eff_3; // 0x4c8(0x08)
	struct UImage* title_eff_4; // 0x4d0(0x08)
	struct UImage* title_eff_5; // 0x4d8(0x08)
	struct UImage* title_eff_6; // 0x4e0(0x08)
	struct UWB_ui_GameOver_Parts_2_C* WB_ui_GameOver_Parts_2_2; // 0x4e8(0x08)
	struct UWB_ui_GameOver_Parts_2_C* WB_ui_GameOver_Parts_2_3; // 0x4f0(0x08)

	void UpdateGameOverBlackMaterial(); // Function WB_ui_GameOver_Parts_2.WB_ui_GameOver_Parts_1_C.UpdateGameOverBlackMaterial // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_GameOver_Parts_2(int32_t EntryPoint); // Function WB_ui_GameOver_Parts_2.WB_ui_GameOver_Parts_1_C.ExecuteUbergraph_WB_ui_GameOver_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

