// WidgetBlueprintGeneratedClass WB_ui_EndCredits.WB_ui_EndCredits_C
// Size: 0x3ef0 (Inherited: 0x3d90)
struct UWB_ui_EndCredits_C : UUICredit {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3d90(0x08)
	struct UWidgetAnimation* Default; // 0x3d98(0x08)
	struct UOverlay* CorporateName+Official; // 0x3da0(0x08)
	struct UImage* img_logo_2; // 0x3da8(0x08)
	struct UOverlay* Logo; // 0x3db0(0x08)
	struct UOverlay* Official*2+StaffName*2; // 0x3db8(0x08)
	struct UOverlay* Official+StaffName; // 0x3dc0(0x08)
	struct UOverlay* Official+StaffName*2; // 0x3dc8(0x08)
	struct UOverlay* Overlay_3; // 0x3dd0(0x08)
	struct UOverlay* Space+StaffName; // 0x3dd8(0x08)
	struct UOverlay* Space+StaffName*2; // 0x3de0(0x08)
	struct USpacer* Spacer; // 0x3de8(0x08)
	struct USpacer* Spacer_2; // 0x3df0(0x08)
	struct USpacer* Spacer_3; // 0x3df8(0x08)
	struct USpacer* Spacer_4; // 0x3e00(0x08)
	struct USpacer* Spacer_5; // 0x3e08(0x08)
	struct USpacer* Spacer_6; // 0x3e10(0x08)
	struct USpacer* Spacer_7; // 0x3e18(0x08)
	struct USpacer* Spacer_9; // 0x3e20(0x08)
	struct USpacer* Spacer_10; // 0x3e28(0x08)
	struct USpacer* Spacer_126; // 0x3e30(0x08)
	struct UOverlay* StaffName; // 0x3e38(0x08)
	struct UOverlay* StaffName*2; // 0x3e40(0x08)
	struct UOverlay* StaffName*4; // 0x3e48(0x08)
	struct UREDTextBlock* Text_EndCredits_2; // 0x3e50(0x08)
	struct UREDTextBlock* Text_EndCredits_3; // 0x3e58(0x08)
	struct UREDTextBlock* Text_EndCredits_4; // 0x3e60(0x08)
	struct UREDTextBlock* Text_EndCredits_5; // 0x3e68(0x08)
	struct UREDTextBlock* Text_EndCredits_6; // 0x3e70(0x08)
	struct UREDTextBlock* Text_EndCredits_7; // 0x3e78(0x08)
	struct UREDTextBlock* Text_EndCredits_8; // 0x3e80(0x08)
	struct UREDTextBlock* Text_EndCredits_9; // 0x3e88(0x08)
	struct UREDTextBlock* Text_EndCredits_10; // 0x3e90(0x08)
	struct UREDTextBlock* Text_EndCredits_11; // 0x3e98(0x08)
	struct UREDTextBlock* Text_EndCredits_12; // 0x3ea0(0x08)
	struct UREDTextBlock* Text_EndCredits_13; // 0x3ea8(0x08)
	struct UREDTextBlock* Text_EndCredits_14; // 0x3eb0(0x08)
	struct UREDTextBlock* Text_EndCredits_15; // 0x3eb8(0x08)
	struct UREDTextBlock* Text_EndCredits_16; // 0x3ec0(0x08)
	struct UREDTextBlock* Text_EndCredits_17; // 0x3ec8(0x08)
	struct UREDTextBlock* Text_EndCredits_18; // 0x3ed0(0x08)
	struct UREDTextBlock* Text_EndCredits_19; // 0x3ed8(0x08)
	struct UREDTextBlock* Text_EndCredits_20; // 0x3ee0(0x08)
	struct UREDTextBlock* Text_EndCredits_21; // 0x3ee8(0x08)

	void Construct(); // Function WB_ui_EndCredits.WB_ui_EndCredits_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_EndCredits.WB_ui_EndCredits_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_EndCredits(int32_t EntryPoint); // Function WB_ui_EndCredits.WB_ui_EndCredits_C.ExecuteUbergraph_WB_ui_EndCredits // (Final|UbergraphFunction|HasDefaults) // @ game+0x1685580
};

