// WidgetBlueprintGeneratedClass WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C
// Size: 0x665 (Inherited: 0x388)
struct UWB_ui_PK_action_icon_1_C : UUIPkActionIcon {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x388(0x08)
	struct UWidgetAnimation* decision_Press1_LR; // 0x390(0x08)
	struct UWidgetAnimation* entering_Press1_LR; // 0x398(0x08)
	struct UWidgetAnimation* default_Press1_LR; // 0x3a0(0x08)
	struct UWidgetAnimation* decision_Press1_Hold; // 0x3a8(0x08)
	struct UWidgetAnimation* entering_Press1_Hold; // 0x3b0(0x08)
	struct UWidgetAnimation* default_Press_Hold; // 0x3b8(0x08)
	struct UWidgetAnimation* entering_Tilt_Keep; // 0x3c0(0x08)
	struct UWidgetAnimation* entering_Turn_Right; // 0x3c8(0x08)
	struct UWidgetAnimation* decision_Tilt_Keep; // 0x3d0(0x08)
	struct UWidgetAnimation* default_Tilt_Keep; // 0x3d8(0x08)
	struct UWidgetAnimation* decision_Press1_Rush; // 0x3e0(0x08)
	struct UWidgetAnimation* decision_Press1; // 0x3e8(0x08)
	struct UWidgetAnimation* _delete_decision_Turn_Left; // 0x3f0(0x08)
	struct UWidgetAnimation* decision_Turn_Right; // 0x3f8(0x08)
	struct UWidgetAnimation* decision_Tilt; // 0x400(0x08)
	struct UWidgetAnimation* default_Press1_Rush; // 0x408(0x08)
	struct UWidgetAnimation* default_Press1; // 0x410(0x08)
	struct UWidgetAnimation* _delete_default_Turn_Left; // 0x418(0x08)
	struct UWidgetAnimation* default_Turn_Right; // 0x420(0x08)
	struct UWidgetAnimation* default_Tilt; // 0x428(0x08)
	struct UWidgetAnimation* Out; // 0x430(0x08)
	struct UWidgetAnimation* In; // 0x438(0x08)
	struct UWidgetAnimation* default_none; // 0x440(0x08)
	struct UImage* base_eff; // 0x448(0x08)
	struct UOverlay* Button_2; // 0x450(0x08)
	struct UOverlay* Button_3; // 0x458(0x08)
	struct UImage* Button_1_eff; // 0x460(0x08)
	struct UImage* Button_2_eff; // 0x468(0x08)
	struct UImage* Button_Icon_2; // 0x470(0x08)
	struct UImage* Button_Icon_3; // 0x478(0x08)
	struct UImage* Button_Icon_1_Base; // 0x480(0x08)
	struct UImage* Button_Icon_2_Base; // 0x488(0x08)
	struct UImage* Button_icon_font_2; // 0x490(0x08)
	struct UImage* Button_icon_font_r; // 0x498(0x08)
	struct UImage* Button_Icon_r; // 0x4a0(0x08)
	struct UImage* Button_Icon_r_Base; // 0x4a8(0x08)
	struct UOverlay* Button_R; // 0x4b0(0x08)
	struct UImage* Button_r_eff; // 0x4b8(0x08)
	struct UOverlay* Button_Set; // 0x4c0(0x08)
	struct UImage* eff_2; // 0x4c8(0x08)
	struct UImage* eff01_add; // 0x4d0(0x08)
	struct UOverlay* eff01_Angle; // 0x4d8(0x08)
	struct UOverlay* Instruction_Tilt; // 0x4e0(0x08)
	struct UOverlay* Instruction_Tilt_Keep; // 0x4e8(0x08)
	struct UOverlay* Instruction_Turn; // 0x4f0(0x08)
	struct UImage* Noise_4; // 0x4f8(0x08)
	struct UImage* Press_eff; // 0x500(0x08)
	struct UOverlay* Press_Hold_gauge; // 0x508(0x08)
	struct UImage* Press_Hold_gauge_2; // 0x510(0x08)
	struct UImage* Press_Hold_gauge_3; // 0x518(0x08)
	struct UImage* Press_icon; // 0x520(0x08)
	struct UOverlay* Press_Rush_gauge; // 0x528(0x08)
	struct UImage* Press_Rush_gauge_2; // 0x530(0x08)
	struct UImage* Press_Rush_gauge_3; // 0x538(0x08)
	struct UImage* Press_Rush_gauge_4; // 0x540(0x08)
	struct UImage* Press_Rush_gauge_5; // 0x548(0x08)
	struct UImage* Press_Rush_gauge_6; // 0x550(0x08)
	struct UImage* Press_Rush_gauge_7; // 0x558(0x08)
	struct UImage* Rush_eff_2; // 0x560(0x08)
	struct UOverlay* Stick; // 0x568(0x08)
	struct UOverlay* Stick_3; // 0x570(0x08)
	struct UOverlay* Stick_Angle; // 0x578(0x08)
	struct UImage* Stick_Base_2; // 0x580(0x08)
	struct UImage* Stick_eff; // 0x588(0x08)
	struct UImage* Stick_Icon; // 0x590(0x08)
	struct UImage* Stick_Icon_Base; // 0x598(0x08)
	struct UImage* Stick_icon_font; // 0x5a0(0x08)
	struct UOverlay* Stick_Set; // 0x5a8(0x08)
	struct UREDTextBlock* Text_action_Instruction_2; // 0x5b0(0x08)
	struct UImage* Text_Base; // 0x5b8(0x08)
	struct UImage* Text_eff; // 0x5c0(0x08)
	struct UOverlay* Text_set; // 0x5c8(0x08)
	struct UImage* Tilt_eff; // 0x5d0(0x08)
	struct UImage* Tilt_icon; // 0x5d8(0x08)
	struct UImage* Tilt_Keep_eff; // 0x5e0(0x08)
	struct UImage* Tilt_Keep_gauge_2; // 0x5e8(0x08)
	struct UImage* Tilt_Keep_gauge_3; // 0x5f0(0x08)
	struct UImage* Tilt_Keep_icon; // 0x5f8(0x08)
	struct UOverlay* Tilt_Set; // 0x600(0x08)
	struct UImage* Turn_eff; // 0x608(0x08)
	struct UImage* Turn_Icon_2; // 0x610(0x08)
	struct UImage* Turn_Icon_3; // 0x618(0x08)
	struct UWB_ui_PK_action_icon_2_C* WB_ui_PK_action_icon_3; // 0x620(0x08)
	struct TArray<struct UWB_ui_ShopContents_Parts_1_C*> ChildBuySell; // 0x628(0x10)
	struct TArray<struct UWB_ui_ShopContents_Parts_6_C*> ChildItemCategory; // 0x638(0x10)
	bool IsSuccess; // 0x648(0x01)
	enum class EPsychicObjectUniqueInputType InputType; // 0x649(0x01)
	enum class EPsychicObjectUniqueInputButton ButtonType; // 0x64a(0x01)
	char pad_64B[0x1]; // 0x64b(0x01)
	int32_t DrawType; // 0x64c(0x04)
	int32_t RushCounter; // 0x650(0x04)
	bool IsRoll; // 0x654(0x01)
	bool FlagStickHold; // 0x655(0x01)
	bool FlagCurrentStickHold; // 0x656(0x01)
	bool IsStartRoll; // 0x657(0x01)
	bool FlagButtonHold; // 0x658(0x01)
	bool FlagCurrentButtonHold; // 0x659(0x01)
	bool FlagSasFire; // 0x65a(0x01)
	bool FlagKeyboard; // 0x65b(0x01)
	bool FlagRollKeyboard; // 0x65c(0x01)
	bool FlagSingle; // 0x65d(0x01)
	bool FlagMouseMove; // 0x65e(0x01)
	bool FlagUseMouseLStick; // 0x65f(0x01)
	float NewVar_1; // 0x660(0x04)
	enum class enum_ui_action_icon_device_type DeviceType; // 0x664(0x01)

	void ChangeButton(enum class EPsychicObjectUniqueInputButton ButtonBase, enum class EUI_UV_BUtton_N1 ButtonUV); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.ChangeButton // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void SetSasFireFlag(bool IsSasFire); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetSasFireFlag // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetButtonHold(bool IsHold); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetButtonHold // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetButtonHoldPercent(float percent); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetButtonHoldPercent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void RollStickStart(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.RollStickStart // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetText(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetText // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetStickHold(bool IsHold); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetStickHold // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetButtonRushPercent(float percent); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetButtonRushPercent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void RollStick(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.RollStick // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetStickHoldPercent(float percent); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetStickHoldPercent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateButton(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.UpdateButton // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void RushPress(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.RushPress // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetArrowAngle(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.SetArrowAngle // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetDecideAnimationIndex(int32_t Index); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.GetDecideAnimationIndex // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void GetLoopAnimationIndex(int32_t Index); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.GetLoopAnimationIndex // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void setSuccessFlag(bool IsSuccess); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.setSuccessFlag // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void setIconType(enum class EPsychicObjectUniqueInputType Input, enum class EPsychicObjectUniqueInputButton Button, bool IsSingle, enum class enum_ui_action_icon_device_type device, bool IsMouseMode); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.setIconType // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateClose(int32_t SubState); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.StateClose // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateLoop(int32_t SubState); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.StateLoop // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateOpen(int32_t SubState); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.StateOpen // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateNone(int32_t SubState); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.StateNone // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void Construct(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_PK_action_icon_2(int32_t EntryPoint); // Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_1_C.ExecuteUbergraph_WB_ui_PK_action_icon_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

