// WidgetBlueprintGeneratedClass WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C
// Size: 0x5f3 (Inherited: 0x388)
struct UWB_ui_SasLink_slot_parts_1_C : UUIBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x388(0x08)
	struct UWidgetAnimation* m_select_2_L; // 0x390(0x08)
	struct UWidgetAnimation* f_decision_2_R; // 0x398(0x08)
	struct UWidgetAnimation* f_decision_2_L; // 0x3a0(0x08)
	struct UWidgetAnimation* f_decision_2; // 0x3a8(0x08)
	struct UWidgetAnimation* f_change_2_RL; // 0x3b0(0x08)
	struct UWidgetAnimation* f_change_2_LR; // 0x3b8(0x08)
	struct UWidgetAnimation* f_select_2_R; // 0x3c0(0x08)
	struct UWidgetAnimation* f_select_2_L; // 0x3c8(0x08)
	struct UWidgetAnimation* f_select_2; // 0x3d0(0x08)
	struct UWidgetAnimation* m_decision_2_R; // 0x3d8(0x08)
	struct UWidgetAnimation* m_decision_2_L; // 0x3e0(0x08)
	struct UWidgetAnimation* m_decision_2; // 0x3e8(0x08)
	struct UWidgetAnimation* m_change_2_RL; // 0x3f0(0x08)
	struct UWidgetAnimation* m_change_2_LR; // 0x3f8(0x08)
	struct UWidgetAnimation* m_select_2_R; // 0x400(0x08)
	struct UWidgetAnimation* m_select_2; // 0x408(0x08)
	struct UOverlay* All; // 0x410(0x08)
	struct UImage* chara; // 0x418(0x08)
	struct UImage* chara_base; // 0x420(0x08)
	struct UImage* chara_base2; // 0x428(0x08)
	struct UOverlay* iconSet_2; // 0x430(0x08)
	struct UOverlay* iconSet_3; // 0x438(0x08)
	struct UImage* ID; // 0x440(0x08)
	struct UImage* ID_base; // 0x448(0x08)
	struct UImage* neon_2; // 0x450(0x08)
	struct UImage* neon_3; // 0x458(0x08)
	struct UImage* neon_6; // 0x460(0x08)
	struct UImage* neon_1_add; // 0x468(0x08)
	struct UImage* neon_2_add; // 0x470(0x08)
	struct UImage* neon_3a; // 0x478(0x08)
	struct UImage* neon_3a_add; // 0x480(0x08)
	struct UImage* neon_3b; // 0x488(0x08)
	struct UImage* neon_3b_add; // 0x490(0x08)
	struct UImage* neon_3c; // 0x498(0x08)
	struct UImage* neon_3c_add; // 0x4a0(0x08)
	struct UImage* neon_3d; // 0x4a8(0x08)
	struct UImage* neon_3d_add; // 0x4b0(0x08)
	struct UImage* neon_3e; // 0x4b8(0x08)
	struct UImage* neon_3e_add; // 0x4c0(0x08)
	struct UImage* neon_4a; // 0x4c8(0x08)
	struct UImage* neon_4a_add; // 0x4d0(0x08)
	struct UImage* neon_4b; // 0x4d8(0x08)
	struct UImage* neon_4b_add; // 0x4e0(0x08)
	struct UImage* neon_4d; // 0x4e8(0x08)
	struct UImage* neon_4d_add; // 0x4f0(0x08)
	struct UImage* neon_4e; // 0x4f8(0x08)
	struct UImage* neon_4e_add; // 0x500(0x08)
	struct UImage* neon_5_add; // 0x508(0x08)
	struct UOverlay* Overlay_1; // 0x510(0x08)
	struct UImage* Sas_Frame_Base_2; // 0x518(0x08)
	struct UImage* Sas_Frame_Base_3; // 0x520(0x08)
	struct UImage* Sas_Frame_Base_1a; // 0x528(0x08)
	struct UImage* Sas_Frame_Base_2a; // 0x530(0x08)
	struct UImage* Sas_Frame_Select_L; // 0x538(0x08)
	struct UImage* Sas_Frame_Select_R; // 0x540(0x08)
	struct UREDTextBlock* Text_saslink_charaname_3; // 0x548(0x08)
	struct UREDTextBlock* Text_saslink_slot_id_2; // 0x550(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_1; // 0x558(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_2; // 0x560(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_3; // 0x568(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_4; // 0x570(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_5; // 0x578(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_6; // 0x580(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_7; // 0x588(0x08)
	struct UWB_ui_SasLink_slot_parts_2_C* WB_ui_SasLink_slot_parts_2_8; // 0x590(0x08)
	struct TArray<struct UWB_ui_SasLink_slot_parts_2_C*> IconList; // 0x598(0x10)
	struct TArray<struct UImage*> ImageNeonList; // 0x5a8(0x10)
	struct TArray<struct UImage*> ImageNeonAddList; // 0x5b8(0x10)
	int32_t AnimIndex; // 0x5c8(0x04)
	int32_t CursorDir; // 0x5cc(0x04)
	int32_t CursorPage; // 0x5d0(0x04)
	bool DualFlag; // 0x5d4(0x01)
	bool decideFlag; // 0x5d5(0x01)
	bool LockFlag; // 0x5d6(0x01)
	bool MoveCursorFlag; // 0x5d7(0x01)
	bool EnableInputFlag; // 0x5d8(0x01)
	char pad_5D9[0x7]; // 0x5d9(0x07)
	struct TArray<enum class E_SASButton> SasButtonList; // 0x5e0(0x10)
	bool MouseDecideFlag; // 0x5f0(0x01)
	bool enableFlag; // 0x5f1(0x01)
	bool MoveMouseCursorFlag; // 0x5f2(0x01)

	void SetEnable(bool IsEnable); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.SetEnable // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetupDefaultMessage(); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.SetupDefaultMessage // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ResetCursorPos(); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.ResetCursorPos // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetNeon(enum class EPlayerID CharaID); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.SetNeon // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PCGetMouseDecide(bool decideFlag); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.PCGetMouseDecide // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void PCSlotSelectEnable(bool Enable); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.PCSlotSelectEnable // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateCurrentSasIcon(); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.UpdateCurrentSasIcon // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetSasIcon(int32_t Index); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.SetSasIcon // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetCurrentSlot(enum class E_SASButton Slot); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.GetCurrentSlot // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void SetEnableInput(bool IsEnableInput); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.SetEnableInput // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetCurrentSkill(enum class E_SASKindNative SkillID); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.GetCurrentSkill // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void IsMoveCursor(bool IsMove); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.IsMoveCursor // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void Unlock(); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.Unlock // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void Decide(bool isLock, enum class EPlayerID CharaID); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.Decide // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void InputCheck(bool IsDual, bool IsSwitch); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.InputCheck // (Private|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateLoop(int32_t SubState); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.StateLoop // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateNone(int32_t SubState); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.StateNone // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetupIconList(); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.SetupIconList // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void Construct(); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void  ‚¤ãƒ™ãƒ³ãƒˆ SlotSelectPage1M(struct FRedMouseArgument argument, struct UUserWidget* pWidget); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C. ‚¤ãƒ™ãƒ³ãƒˆ SlotSelectPage1M // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void  ‚¤ãƒ™ãƒ³ãƒˆ SlotSelectPage2M(struct FRedMouseArgument argument, struct UUserWidget* pWidget); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C. ‚¤ãƒ™ãƒ³ãƒˆ SlotSelectPage2M // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_SasLink_slot_parts_2(int32_t EntryPoint); // Function WB_ui_SasLink_slot_parts_2.WB_ui_SasLink_slot_parts_1_C.ExecuteUbergraph_WB_ui_SasLink_slot_parts_2 // (Final|UbergraphFunction|HasDefaults) // @ game+0x1685580
};

