// WidgetBlueprintGeneratedClass WB_ui_log.WB_ui_Log_C
// Size: 0x7b8 (Inherited: 0x710)
struct UWB_ui_Log_C : UUILog {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x710(0x08)
	struct UWidgetAnimation* Default_7; // 0x718(0x08)
	struct UWidgetAnimation* Default_6; // 0x720(0x08)
	struct UWidgetAnimation* Default_5; // 0x728(0x08)
	struct UWidgetAnimation* Default_4; // 0x730(0x08)
	struct UWidgetAnimation* Default_3; // 0x738(0x08)
	struct UWidgetAnimation* Default_2; // 0x740(0x08)
	struct UWidgetAnimation* In_8; // 0x748(0x08)
	struct UWidgetAnimation* In_7; // 0x750(0x08)
	struct UWidgetAnimation* In_6; // 0x758(0x08)
	struct UWidgetAnimation* In_5; // 0x760(0x08)
	struct UWidgetAnimation* In_4; // 0x768(0x08)
	struct UWidgetAnimation* In_3; // 0x770(0x08)
	struct UWidgetAnimation* In_2; // 0x778(0x08)
	struct UWB_ui_Log_parts_1_C* WB_ui_Log_parts_2; // 0x780(0x08)
	struct UWB_ui_Log_parts_1_C* WB_ui_Log_parts_3; // 0x788(0x08)
	struct UWB_ui_Log_parts_1_C* WB_ui_Log_parts_4; // 0x790(0x08)
	struct UWB_ui_Log_parts_1_C* WB_ui_Log_parts_5; // 0x798(0x08)
	struct UWB_ui_Log_parts_1_C* WB_ui_Log_parts_6; // 0x7a0(0x08)
	struct UWB_ui_Log_parts_1_C* WB_ui_Log_parts_7; // 0x7a8(0x08)
	struct UWB_ui_Log_parts_1_C* WB_ui_Log_parts_8; // 0x7b0(0x08)

	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_log.WB_ui_Log_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_log.WB_ui_Log_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Log(int32_t EntryPoint); // Function WB_ui_log.WB_ui_Log_C.ExecuteUbergraph_WB_ui_Log // (Final|UbergraphFunction) // @ game+0x1685580
};

