// WidgetBlueprintGeneratedClass WB_ui_SystemChoice_Parts_2.WB_ui_SystemChoice_Parts_1_C
// Size: 0x4c0 (Inherited: 0x448)
struct UWB_ui_SystemChoice_Parts_1_C : UUIConfigChoice {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x448(0x08)
	struct UWidgetAnimation* Default; // 0x450(0x08)
	struct UImage* Base_2; // 0x458(0x08)
	struct UVerticalBox* Choise_Set; // 0x460(0x08)
	struct UImage* Frame_2; // 0x468(0x08)
	struct UREDImageBase* icon_font_2; // 0x470(0x08)
	struct UImage* Line_2; // 0x478(0x08)
	struct UImage* Line_3; // 0x480(0x08)
	struct UOverlay* PG_Guide_Set; // 0x488(0x08)
	struct UREDTextBlock* Text_config_choice_2; // 0x490(0x08)
	struct UREDTextBlock* Text_config_choice_3; // 0x498(0x08)
	struct UREDTextBlock* Text_config_choice_4; // 0x4a0(0x08)
	struct UVerticalBox* VerticalBox_2; // 0x4a8(0x08)
	struct UWB_ui_Choise_parts_1_C* WB_ui_Choise_parts_1_2; // 0x4b0(0x08)
	struct UWB_ui_Choise_parts_1_C* WB_ui_Choise_parts_1_3; // 0x4b8(0x08)

	void Construct(); // Function WB_ui_SystemChoice_Parts_2.WB_ui_SystemChoice_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_SystemChoice_Parts_2.WB_ui_SystemChoice_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_SystemChoice_Parts_2(int32_t EntryPoint); // Function WB_ui_SystemChoice_Parts_2.WB_ui_SystemChoice_Parts_1_C.ExecuteUbergraph_WB_ui_SystemChoice_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

