// WidgetBlueprintGeneratedClass WB_ui_Config_Parts_2.WB_ui_Config_Parts_1_C
// Size: 0x3d0 (Inherited: 0x388)
struct UWB_ui_Config_Parts_1_C : UUIBase {
	struct UWidgetAnimation* select_2_out; // 0x388(0x08)
	struct UWidgetAnimation* select_2_in; // 0x390(0x08)
	struct UWidgetAnimation* select_3; // 0x398(0x08)
	struct UWidgetAnimation* decision; // 0x3a0(0x08)
	struct UWidgetAnimation* select_1_out; // 0x3a8(0x08)
	struct UWidgetAnimation* select_1_in; // 0x3b0(0x08)
	struct UWidgetAnimation* select_2; // 0x3b8(0x08)
	struct UWidgetAnimation* Default; // 0x3c0(0x08)
	struct UREDTextBlock* Text_config_setup_2; // 0x3c8(0x08)
};

