// WidgetBlueprintGeneratedClass WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C
// Size: 0x631 (Inherited: 0x398)
struct UWB_ui_Party_CharaInfo_Parts_1_C : UUIPartyCharaInfo {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x398(0x08)
	struct UWidgetAnimation* change_2_2; // 0x3a0(0x08)
	struct UWidgetAnimation* change_1_3; // 0x3a8(0x08)
	struct UWidgetAnimation* Default_3; // 0x3b0(0x08)
	struct UWidgetAnimation* planlist_decision_7; // 0x3b8(0x08)
	struct UWidgetAnimation* planlist_decision_6; // 0x3c0(0x08)
	struct UWidgetAnimation* planlist_decision_5; // 0x3c8(0x08)
	struct UWidgetAnimation* planlist_decision_4; // 0x3d0(0x08)
	struct UWidgetAnimation* planlist_decision_3; // 0x3d8(0x08)
	struct UWidgetAnimation* planlist_decision_2; // 0x3e0(0x08)
	struct UWidgetAnimation* Default_5; // 0x3e8(0x08)
	struct UWidgetAnimation* Default_4; // 0x3f0(0x08)
	struct UWidgetAnimation* PlanList; // 0x3f8(0x08)
	struct UWidgetAnimation* planlist_in; // 0x400(0x08)
	struct UWidgetAnimation* default_none; // 0x408(0x08)
	struct UWidgetAnimation* Default_2; // 0x410(0x08)
	struct UBorder* All_Color; // 0x418(0x08)
	struct UImage* Bond_Base; // 0x420(0x08)
	struct UImage* Bond_icon; // 0x428(0x08)
	struct UImage* EXP_guage_2; // 0x430(0x08)
	struct UImage* EXP_guage_1_add; // 0x438(0x08)
	struct UImage* EXP_Guage_base; // 0x440(0x08)
	struct UImage* Face_a; // 0x448(0x08)
	struct UImage* Face_Noise; // 0x450(0x08)
	struct UImage* Frame_2; // 0x458(0x08)
	struct UImage* Frame_3; // 0x460(0x08)
	struct UImage* Frame_1_Base; // 0x468(0x08)
	struct UImage* HP_gauge_add_2; // 0x470(0x08)
	struct UImage* HP_guage_2; // 0x478(0x08)
	struct UImage* HP_Guage_base; // 0x480(0x08)
	struct UREDImageBase* icon_font; // 0x488(0x08)
	struct UBorder* info_bond_1num; // 0x490(0x08)
	struct UBorder* info_category_1_num1; // 0x498(0x08)
	struct UBorder* info_LV_1_num; // 0x4a0(0x08)
	struct UOverlay* Parts_Set_3; // 0x4a8(0x08)
	struct UOverlay* plan_list_CBottom; // 0x4b0(0x08)
	struct UImage* SAS_Base; // 0x4b8(0x08)
	struct UImage* sas_frame_pattern; // 0x4c0(0x08)
	struct UImage* sas_icon; // 0x4c8(0x08)
	struct UImage* sas_icon_add; // 0x4d0(0x08)
	struct UImage* SAS_Name_base; // 0x4d8(0x08)
	struct UOverlay* Set; // 0x4e0(0x08)
	struct UREDTextBlock* Text_party_info_bond_1num; // 0x4e8(0x08)
	struct UREDTextBlock* Text_party_info_category_2; // 0x4f0(0x08)
	struct UREDTextBlock* Text_party_info_category_3; // 0x4f8(0x08)
	struct UREDTextBlock* Text_party_info_category_4; // 0x500(0x08)
	struct UREDTextBlock* Text_party_info_category_5; // 0x508(0x08)
	struct UREDTextBlock* Text_party_info_category_1_num1; // 0x510(0x08)
	struct UREDTextBlock* Text_party_info_category_1_num2; // 0x518(0x08)
	struct UREDTextBlock* Text_party_info_category_1_slash; // 0x520(0x08)
	struct UREDTextBlock* Text_party_info_category_2_num; // 0x528(0x08)
	struct UREDTextBlock* Text_party_info_category_3_num; // 0x530(0x08)
	struct UREDTextBlock* Text_party_info_category_4_num; // 0x538(0x08)
	struct UREDTextBlock* Text_party_info_EXP_2; // 0x540(0x08)
	struct UREDTextBlock* Text_Party_info_EXP_1_num; // 0x548(0x08)
	struct UREDTextBlock* Text_party_info_id_2; // 0x550(0x08)
	struct UREDTextBlock* Text_party_info_LV_2; // 0x558(0x08)
	struct UREDTextBlock* Text_Party_info_LV_1_num; // 0x560(0x08)
	struct UREDTextBlock* Text_party_info_name_2; // 0x568(0x08)
	struct UREDTextBlock* Text_party_info_plan_2; // 0x570(0x08)
	struct UREDTextBlock* Text_party_info_plan_3; // 0x578(0x08)
	struct UREDTextBlock* Text_party_info_SAS_2; // 0x580(0x08)
	struct UWB_ui_Party_CharaInfo_Parts_2_C* WB_ui_Party_CharaInfo_Parts_2_2; // 0x588(0x08)
	struct UWB_ui_Party_CharaInfo_Parts_2_C* WB_ui_Party_CharaInfo_Parts_2_3; // 0x590(0x08)
	struct UWB_ui_Party_CharaInfo_Parts_2_C* WB_ui_Party_CharaInfo_Parts_2_4; // 0x598(0x08)
	struct UWB_ui_Party_CharaInfo_Parts_2_C* WB_ui_Party_CharaInfo_Parts_2_5; // 0x5a0(0x08)
	struct UWB_ui_Party_CharaInfo_Parts_2_C* WB_ui_Party_CharaInfo_Parts_2_6; // 0x5a8(0x08)
	struct UWB_ui_Party_CharaInfo_Parts_2_C* WB_ui_Party_CharaInfo_Parts_2_7; // 0x5b0(0x08)
	bool FlagChangeOperations; // 0x5b8(0x01)
	char pad_5B9[0x3]; // 0x5b9(0x03)
	int32_t OperationCursor; // 0x5bc(0x04)
	int32_t Operations; // 0x5c0(0x04)
	char pad_5C4[0x4]; // 0x5c4(0x04)
	struct TArray<struct UWB_ui_Party_CharaInfo_Parts_2_C*> PartsList; // 0x5c8(0x10)
	bool IsEmpty; // 0x5d8(0x01)
	bool IsDrawOperations; // 0x5d9(0x01)
	bool IsEnableChangeOperations; // 0x5da(0x01)
	bool FlagUpdate; // 0x5db(0x01)
	enum class EPlayerID CharaID; // 0x5dc(0x01)
	char pad_5DD[0x3]; // 0x5dd(0x03)
	struct FSlateColor ParamUpTextColor; // 0x5e0(0x28)
	struct FSlateColor ParamDownTextColor; // 0x608(0x28)
	enum class EPlayerID playerId; // 0x630(0x01)

	void SetStringColor(int32_t Index, struct FString String, struct FSlateColor Color); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetStringColor // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetStringParameter(int32_t Index, struct FString String); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetStringParameter // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetPlayerID(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetPlayerID // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetVisibleGauge(bool IsVisible); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetVisibleGauge // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetNextExp(enum class EPlayerID CharaID, int32_t Level, int32_t Exp); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.GetNextExp // (Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void GetColorComparison(int32_t NowData, int32_t NewData, struct FSlateColor Color); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.GetColorComparison // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void SetCharacterComparison(struct FPlayerInfo NowData, struct FPlayerInfo NewData); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetCharacterComparison // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetHp(int32_t HP, int32_t MaxHp); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetHp // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetLv(int32_t LV); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetLv // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ReflectOperations(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.ReflectOperations // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetNumText(int32_t Number, struct FText text); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.GetNumText // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void SetCharacterEmpty(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetCharacterEmpty // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetBaseText(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetBaseText // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetSas(int32_t ID); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetSas // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetFace(int32_t ID); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetFace // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PlayDefaultAnimation(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.PlayDefaultAnimation // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetEnableChangeOperations(bool IsEnable); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetEnableChangeOperations // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetDrawOperations(bool IsDraw); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetDrawOperations // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetupOperationsList(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetupOperationsList // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CloseChangeOperations(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.CloseChangeOperations // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OpenChangeOperations(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.OpenChangeOperations // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void IsChangeOperations(bool IsChange); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.IsChangeOperations // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void StateSelectOperations(int32_t SubState); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.StateSelectOperations // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateLoop(int32_t SubState); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.StateLoop // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void StateNone(int32_t SubState); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.StateNone // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetCharacterStruct(struct FPlayerInfo Param); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.SetCharacterStruct // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PreConstruct(bool IsDesignTime); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void Construct(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void  ½œ (struct FRedMouseArgument argument, struct UUserWidget* pWidget); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C. ½œ  // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2(int32_t EntryPoint); // Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_1_C.ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2 // (Final|UbergraphFunction|HasDefaults) // @ game+0x1685580
};

