// WidgetBlueprintGeneratedClass WB_ui_Quest_Parts_4.WB_ui_Quest_Parts_3_C
// Size: 0x3f8 (Inherited: 0x3a0)
struct UWB_ui_Quest_Parts_3_C : UUIQuestNamePlate {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3a0(0x08)
	struct UWidgetAnimation* default_none; // 0x3a8(0x08)
	struct UWidgetAnimation* Default; // 0x3b0(0x08)
	struct UImage* Face_a_2; // 0x3b8(0x08)
	struct UImage* Face_a_3; // 0x3c0(0x08)
	struct UImage* Frame; // 0x3c8(0x08)
	struct UImage* Frame_2; // 0x3d0(0x08)
	struct UImage* Frame_3; // 0x3d8(0x08)
	struct UOverlay* KasaneSet; // 0x3e0(0x08)
	struct UREDTextBlock* Text_quest_player_2; // 0x3e8(0x08)
	struct UOverlay* YuitoSet; // 0x3f0(0x08)

	void Construct(); // Function WB_ui_Quest_Parts_4.WB_ui_Quest_Parts_3_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Quest_Parts_4.WB_ui_Quest_Parts_3_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Quest_Parts_4(int32_t EntryPoint); // Function WB_ui_Quest_Parts_4.WB_ui_Quest_Parts_3_C.ExecuteUbergraph_WB_ui_Quest_Parts_4 // (Final|UbergraphFunction) // @ game+0x1685580
};

