// WidgetBlueprintGeneratedClass WB_ui_Controller.WB_ui_Controller_C
// Size: 0x668 (Inherited: 0x500)
struct UWB_ui_Controller_C : UUIConfigController {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x500(0x08)
	struct UWidgetAnimation* Default; // 0x508(0x08)
	struct UBorder* All_Color; // 0x510(0x08)
	struct UCanvasPanel* CanvasPanel_ViewRange; // 0x518(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_2; // 0x520(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_3; // 0x528(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_4; // 0x530(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_5; // 0x538(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_6; // 0x540(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_7; // 0x548(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_8; // 0x550(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_9; // 0x558(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_10; // 0x560(0x08)
	struct UWB_ui_ControllerListParts_1_C* ListParts_1_11; // 0x568(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_2; // 0x570(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_3; // 0x578(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_4; // 0x580(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_5; // 0x588(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_6; // 0x590(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_7; // 0x598(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_8; // 0x5a0(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_9; // 0x5a8(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_10; // 0x5b0(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_11; // 0x5b8(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_12; // 0x5c0(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_13; // 0x5c8(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_14; // 0x5d0(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_15; // 0x5d8(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_16; // 0x5e0(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_17; // 0x5e8(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_18; // 0x5f0(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_19; // 0x5f8(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_20; // 0x600(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_21; // 0x608(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_22; // 0x610(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_23; // 0x618(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_24; // 0x620(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_25; // 0x628(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_26; // 0x630(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_27; // 0x638(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_28; // 0x640(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_29; // 0x648(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_30; // 0x650(0x08)
	struct UWB_ui_ControllerListParts_2_C* ListParts_2_31; // 0x658(0x08)
	struct UREDScrollBoxSimple* REDScrollBoxSimple_1; // 0x660(0x08)

	void Construct(); // Function WB_ui_Controller.WB_ui_Controller_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Controller.WB_ui_Controller_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_Controller.WB_ui_Controller_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Controller(int32_t EntryPoint); // Function WB_ui_Controller.WB_ui_Controller_C.ExecuteUbergraph_WB_ui_Controller // (Final|UbergraphFunction) // @ game+0x1685580
};

