// WidgetBlueprintGeneratedClass WB_ui_Config_Parts_3.WB_ui_Config_Parts_2_C
// Size: 0x3d8 (Inherited: 0x388)
struct UWB_ui_Config_Parts_2_C : UUIBase {
	struct UWidgetAnimation* select_2_out; // 0x388(0x08)
	struct UWidgetAnimation* select_2_in; // 0x390(0x08)
	struct UWidgetAnimation* select_3; // 0x398(0x08)
	struct UWidgetAnimation* decision; // 0x3a0(0x08)
	struct UWidgetAnimation* select_1_out; // 0x3a8(0x08)
	struct UWidgetAnimation* select_1_in; // 0x3b0(0x08)
	struct UWidgetAnimation* select_2; // 0x3b8(0x08)
	struct UWidgetAnimation* Default; // 0x3c0(0x08)
	struct UImage* Base_2; // 0x3c8(0x08)
	struct UREDTextBlock* Text_Config_setup_1_num; // 0x3d0(0x08)
};

