// WidgetBlueprintGeneratedClass WB_ui_Shop_EStatus_Parts_2.WB_ui_Shop_EStatus_Parts_1_C
// Size: 0x458 (Inherited: 0x3e8)
struct UWB_ui_Shop_EStatus_Parts_1_C : UUIShopPartyStatus {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3e8(0x08)
	struct UBorder* All_Color; // 0x3f0(0x08)
	struct UImage* Chara_Set_Base_2; // 0x3f8(0x08)
	struct UImage* Chara_Set_Frame_2; // 0x400(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_2; // 0x408(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_3; // 0x410(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_4; // 0x418(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_5; // 0x420(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_6; // 0x428(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_7; // 0x430(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_8; // 0x438(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_9; // 0x440(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_10; // 0x448(0x08)
	struct UWB_ui_Shop_EStatus_Parts_2_C* WB_ui_Shop_EStatus_Parts_2_11; // 0x450(0x08)

	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Shop_EStatus_Parts_2.WB_ui_Shop_EStatus_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_Shop_EStatus_Parts_2.WB_ui_Shop_EStatus_Parts_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Shop_EStatus_Parts_2(int32_t EntryPoint); // Function WB_ui_Shop_EStatus_Parts_2.WB_ui_Shop_EStatus_Parts_1_C.ExecuteUbergraph_WB_ui_Shop_EStatus_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

