// WidgetBlueprintGeneratedClass WB_ui_Item_EStatus_Parts_2.WB_ui_Item_EStatus_Parts_1_C
// Size: 0x440 (Inherited: 0x3e0)
struct UWB_ui_Item_EStatus_Parts_1_C : UUIItemPartyStatus {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3e0(0x08)
	struct UWidgetAnimation* Default; // 0x3e8(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_2; // 0x3f0(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_3; // 0x3f8(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_4; // 0x400(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_5; // 0x408(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_6; // 0x410(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_7; // 0x418(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_8; // 0x420(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_9; // 0x428(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_10; // 0x430(0x08)
	struct UWB_ui_Item_EStatus_Parts_2_C* WB_ui_Item_EStatus_Parts_2_11; // 0x438(0x08)

	void Construct(); // Function WB_ui_Item_EStatus_Parts_2.WB_ui_Item_EStatus_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Item_EStatus_Parts_2.WB_ui_Item_EStatus_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2(int32_t EntryPoint); // Function WB_ui_Item_EStatus_Parts_2.WB_ui_Item_EStatus_Parts_1_C.ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

