// WidgetBlueprintGeneratedClass WB_ui_BrainMap_2.WB_ui_BrainMap_1_C
// Size: 0x1764 (Inherited: 0x3e8)
struct UWB_ui_BrainMap_1_C : UUIBrainMap {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3e8(0x08)
	struct UWidgetAnimation* info_window_out; // 0x3f0(0x08)
	struct UWidgetAnimation* info_window_in; // 0x3f8(0x08)
	struct UWidgetAnimation* info_window; // 0x400(0x08)
	struct UWidgetAnimation* Out; // 0x408(0x08)
	struct UWidgetAnimation* In; // 0x410(0x08)
	struct UWidgetAnimation* Default; // 0x418(0x08)
	struct UImage* Base_brain; // 0x420(0x08)
	struct UImage* Brain_Icon_3; // 0x428(0x08)
	struct UImage* Brain_Icon_4; // 0x430(0x08)
	struct UImage* Brain_Icon_5; // 0x438(0x08)
	struct UImage* Brain_Icon_6; // 0x440(0x08)
	struct UImage* Brain_Icon_7; // 0x448(0x08)
	struct UImage* Brain_Icon_8; // 0x450(0x08)
	struct UImage* CA_Image_Blue; // 0x458(0x08)
	struct UImage* CA_Image_Green; // 0x460(0x08)
	struct UImage* CA_Image_Red; // 0x468(0x08)
	struct UOverlay* icon_set; // 0x470(0x08)
	struct UOverlay* K_A; // 0x478(0x08)
	struct UOverlay* K_E; // 0x480(0x08)
	struct UImage* K_Line_11; // 0x488(0x08)
	struct UImage* K_Line_12; // 0x490(0x08)
	struct UImage* K_Line_13; // 0x498(0x08)
	struct UImage* K_Line_14; // 0x4a0(0x08)
	struct UImage* K_Line_15; // 0x4a8(0x08)
	struct UImage* K_Line_16; // 0x4b0(0x08)
	struct UImage* K_Line_17; // 0x4b8(0x08)
	struct UImage* K_Line_18; // 0x4c0(0x08)
	struct UImage* K_Line_19; // 0x4c8(0x08)
	struct UImage* K_Line_20; // 0x4d0(0x08)
	struct UImage* K_Line_21; // 0x4d8(0x08)
	struct UImage* K_Line_22; // 0x4e0(0x08)
	struct UImage* K_Line_23; // 0x4e8(0x08)
	struct UImage* K_Line_24; // 0x4f0(0x08)
	struct UImage* K_Line_25; // 0x4f8(0x08)
	struct UImage* K_Line_26; // 0x500(0x08)
	struct UImage* K_Line_27; // 0x508(0x08)
	struct UImage* K_Line_28; // 0x510(0x08)
	struct UImage* K_Line_29; // 0x518(0x08)
	struct UImage* K_Line_30; // 0x520(0x08)
	struct UImage* K_Line_31; // 0x528(0x08)
	struct UImage* K_Line_32; // 0x530(0x08)
	struct UImage* K_Line_33; // 0x538(0x08)
	struct UImage* K_Line_34; // 0x540(0x08)
	struct UImage* K_Line_35; // 0x548(0x08)
	struct UImage* K_Line_36; // 0x550(0x08)
	struct UImage* K_Line_37; // 0x558(0x08)
	struct UImage* K_Line_38; // 0x560(0x08)
	struct UImage* K_Line_39; // 0x568(0x08)
	struct UImage* K_Line_40; // 0x570(0x08)
	struct UImage* K_Line_41; // 0x578(0x08)
	struct UImage* K_Line_42; // 0x580(0x08)
	struct UImage* K_Line_43; // 0x588(0x08)
	struct UImage* K_Line_44; // 0x590(0x08)
	struct UImage* K_Line_45; // 0x598(0x08)
	struct UImage* K_Line_46; // 0x5a0(0x08)
	struct UImage* K_Line_47; // 0x5a8(0x08)
	struct UImage* K_Line_48; // 0x5b0(0x08)
	struct UImage* K_Line_49; // 0x5b8(0x08)
	struct UImage* K_Line_50; // 0x5c0(0x08)
	struct UImage* K_Line_51; // 0x5c8(0x08)
	struct UImage* K_Line_52; // 0x5d0(0x08)
	struct UImage* K_Line_53; // 0x5d8(0x08)
	struct UImage* K_Line_54; // 0x5e0(0x08)
	struct UImage* K_Line_55; // 0x5e8(0x08)
	struct UImage* K_Line_56; // 0x5f0(0x08)
	struct UImage* K_Line_57; // 0x5f8(0x08)
	struct UImage* K_Line_58; // 0x600(0x08)
	struct UImage* K_Line_59; // 0x608(0x08)
	struct UImage* K_Line_60; // 0x610(0x08)
	struct UImage* K_Line_61; // 0x618(0x08)
	struct UImage* K_Line_62; // 0x620(0x08)
	struct UImage* K_Line_63; // 0x628(0x08)
	struct UImage* K_Line_64; // 0x630(0x08)
	struct UImage* K_Line_65; // 0x638(0x08)
	struct UImage* K_Line_00; // 0x640(0x08)
	struct UImage* K_Line_00_add; // 0x648(0x08)
	struct UImage* K_Line_01; // 0x650(0x08)
	struct UImage* K_Line_01_add; // 0x658(0x08)
	struct UImage* K_Line_02; // 0x660(0x08)
	struct UImage* K_Line_02_add; // 0x668(0x08)
	struct UImage* K_Line_03; // 0x670(0x08)
	struct UImage* K_Line_03_add; // 0x678(0x08)
	struct UImage* K_Line_04; // 0x680(0x08)
	struct UImage* K_Line_04_add; // 0x688(0x08)
	struct UImage* K_Line_05; // 0x690(0x08)
	struct UImage* K_Line_05_add; // 0x698(0x08)
	struct UImage* K_Line_06; // 0x6a0(0x08)
	struct UImage* K_Line_06_add; // 0x6a8(0x08)
	struct UImage* K_Line_07; // 0x6b0(0x08)
	struct UImage* K_Line_07_add; // 0x6b8(0x08)
	struct UImage* K_Line_08; // 0x6c0(0x08)
	struct UImage* K_Line_08_add; // 0x6c8(0x08)
	struct UImage* K_Line_09; // 0x6d0(0x08)
	struct UImage* K_Line_09_add; // 0x6d8(0x08)
	struct UImage* K_Line_10_add; // 0x6e0(0x08)
	struct UImage* K_Line_11_add; // 0x6e8(0x08)
	struct UImage* K_Line_12_add; // 0x6f0(0x08)
	struct UImage* K_Line_13_add; // 0x6f8(0x08)
	struct UImage* K_Line_14_add; // 0x700(0x08)
	struct UImage* K_Line_15_add; // 0x708(0x08)
	struct UImage* K_Line_16_add; // 0x710(0x08)
	struct UImage* K_Line_17_add; // 0x718(0x08)
	struct UImage* K_Line_18_add; // 0x720(0x08)
	struct UImage* K_Line_19_add; // 0x728(0x08)
	struct UImage* K_Line_20_add; // 0x730(0x08)
	struct UImage* K_Line_21_add; // 0x738(0x08)
	struct UImage* K_Line_22_add; // 0x740(0x08)
	struct UImage* K_Line_23_add; // 0x748(0x08)
	struct UImage* K_Line_24_add; // 0x750(0x08)
	struct UImage* K_Line_25_add; // 0x758(0x08)
	struct UImage* K_Line_26_add; // 0x760(0x08)
	struct UImage* K_Line_27_add; // 0x768(0x08)
	struct UImage* K_Line_28_add; // 0x770(0x08)
	struct UImage* K_Line_29_add; // 0x778(0x08)
	struct UImage* K_Line_30_add; // 0x780(0x08)
	struct UImage* K_Line_31_add; // 0x788(0x08)
	struct UImage* K_Line_32_add; // 0x790(0x08)
	struct UImage* K_Line_33_add; // 0x798(0x08)
	struct UImage* K_Line_34_add; // 0x7a0(0x08)
	struct UImage* K_Line_35_add; // 0x7a8(0x08)
	struct UImage* K_Line_36_add; // 0x7b0(0x08)
	struct UImage* K_Line_37_add; // 0x7b8(0x08)
	struct UImage* K_Line_38_add; // 0x7c0(0x08)
	struct UImage* K_Line_39_add; // 0x7c8(0x08)
	struct UImage* K_Line_40_add; // 0x7d0(0x08)
	struct UImage* K_Line_41_add; // 0x7d8(0x08)
	struct UImage* K_Line_42_add; // 0x7e0(0x08)
	struct UImage* K_Line_43_add; // 0x7e8(0x08)
	struct UImage* K_Line_44_add; // 0x7f0(0x08)
	struct UImage* K_Line_45_add; // 0x7f8(0x08)
	struct UImage* K_Line_46_add; // 0x800(0x08)
	struct UImage* K_Line_47_add; // 0x808(0x08)
	struct UImage* K_Line_48_add; // 0x810(0x08)
	struct UImage* K_Line_49_add; // 0x818(0x08)
	struct UImage* K_Line_50_add; // 0x820(0x08)
	struct UImage* K_Line_51_add; // 0x828(0x08)
	struct UImage* K_Line_52_add; // 0x830(0x08)
	struct UImage* K_Line_53_add; // 0x838(0x08)
	struct UImage* K_Line_54_add; // 0x840(0x08)
	struct UImage* K_Line_55_add; // 0x848(0x08)
	struct UImage* K_Line_56_add; // 0x850(0x08)
	struct UImage* K_Line_57_add; // 0x858(0x08)
	struct UImage* K_Line_58_add; // 0x860(0x08)
	struct UImage* K_Line_59_add; // 0x868(0x08)
	struct UImage* K_Line_60_add; // 0x870(0x08)
	struct UImage* K_Line_61_add; // 0x878(0x08)
	struct UImage* K_Line_62_add; // 0x880(0x08)
	struct UImage* K_Line_63_add; // 0x888(0x08)
	struct UImage* K_Line_64_add; // 0x890(0x08)
	struct UREDImage* K_Skill_11; // 0x898(0x08)
	struct UREDImage* K_Skill_12; // 0x8a0(0x08)
	struct UREDImage* K_Skill_13; // 0x8a8(0x08)
	struct UREDImage* K_Skill_14; // 0x8b0(0x08)
	struct UREDImage* K_Skill_15; // 0x8b8(0x08)
	struct UREDImage* K_Skill_16; // 0x8c0(0x08)
	struct UREDImage* K_Skill_17; // 0x8c8(0x08)
	struct UREDImage* K_Skill_18; // 0x8d0(0x08)
	struct UREDImage* K_Skill_19; // 0x8d8(0x08)
	struct UREDImage* K_Skill_20; // 0x8e0(0x08)
	struct UREDImage* K_Skill_21; // 0x8e8(0x08)
	struct UREDImage* K_Skill_22; // 0x8f0(0x08)
	struct UREDImage* K_Skill_23; // 0x8f8(0x08)
	struct UREDImage* K_Skill_24; // 0x900(0x08)
	struct UREDImage* K_Skill_25; // 0x908(0x08)
	struct UREDImage* K_Skill_26; // 0x910(0x08)
	struct UREDImage* K_Skill_27; // 0x918(0x08)
	struct UREDImage* K_Skill_28; // 0x920(0x08)
	struct UREDImage* K_Skill_29; // 0x928(0x08)
	struct UREDImage* K_Skill_30; // 0x930(0x08)
	struct UREDImage* K_Skill_31; // 0x938(0x08)
	struct UREDImage* K_Skill_32; // 0x940(0x08)
	struct UREDImage* K_Skill_33; // 0x948(0x08)
	struct UREDImage* K_Skill_34; // 0x950(0x08)
	struct UREDImage* K_Skill_35; // 0x958(0x08)
	struct UREDImage* K_Skill_36; // 0x960(0x08)
	struct UREDImage* K_Skill_37; // 0x968(0x08)
	struct UREDImage* K_Skill_38; // 0x970(0x08)
	struct UREDImage* K_Skill_39; // 0x978(0x08)
	struct UREDImage* K_Skill_40; // 0x980(0x08)
	struct UREDImage* K_Skill_41; // 0x988(0x08)
	struct UREDImage* K_Skill_42; // 0x990(0x08)
	struct UREDImage* K_Skill_43; // 0x998(0x08)
	struct UREDImage* K_Skill_44; // 0x9a0(0x08)
	struct UREDImage* K_Skill_45; // 0x9a8(0x08)
	struct UREDImage* K_Skill_46; // 0x9b0(0x08)
	struct UREDImage* K_Skill_47; // 0x9b8(0x08)
	struct UREDImage* K_Skill_48; // 0x9c0(0x08)
	struct UREDImage* K_Skill_49; // 0x9c8(0x08)
	struct UREDImage* K_Skill_50; // 0x9d0(0x08)
	struct UREDImage* K_Skill_51; // 0x9d8(0x08)
	struct UREDImage* K_Skill_52; // 0x9e0(0x08)
	struct UREDImage* K_Skill_53; // 0x9e8(0x08)
	struct UREDImage* K_Skill_54; // 0x9f0(0x08)
	struct UREDImage* K_Skill_55; // 0x9f8(0x08)
	struct UREDImage* K_Skill_56; // 0xa00(0x08)
	struct UREDImage* K_Skill_57; // 0xa08(0x08)
	struct UREDImage* K_Skill_58; // 0xa10(0x08)
	struct UREDImage* K_Skill_59; // 0xa18(0x08)
	struct UREDImage* K_Skill_60; // 0xa20(0x08)
	struct UREDImage* K_Skill_61; // 0xa28(0x08)
	struct UREDImage* K_Skill_00; // 0xa30(0x08)
	struct UImage* K_Skill_00_add; // 0xa38(0x08)
	struct UREDImage* K_Skill_01; // 0xa40(0x08)
	struct UImage* K_Skill_01_add; // 0xa48(0x08)
	struct UREDImage* K_Skill_02; // 0xa50(0x08)
	struct UImage* K_Skill_02_add; // 0xa58(0x08)
	struct UREDImage* K_Skill_03; // 0xa60(0x08)
	struct UImage* K_Skill_03_add; // 0xa68(0x08)
	struct UREDImage* K_Skill_04; // 0xa70(0x08)
	struct UImage* K_Skill_04_add; // 0xa78(0x08)
	struct UREDImage* K_Skill_05; // 0xa80(0x08)
	struct UImage* K_Skill_05_add; // 0xa88(0x08)
	struct UREDImage* K_Skill_06; // 0xa90(0x08)
	struct UImage* K_Skill_06_add; // 0xa98(0x08)
	struct UREDImage* K_Skill_07; // 0xaa0(0x08)
	struct UImage* K_Skill_07_add; // 0xaa8(0x08)
	struct UREDImage* K_Skill_08; // 0xab0(0x08)
	struct UImage* K_Skill_08_add; // 0xab8(0x08)
	struct UREDImage* K_Skill_09; // 0xac0(0x08)
	struct UImage* K_Skill_09_add; // 0xac8(0x08)
	struct UREDImage* K_Skill_0A; // 0xad0(0x08)
	struct UREDImage* K_Skill_0B; // 0xad8(0x08)
	struct UREDImage* K_Skill_0C; // 0xae0(0x08)
	struct UREDImage* K_Skill_0D; // 0xae8(0x08)
	struct UREDImage* K_Skill_0E; // 0xaf0(0x08)
	struct UImage* K_Skill_10_add; // 0xaf8(0x08)
	struct UImage* K_Skill_11_add; // 0xb00(0x08)
	struct UImage* K_Skill_12_add; // 0xb08(0x08)
	struct UImage* K_Skill_13_add; // 0xb10(0x08)
	struct UImage* K_Skill_14_add; // 0xb18(0x08)
	struct UImage* K_Skill_15_add; // 0xb20(0x08)
	struct UImage* K_Skill_16_add; // 0xb28(0x08)
	struct UImage* K_Skill_17_add; // 0xb30(0x08)
	struct UImage* K_Skill_18_add; // 0xb38(0x08)
	struct UImage* K_Skill_19_add; // 0xb40(0x08)
	struct UImage* K_Skill_20_add; // 0xb48(0x08)
	struct UImage* K_Skill_21_add; // 0xb50(0x08)
	struct UImage* K_Skill_22_add; // 0xb58(0x08)
	struct UImage* K_Skill_23_add; // 0xb60(0x08)
	struct UImage* K_Skill_24_add; // 0xb68(0x08)
	struct UImage* K_Skill_25_add; // 0xb70(0x08)
	struct UImage* K_Skill_26_add; // 0xb78(0x08)
	struct UImage* K_Skill_27_add; // 0xb80(0x08)
	struct UImage* K_Skill_28_add; // 0xb88(0x08)
	struct UImage* K_Skill_29_add; // 0xb90(0x08)
	struct UImage* K_Skill_30_add; // 0xb98(0x08)
	struct UImage* K_Skill_31_add; // 0xba0(0x08)
	struct UImage* K_Skill_32_add; // 0xba8(0x08)
	struct UImage* K_Skill_33_add; // 0xbb0(0x08)
	struct UImage* K_Skill_34_add; // 0xbb8(0x08)
	struct UImage* K_Skill_35_add; // 0xbc0(0x08)
	struct UImage* K_Skill_36_add; // 0xbc8(0x08)
	struct UImage* K_Skill_37_add; // 0xbd0(0x08)
	struct UImage* K_Skill_38_add; // 0xbd8(0x08)
	struct UImage* K_Skill_39_add; // 0xbe0(0x08)
	struct UImage* K_Skill_40_add; // 0xbe8(0x08)
	struct UImage* K_Skill_41_add; // 0xbf0(0x08)
	struct UImage* K_Skill_42_add; // 0xbf8(0x08)
	struct UImage* K_Skill_43_add; // 0xc00(0x08)
	struct UImage* K_Skill_44_add; // 0xc08(0x08)
	struct UImage* K_Skill_45_add; // 0xc10(0x08)
	struct UImage* K_Skill_46_add; // 0xc18(0x08)
	struct UImage* K_Skill_47_add; // 0xc20(0x08)
	struct UImage* K_Skill_48_add; // 0xc28(0x08)
	struct UImage* K_Skill_49_add; // 0xc30(0x08)
	struct UImage* K_Skill_50_add; // 0xc38(0x08)
	struct UImage* K_Skill_51_add; // 0xc40(0x08)
	struct UImage* K_Skill_52_add; // 0xc48(0x08)
	struct UImage* K_Skill_53_add; // 0xc50(0x08)
	struct UImage* K_Skill_54_add; // 0xc58(0x08)
	struct UImage* K_Skill_55_add; // 0xc60(0x08)
	struct UImage* K_Skill_56_add; // 0xc68(0x08)
	struct UImage* K_Skill_57_add; // 0xc70(0x08)
	struct UImage* K_Skill_58_add; // 0xc78(0x08)
	struct UImage* K_Skill_59_add; // 0xc80(0x08)
	struct UImage* K_Skill_60_add; // 0xc88(0x08)
	struct UWB_ui_BrainMap_LineEffect_2_C* LineEffect2_K; // 0xc90(0x08)
	struct UWB_ui_BrainMap_LineEffect_2_C* LineEffect2_Y; // 0xc98(0x08)
	struct UWB_ui_BrainMap_LineEffect_3_C* LineEffect3_K; // 0xca0(0x08)
	struct UWB_ui_BrainMap_LineEffect_3_C* LineEffect3_Y; // 0xca8(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_K_1; // 0xcb0(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_K_2; // 0xcb8(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_K_3; // 0xcc0(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_K_4; // 0xcc8(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_K_5; // 0xcd0(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_Y_1; // 0xcd8(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_Y_2; // 0xce0(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_Y_3; // 0xce8(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_Y_4; // 0xcf0(0x08)
	struct UWB_ui_BrainMap_LineEffect_1_C* LineEffect_Y_5; // 0xcf8(0x08)
	struct UOverlay* Map_Kasane; // 0xd00(0x08)
	struct UOverlay* Map_Yuito; // 0xd08(0x08)
	struct UOverlay* Overlay_3; // 0xd10(0x08)
	struct UBorder* PG_All_Color; // 0xd18(0x08)
	struct UImage* PG_Cover_Black; // 0xd20(0x08)
	struct UREDRetainerBox* REDRetainerBox_Menu; // 0xd28(0x08)
	struct UWB_ui_BrainMap_SkillEffect_1_C* SkillEffect_K; // 0xd30(0x08)
	struct UWB_ui_BrainMap_SkillEffect_1_C* SkillEffect_Y; // 0xd38(0x08)
	struct UREDTextBlock* Text_Bmap_category_1_K; // 0xd40(0x08)
	struct UREDTextBlock* Text_Bmap_category_1_Y; // 0xd48(0x08)
	struct UREDTextBlock* Text_Bmap_category_2_K; // 0xd50(0x08)
	struct UREDTextBlock* Text_Bmap_category_2_Y; // 0xd58(0x08)
	struct UREDTextBlock* Text_Bmap_category_3_K; // 0xd60(0x08)
	struct UREDTextBlock* Text_Bmap_category_3_Y; // 0xd68(0x08)
	struct UREDTextBlock* Text_Bmap_category_4_K; // 0xd70(0x08)
	struct UREDTextBlock* Text_Bmap_category_4_Y; // 0xd78(0x08)
	struct UREDTextBlock* Text_Bmap_category_5_K; // 0xd80(0x08)
	struct UREDTextBlock* Text_Bmap_category_5_Y; // 0xd88(0x08)
	struct UWB_ui_BrainMap_Info_Parts_1_C* WB_ui_BrainMap_Info_Parts_2; // 0xd90(0x08)
	struct UWB_ui_MainChoice_Parts_1_C* WB_ui_MainChoice_Parts_2; // 0xd98(0x08)
	struct UOverlay* Y_A; // 0xda0(0x08)
	struct UOverlay* Y_E; // 0xda8(0x08)
	struct UImage* Y_Line_11; // 0xdb0(0x08)
	struct UImage* Y_Line_12; // 0xdb8(0x08)
	struct UImage* Y_Line_13; // 0xdc0(0x08)
	struct UImage* Y_Line_14; // 0xdc8(0x08)
	struct UImage* Y_Line_15; // 0xdd0(0x08)
	struct UImage* Y_Line_16; // 0xdd8(0x08)
	struct UImage* Y_Line_17; // 0xde0(0x08)
	struct UImage* Y_Line_18; // 0xde8(0x08)
	struct UImage* Y_Line_19; // 0xdf0(0x08)
	struct UImage* Y_Line_20; // 0xdf8(0x08)
	struct UImage* Y_Line_21; // 0xe00(0x08)
	struct UImage* Y_Line_22; // 0xe08(0x08)
	struct UImage* Y_Line_23; // 0xe10(0x08)
	struct UImage* Y_Line_24; // 0xe18(0x08)
	struct UImage* Y_Line_25; // 0xe20(0x08)
	struct UImage* Y_Line_26; // 0xe28(0x08)
	struct UImage* Y_Line_27; // 0xe30(0x08)
	struct UImage* Y_Line_28; // 0xe38(0x08)
	struct UImage* Y_Line_29; // 0xe40(0x08)
	struct UImage* Y_Line_30; // 0xe48(0x08)
	struct UImage* Y_Line_31; // 0xe50(0x08)
	struct UImage* Y_Line_32; // 0xe58(0x08)
	struct UImage* Y_Line_33; // 0xe60(0x08)
	struct UImage* Y_Line_34; // 0xe68(0x08)
	struct UImage* Y_Line_35; // 0xe70(0x08)
	struct UImage* Y_Line_36; // 0xe78(0x08)
	struct UImage* Y_Line_37; // 0xe80(0x08)
	struct UImage* Y_Line_38; // 0xe88(0x08)
	struct UImage* Y_Line_39; // 0xe90(0x08)
	struct UImage* Y_Line_40; // 0xe98(0x08)
	struct UImage* Y_Line_41; // 0xea0(0x08)
	struct UImage* Y_Line_42; // 0xea8(0x08)
	struct UImage* Y_Line_43; // 0xeb0(0x08)
	struct UImage* Y_Line_44; // 0xeb8(0x08)
	struct UImage* Y_Line_45; // 0xec0(0x08)
	struct UImage* Y_Line_46; // 0xec8(0x08)
	struct UImage* Y_Line_47; // 0xed0(0x08)
	struct UImage* Y_Line_48; // 0xed8(0x08)
	struct UImage* Y_Line_49; // 0xee0(0x08)
	struct UImage* Y_Line_50; // 0xee8(0x08)
	struct UImage* Y_Line_51; // 0xef0(0x08)
	struct UImage* Y_Line_52; // 0xef8(0x08)
	struct UImage* Y_Line_53; // 0xf00(0x08)
	struct UImage* Y_Line_54; // 0xf08(0x08)
	struct UImage* Y_Line_55; // 0xf10(0x08)
	struct UImage* Y_Line_56; // 0xf18(0x08)
	struct UImage* Y_Line_57; // 0xf20(0x08)
	struct UImage* Y_Line_58; // 0xf28(0x08)
	struct UImage* Y_Line_59; // 0xf30(0x08)
	struct UImage* Y_Line_60; // 0xf38(0x08)
	struct UImage* Y_Line_61; // 0xf40(0x08)
	struct UImage* Y_Line_62; // 0xf48(0x08)
	struct UImage* Y_Line_63; // 0xf50(0x08)
	struct UImage* Y_Line_64; // 0xf58(0x08)
	struct UImage* Y_Line_65; // 0xf60(0x08)
	struct UImage* Y_Line_; // 0xf68(0x08)
	struct UImage* Y_Line_00; // 0xf70(0x08)
	struct UImage* Y_Line_00_add; // 0xf78(0x08)
	struct UImage* Y_Line_01; // 0xf80(0x08)
	struct UImage* Y_Line_01_add; // 0xf88(0x08)
	struct UImage* Y_Line_02; // 0xf90(0x08)
	struct UImage* Y_Line_02_add; // 0xf98(0x08)
	struct UImage* Y_Line_03; // 0xfa0(0x08)
	struct UImage* Y_Line_03_add; // 0xfa8(0x08)
	struct UImage* Y_Line_04; // 0xfb0(0x08)
	struct UImage* Y_Line_04_add; // 0xfb8(0x08)
	struct UImage* Y_Line_05; // 0xfc0(0x08)
	struct UImage* Y_Line_05_add; // 0xfc8(0x08)
	struct UImage* Y_Line_06; // 0xfd0(0x08)
	struct UImage* Y_Line_06_add; // 0xfd8(0x08)
	struct UImage* Y_Line_07; // 0xfe0(0x08)
	struct UImage* Y_Line_07_add; // 0xfe8(0x08)
	struct UImage* Y_Line_08; // 0xff0(0x08)
	struct UImage* Y_Line_08_add; // 0xff8(0x08)
	struct UImage* Y_Line_09; // 0x1000(0x08)
	struct UImage* Y_Line_09_add; // 0x1008(0x08)
	struct UImage* Y_Line_10_add; // 0x1010(0x08)
	struct UImage* Y_Line_11_add; // 0x1018(0x08)
	struct UImage* Y_Line_12_add; // 0x1020(0x08)
	struct UImage* Y_Line_13_add; // 0x1028(0x08)
	struct UImage* Y_Line_14_add; // 0x1030(0x08)
	struct UImage* Y_Line_15_add; // 0x1038(0x08)
	struct UImage* Y_Line_16_add; // 0x1040(0x08)
	struct UImage* Y_Line_17_add; // 0x1048(0x08)
	struct UImage* Y_Line_18_add; // 0x1050(0x08)
	struct UImage* Y_Line_19_add; // 0x1058(0x08)
	struct UImage* Y_Line_20_add; // 0x1060(0x08)
	struct UImage* Y_Line_21_add; // 0x1068(0x08)
	struct UImage* Y_Line_22_add; // 0x1070(0x08)
	struct UImage* Y_Line_23_add; // 0x1078(0x08)
	struct UImage* Y_Line_24_add; // 0x1080(0x08)
	struct UImage* Y_Line_25_add; // 0x1088(0x08)
	struct UImage* Y_Line_26_add; // 0x1090(0x08)
	struct UImage* Y_Line_27_add; // 0x1098(0x08)
	struct UImage* Y_Line_28_add; // 0x10a0(0x08)
	struct UImage* Y_Line_29_add; // 0x10a8(0x08)
	struct UImage* Y_Line_30_add; // 0x10b0(0x08)
	struct UImage* Y_Line_31_add; // 0x10b8(0x08)
	struct UImage* Y_Line_32_add; // 0x10c0(0x08)
	struct UImage* Y_Line_33_add; // 0x10c8(0x08)
	struct UImage* Y_Line_34_add; // 0x10d0(0x08)
	struct UImage* Y_Line_35_add; // 0x10d8(0x08)
	struct UImage* Y_Line_36_add; // 0x10e0(0x08)
	struct UImage* Y_Line_37_add; // 0x10e8(0x08)
	struct UImage* Y_Line_38_add; // 0x10f0(0x08)
	struct UImage* Y_Line_39_add; // 0x10f8(0x08)
	struct UImage* Y_Line_40_add; // 0x1100(0x08)
	struct UImage* Y_Line_41_add; // 0x1108(0x08)
	struct UImage* Y_Line_42_add; // 0x1110(0x08)
	struct UImage* Y_Line_43_add; // 0x1118(0x08)
	struct UImage* Y_Line_44_add; // 0x1120(0x08)
	struct UImage* Y_Line_45_add; // 0x1128(0x08)
	struct UImage* Y_Line_46_add; // 0x1130(0x08)
	struct UImage* Y_Line_47_add; // 0x1138(0x08)
	struct UImage* Y_Line_48_add; // 0x1140(0x08)
	struct UImage* Y_Line_49_add; // 0x1148(0x08)
	struct UImage* Y_Line_50_add; // 0x1150(0x08)
	struct UImage* Y_Line_51_add; // 0x1158(0x08)
	struct UImage* Y_Line_52_add; // 0x1160(0x08)
	struct UImage* Y_Line_53_add; // 0x1168(0x08)
	struct UImage* Y_Line_54_add; // 0x1170(0x08)
	struct UImage* Y_Line_55_add; // 0x1178(0x08)
	struct UImage* Y_Line_56_add; // 0x1180(0x08)
	struct UImage* Y_Line_57_add; // 0x1188(0x08)
	struct UImage* Y_Line_58_add; // 0x1190(0x08)
	struct UImage* Y_Line_59_add; // 0x1198(0x08)
	struct UImage* Y_Line_60_add; // 0x11a0(0x08)
	struct UImage* Y_Line_61_add; // 0x11a8(0x08)
	struct UImage* Y_Line_62_add; // 0x11b0(0x08)
	struct UImage* Y_Line_63_add; // 0x11b8(0x08)
	struct UImage* Y_Line_64_add; // 0x11c0(0x08)
	struct UImage* Y_Line_add; // 0x11c8(0x08)
	struct UREDImage* Y_Skill_11; // 0x11d0(0x08)
	struct UREDImage* Y_Skill_12; // 0x11d8(0x08)
	struct UREDImage* Y_Skill_13; // 0x11e0(0x08)
	struct UREDImage* Y_Skill_14; // 0x11e8(0x08)
	struct UREDImage* Y_Skill_15; // 0x11f0(0x08)
	struct UREDImage* Y_Skill_16; // 0x11f8(0x08)
	struct UREDImage* Y_Skill_17; // 0x1200(0x08)
	struct UREDImage* Y_Skill_18; // 0x1208(0x08)
	struct UREDImage* Y_Skill_19; // 0x1210(0x08)
	struct UREDImage* Y_Skill_20; // 0x1218(0x08)
	struct UREDImage* Y_Skill_21; // 0x1220(0x08)
	struct UREDImage* Y_Skill_22; // 0x1228(0x08)
	struct UREDImage* Y_Skill_23; // 0x1230(0x08)
	struct UREDImage* Y_Skill_24; // 0x1238(0x08)
	struct UREDImage* Y_Skill_25; // 0x1240(0x08)
	struct UREDImage* Y_Skill_26; // 0x1248(0x08)
	struct UREDImage* Y_Skill_27; // 0x1250(0x08)
	struct UREDImage* Y_Skill_28; // 0x1258(0x08)
	struct UREDImage* Y_Skill_29; // 0x1260(0x08)
	struct UREDImage* Y_Skill_30; // 0x1268(0x08)
	struct UREDImage* Y_Skill_31; // 0x1270(0x08)
	struct UREDImage* Y_Skill_32; // 0x1278(0x08)
	struct UREDImage* Y_Skill_33; // 0x1280(0x08)
	struct UREDImage* Y_Skill_34; // 0x1288(0x08)
	struct UREDImage* Y_Skill_35; // 0x1290(0x08)
	struct UREDImage* Y_Skill_36; // 0x1298(0x08)
	struct UREDImage* Y_Skill_37; // 0x12a0(0x08)
	struct UREDImage* Y_Skill_38; // 0x12a8(0x08)
	struct UREDImage* Y_Skill_39; // 0x12b0(0x08)
	struct UREDImage* Y_Skill_40; // 0x12b8(0x08)
	struct UREDImage* Y_Skill_41; // 0x12c0(0x08)
	struct UREDImage* Y_Skill_42; // 0x12c8(0x08)
	struct UREDImage* Y_Skill_43; // 0x12d0(0x08)
	struct UREDImage* Y_Skill_44; // 0x12d8(0x08)
	struct UREDImage* Y_Skill_45; // 0x12e0(0x08)
	struct UREDImage* Y_Skill_46; // 0x12e8(0x08)
	struct UREDImage* Y_Skill_47; // 0x12f0(0x08)
	struct UREDImage* Y_Skill_48; // 0x12f8(0x08)
	struct UREDImage* Y_Skill_49; // 0x1300(0x08)
	struct UREDImage* Y_Skill_50; // 0x1308(0x08)
	struct UREDImage* Y_Skill_51; // 0x1310(0x08)
	struct UREDImage* Y_Skill_52; // 0x1318(0x08)
	struct UREDImage* Y_Skill_53; // 0x1320(0x08)
	struct UREDImage* Y_Skill_54; // 0x1328(0x08)
	struct UREDImage* Y_Skill_55; // 0x1330(0x08)
	struct UREDImage* Y_Skill_56; // 0x1338(0x08)
	struct UREDImage* Y_Skill_57; // 0x1340(0x08)
	struct UREDImage* Y_Skill_58; // 0x1348(0x08)
	struct UREDImage* Y_Skill_59; // 0x1350(0x08)
	struct UREDImage* Y_Skill_60; // 0x1358(0x08)
	struct UREDImage* Y_Skill_61; // 0x1360(0x08)
	struct UREDImage* Y_Skill_; // 0x1368(0x08)
	struct UREDImage* Y_Skill_00; // 0x1370(0x08)
	struct UImage* Y_Skill_00_add; // 0x1378(0x08)
	struct UREDImage* Y_Skill_01; // 0x1380(0x08)
	struct UImage* Y_Skill_01_add; // 0x1388(0x08)
	struct UREDImage* Y_Skill_02; // 0x1390(0x08)
	struct UImage* Y_Skill_02_add; // 0x1398(0x08)
	struct UREDImage* Y_Skill_03; // 0x13a0(0x08)
	struct UImage* Y_Skill_03_add; // 0x13a8(0x08)
	struct UREDImage* Y_Skill_04; // 0x13b0(0x08)
	struct UImage* Y_Skill_04_add; // 0x13b8(0x08)
	struct UREDImage* Y_Skill_05; // 0x13c0(0x08)
	struct UImage* Y_Skill_05_add; // 0x13c8(0x08)
	struct UREDImage* Y_Skill_06; // 0x13d0(0x08)
	struct UImage* Y_Skill_06_add; // 0x13d8(0x08)
	struct UREDImage* Y_Skill_07; // 0x13e0(0x08)
	struct UImage* Y_Skill_07_add; // 0x13e8(0x08)
	struct UREDImage* Y_Skill_08; // 0x13f0(0x08)
	struct UImage* Y_Skill_08_add; // 0x13f8(0x08)
	struct UREDImage* Y_Skill_09; // 0x1400(0x08)
	struct UImage* Y_Skill_09_add; // 0x1408(0x08)
	struct UREDImage* Y_Skill_0A; // 0x1410(0x08)
	struct UREDImage* Y_Skill_0B; // 0x1418(0x08)
	struct UREDImage* Y_Skill_0C; // 0x1420(0x08)
	struct UREDImage* Y_Skill_0D; // 0x1428(0x08)
	struct UREDImage* Y_Skill_0E; // 0x1430(0x08)
	struct UImage* Y_Skill_10_add; // 0x1438(0x08)
	struct UImage* Y_Skill_11_add; // 0x1440(0x08)
	struct UImage* Y_Skill_12_add; // 0x1448(0x08)
	struct UImage* Y_Skill_13_add; // 0x1450(0x08)
	struct UImage* Y_Skill_14_add; // 0x1458(0x08)
	struct UImage* Y_Skill_15_add; // 0x1460(0x08)
	struct UImage* Y_Skill_16_add; // 0x1468(0x08)
	struct UImage* Y_Skill_17_add; // 0x1470(0x08)
	struct UImage* Y_Skill_18_add; // 0x1478(0x08)
	struct UImage* Y_Skill_19_add; // 0x1480(0x08)
	struct UImage* Y_Skill_20_add; // 0x1488(0x08)
	struct UImage* Y_Skill_21_add; // 0x1490(0x08)
	struct UImage* Y_Skill_22_add; // 0x1498(0x08)
	struct UImage* Y_Skill_23_add; // 0x14a0(0x08)
	struct UImage* Y_Skill_24_add; // 0x14a8(0x08)
	struct UImage* Y_Skill_25_add; // 0x14b0(0x08)
	struct UImage* Y_Skill_26_add; // 0x14b8(0x08)
	struct UImage* Y_Skill_27_add; // 0x14c0(0x08)
	struct UImage* Y_Skill_28_add; // 0x14c8(0x08)
	struct UImage* Y_Skill_29_add; // 0x14d0(0x08)
	struct UImage* Y_Skill_30_add; // 0x14d8(0x08)
	struct UImage* Y_Skill_31_add; // 0x14e0(0x08)
	struct UImage* Y_Skill_32_add; // 0x14e8(0x08)
	struct UImage* Y_Skill_33_add; // 0x14f0(0x08)
	struct UImage* Y_Skill_34_add; // 0x14f8(0x08)
	struct UImage* Y_Skill_35_add; // 0x1500(0x08)
	struct UImage* Y_Skill_36_add; // 0x1508(0x08)
	struct UImage* Y_Skill_37_add; // 0x1510(0x08)
	struct UImage* Y_Skill_38_add; // 0x1518(0x08)
	struct UImage* Y_Skill_39_add; // 0x1520(0x08)
	struct UImage* Y_Skill_40_add; // 0x1528(0x08)
	struct UImage* Y_Skill_41_add; // 0x1530(0x08)
	struct UImage* Y_Skill_42_add; // 0x1538(0x08)
	struct UImage* Y_Skill_43_add; // 0x1540(0x08)
	struct UImage* Y_Skill_44_add; // 0x1548(0x08)
	struct UImage* Y_Skill_45_add; // 0x1550(0x08)
	struct UImage* Y_Skill_46_add; // 0x1558(0x08)
	struct UImage* Y_Skill_47_add; // 0x1560(0x08)
	struct UImage* Y_Skill_48_add; // 0x1568(0x08)
	struct UImage* Y_Skill_49_add; // 0x1570(0x08)
	struct UImage* Y_Skill_50_add; // 0x1578(0x08)
	struct UImage* Y_Skill_51_add; // 0x1580(0x08)
	struct UImage* Y_Skill_52_add; // 0x1588(0x08)
	struct UImage* Y_Skill_53_add; // 0x1590(0x08)
	struct UImage* Y_Skill_54_add; // 0x1598(0x08)
	struct UImage* Y_Skill_55_add; // 0x15a0(0x08)
	struct UImage* Y_Skill_56_add; // 0x15a8(0x08)
	struct UImage* Y_Skill_57_add; // 0x15b0(0x08)
	struct UImage* Y_Skill_58_add; // 0x15b8(0x08)
	struct UImage* Y_Skill_59_add; // 0x15c0(0x08)
	struct UImage* Y_Skill_60_add; // 0x15c8(0x08)
	struct UImage* Y_Skill_add; // 0x15d0(0x08)
	struct UWB_ui_BrainMap_SkillMap_Parts_2_C* WidgetCursor; // 0x15d8(0x08)
	bool IsContentsChange; // 0x15e0(0x01)
	char pad_15E1[0x7]; // 0x15e1(0x07)
	struct TArray<struct UImage*> SkillList; // 0x15e8(0x10)
	struct TArray<struct UImage*> SkillAddList; // 0x15f8(0x10)
	struct TArray<struct UImage*> LineList; // 0x1608(0x10)
	struct TArray<struct UImage*> LineAddList; // 0x1618(0x10)
	struct TArray<int32_t> SkillStatusList; // 0x1628(0x10)
	float DeltaSecond; // 0x1638(0x04)
	struct FVector2D CursorPos; // 0x163c(0x08)
	int32_t CursorSkillIndex; // 0x1644(0x04)
	int32_t LineEffectNum; // 0x1648(0x04)
	char pad_164C[0x4]; // 0x164c(0x04)
	struct TArray<int32_t> LineEffectIndex; // 0x1650(0x10)
	struct TArray<struct UWB_ui_BrainMap_LineEffect_1_C*> LineEffectList; // 0x1660(0x10)
	struct UWB_ui_BrainMap_LineEffect_2_C* LineEffect2; // 0x1670(0x08)
	struct UWB_ui_BrainMap_LineEffect_3_C* LineEffect3; // 0x1678(0x08)
	bool FlagKasane; // 0x1680(0x01)
	bool FlagUseLineEffect2; // 0x1681(0x01)
	bool FlagEndLineEffect; // 0x1682(0x01)
	bool FlagEndCellEffect; // 0x1683(0x01)
	char pad_1684[0x4]; // 0x1684(0x04)
	struct UWB_ui_BrainMap_SkillEffect_1_C* SkillEffect; // 0x1688(0x08)
	int32_t skillPoint; // 0x1690(0x04)
	int32_t SkillLearnPoint; // 0x1694(0x04)
	bool IsEnd; // 0x1698(0x01)
	bool IsMove; // 0x1699(0x01)
	bool IsCursorCorrect; // 0x169a(0x01)
	char pad_169B[0x1]; // 0x169b(0x01)
	struct FVector2D CorrectPosition; // 0x169c(0x08)
	char pad_16A4[0x4]; // 0x16a4(0x04)
	struct TArray<struct UOverlay*> DriveList; // 0x16a8(0x10)
	struct TArray<struct UOverlay*> BrainFeeldList; // 0x16b8(0x10)
	struct UTextBlock* textHelp; // 0x16c8(0x08)
	struct UWB_ui_Guide_C* GuideWidget; // 0x16d0(0x08)
	struct FVector2D MapBasePosition; // 0x16d8(0x08)
	float Scale; // 0x16e0(0x04)
	struct FVector2D CursorScaleBasePosition; // 0x16e4(0x08)
	char pad_16EC[0x4]; // 0x16ec(0x04)
	struct TArray<struct UUIBase*> DecideEffectList; // 0x16f0(0x10)
	bool FlagSuccess; // 0x1700(0x01)
	char pad_1701[0x7]; // 0x1701(0x07)
	struct URSAtomComponentBase* PushSE; // 0x1708(0x08)
	struct TArray<struct UWB_ui_BrainMap_Bp_1_C*> BPWork; // 0x1710(0x10)
	float CursorSpeed; // 0x1720(0x04)
	float CursorCorrectSpeed; // 0x1724(0x04)
	float CursorCorrectArea; // 0x1728(0x04)
	char pad_172C[0x4]; // 0x172c(0x04)
	struct UREDImage* currentImange; // 0x1730(0x08)
	struct FMulticastInlineDelegate SetPopupMode; // 0x1738(0x10)
	bool FlagKasaneWork; // 0x1748(0x01)
	char pad_1749[0x7]; // 0x1749(0x07)
	struct TArray<struct Fstruct_ui_brainmap_info> TableData; // 0x1750(0x10)
	float CursorLimitYD; // 0x1760(0x04)

	void SetupDefaultParts(); // Function WB_ui_BrainMap_2.WB_ui_BrainMap_1_C.SetupDefaultParts // (Private|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CheckInputMouse(bool IsInput); // Function WB_ui_BrainMap_2.WB_ui_BrainMap_1_C.CheckInputMouse // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	bool IsLineEffectAnimation(); // Function WB_ui_BrainMap_2.WB_ui_BrainMap_1_C.IsLineEffectAnimation // (Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void SetupDebugParam(); // Function WB_ui_BrainMap_2.WB_ui_BrainMap_1_C.SetupDebugParam // (Private|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void GetCursorCorrectArea(float Area); // Function WB_ui_BrainMap_2.WB_ui_BrainMap_1_C.GetCursorCorrectArea // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
