// WidgetBlueprintGeneratedClass WB_ui_Quest_Sub_Parts_2.WB_ui_Quest_Sub_Parts_1_C
// Size: 0x770 (Inherited: 0x510)
struct UWB_ui_Quest_Sub_Parts_1_C : UUIQuestDetailsSub {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x510(0x08)
	struct UBorder* All_Color; // 0x518(0x08)
	struct UImage* Base_List; // 0x520(0x08)
	struct UCanvasPanel* CanvasPanel_ViewRange; // 0x528(0x08)
	struct UImage* Frame_List; // 0x530(0x08)
	struct UImage* Frame_Reward_2; // 0x538(0x08)
	struct UHorizontalBox* HorizontalBox_1; // 0x540(0x08)
	struct UHorizontalBox* HorizontalBox_2; // 0x548(0x08)
	struct UHorizontalBox* HorizontalBox_3; // 0x550(0x08)
	struct UImage* icon_category_2; // 0x558(0x08)
	struct UImage* icon_category_3; // 0x560(0x08)
	struct UImage* icon_category_4; // 0x568(0x08)
	struct UImage* icon_category_5; // 0x570(0x08)
	struct UImage* icon_category_6; // 0x578(0x08)
	struct UImage* icon_category_7; // 0x580(0x08)
	struct UREDImageBase* icon_font_reward1; // 0x588(0x08)
	struct UREDImageBase* icon_font_reward2; // 0x590(0x08)
	struct UREDImageBase* icon_font_reward3; // 0x598(0x08)
	struct UImage* icon_Frame_2; // 0x5a0(0x08)
	struct UImage* icon_Frame_3; // 0x5a8(0x08)
	struct UImage* icon_Frame_4; // 0x5b0(0x08)
	struct UImage* icon_Frame_5; // 0x5b8(0x08)
	struct UImage* icon_Frame_6; // 0x5c0(0x08)
	struct UImage* icon_Frame_7; // 0x5c8(0x08)
	struct UOverlay* icon_set_2; // 0x5d0(0x08)
	struct UOverlay* icon_set_3; // 0x5d8(0x08)
	struct UOverlay* icon_set_4; // 0x5e0(0x08)
	struct UImage* item_icon_frame_2; // 0x5e8(0x08)
	struct UImage* item_icon_frame_3; // 0x5f0(0x08)
	struct UImage* item_icon_frame_4; // 0x5f8(0x08)
	struct UImage* item_icon_frame_5; // 0x600(0x08)
	struct UImage* item_icon_frame_7; // 0x608(0x08)
	struct UImage* item_icon_frame5; // 0x610(0x08)
	struct UImage* line_client; // 0x618(0x08)
	struct UImage* line_location; // 0x620(0x08)
	struct UImage* line_quest; // 0x628(0x08)
	struct UOverlay* List_Set; // 0x630(0x08)
	struct UOverlay* progress_num_set_2; // 0x638(0x08)
	struct UOverlay* progress_num_set_3; // 0x640(0x08)
	struct UOverlay* progress_num_set_4; // 0x648(0x08)
	struct UREDScrollBoxSimple* ScrollBox_0Sub; // 0x650(0x08)
	struct USpacer* SpacerBriefing1; // 0x658(0x08)
	struct USpacer* SpacerBriefing2; // 0x660(0x08)
	struct UImage* Text_Base_2; // 0x668(0x08)
	struct UImage* Text_Base_3; // 0x670(0x08)
	struct UImage* Text_Base_4; // 0x678(0x08)
	struct UImage* Text_Base_5; // 0x680(0x08)
	struct UREDTextBlock* Text_quest_sub_briefing_2; // 0x688(0x08)
	struct UREDTextBlock* Text_quest_sub_briefing_3; // 0x690(0x08)
	struct UREDTextBlock* Text_quest_sub_client_2; // 0x698(0x08)
	struct UREDTextBlock* Text_quest_sub_client_3; // 0x6a0(0x08)
	struct UREDTextBlock* Text_quest_sub_location_2; // 0x6a8(0x08)
	struct UREDTextBlock* Text_quest_sub_location_3; // 0x6b0(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_2; // 0x6b8(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_3; // 0x6c0(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_4; // 0x6c8(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_5; // 0x6d0(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_num_2; // 0x6d8(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_num_3; // 0x6e0(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_num_4; // 0x6e8(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_num_5; // 0x6f0(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_num_6; // 0x6f8(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_num_7; // 0x700(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_slash_2; // 0x708(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_slash_3; // 0x710(0x08)
	struct UREDTextBlock* Text_quest_sub_progress_slash_4; // 0x718(0x08)
	struct UREDTextBlock* Text_quest_sub_reward_2; // 0x720(0x08)
	struct UREDTextBlock* Text_quest_sub_reward_3; // 0x728(0x08)
	struct UREDTextBlock* Text_quest_sub_reward_4; // 0x730(0x08)
	struct UREDTextBlock* Text_quest_sub_reward_5; // 0x738(0x08)
	struct UREDTextBlock* Text_quest_sub_title_2; // 0x740(0x08)
	struct UOverlay* TextSet_reward_2; // 0x748(0x08)
	struct UOverlay* TextSet_reward_3; // 0x750(0x08)
	struct UOverlay* TextSet_reward_4; // 0x758(0x08)
	struct UWB_ui_Quest_Parts_2_C* WB_ui_Quest_icon_2; // 0x760(0x08)
	struct UWB_ui_Quest_Parts_3_C* WB_ui_Quest_Parts_4; // 0x768(0x08)

	void Construct(); // Function WB_ui_Quest_Sub_Parts_2.WB_ui_Quest_Sub_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Quest_Sub_Parts_2.WB_ui_Quest_Sub_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void SetItemRarity(struct UImage* imageRarity, enum class EItemRarity rarity); // Function WB_ui_Quest_Sub_Parts_2.WB_ui_Quest_Sub_Parts_1_C.SetItemRarity // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void SetItemIcon(struct UImage* imageCategory, enum class EItemIcon Category); // Function WB_ui_Quest_Sub_Parts_2.WB_ui_Quest_Sub_Parts_1_C.SetItemIcon // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_Quest_Sub_Parts_2.WB_ui_Quest_Sub_Parts_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Quest_Sub_Parts_2(int32_t EntryPoint); // Function WB_ui_Quest_Sub_Parts_2.WB_ui_Quest_Sub_Parts_1_C.ExecuteUbergraph_WB_ui_Quest_Sub_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

