// WidgetBlueprintGeneratedClass WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C
// Size: 0x6d0 (Inherited: 0x408)
struct UWB_ui_DetailMap_Parts_1_C : UUIDetailMap {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x408(0x08)
	struct UWidgetAnimation* Out; // 0x410(0x08)
	struct UWidgetAnimation* In; // 0x418(0x08)
	struct UWidgetAnimation* default_iconinfo_none; // 0x420(0x08)
	struct UWidgetAnimation* IconInfo_out; // 0x428(0x08)
	struct UWidgetAnimation* IconInfo_in; // 0x430(0x08)
	struct UWidgetAnimation* default_none; // 0x438(0x08)
	struct UWidgetAnimation* Default; // 0x440(0x08)
	struct UBorder* All_Color; // 0x448(0x08)
	struct UImage* Base_Gradation_2; // 0x450(0x08)
	struct UImage* Base_Gradation_3; // 0x458(0x08)
	struct UImage* Base_Gradation_B; // 0x460(0x08)
	struct UImage* Base_Gradation_G; // 0x468(0x08)
	struct UImage* Base_Gradation_light; // 0x470(0x08)
	struct UImage* BG_Grid; // 0x478(0x08)
	struct UImage* BG_None; // 0x480(0x08)
	struct UImage* BG_Shadow; // 0x488(0x08)
	struct UImage* BlackBand_L; // 0x490(0x08)
	struct UImage* BlackBand_R; // 0x498(0x08)
	struct UImage* BlackBand_Un; // 0x4a0(0x08)
	struct UImage* BlackBand_Up; // 0x4a8(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x4b0(0x08)
	struct UImage* Contents_Line; // 0x4b8(0x08)
	struct UImage* Goal_Line_grow; // 0x4c0(0x08)
	struct UImage* Icon; // 0x4c8(0x08)
	struct UImage* Icon_2; // 0x4d0(0x08)
	struct UImage* Icon_base_2; // 0x4d8(0x08)
	struct UImage* icon_Frame; // 0x4e0(0x08)
	struct UImage* icon_Frame_2; // 0x4e8(0x08)
	struct UImage* icon_Frame_3; // 0x4f0(0x08)
	struct UImage* icon_Frame_4; // 0x4f8(0x08)
	struct UImage* icon_frame_6_add; // 0x500(0x08)
	struct UImage* icon_frame_6_add_2; // 0x508(0x08)
	struct UOverlay* icon_kizuna; // 0x510(0x08)
	struct UOverlay* icon_main; // 0x518(0x08)
	struct UImage* IconInfo_frame_2; // 0x520(0x08)
	struct UInvalidationBox* InvalidationBox_1; // 0x528(0x08)
	struct UImage* Line_2; // 0x530(0x08)
	struct UImage* Location_fream; // 0x538(0x08)
	struct UOverlay* Map_Name; // 0x540(0x08)
	struct UImage* Map_Name_Base; // 0x548(0x08)
	struct UImage* Noise_2; // 0x550(0x08)
	struct UImage* noise_all; // 0x558(0x08)
	struct UOverlay* Overlay_1; // 0x560(0x08)
	struct UOverlay* Overlay_2; // 0x568(0x08)
	struct UREDRetainerBox* REDRetainerBox_Menu; // 0x570(0x08)
	struct UOverlay* RT; // 0x578(0x08)
	struct UImage* RT_map; // 0x580(0x08)
	struct UREDTextBlock* Text_DetailMap_AreaName; // 0x588(0x08)
	struct UREDTextBlock* Text_DetailMap_AreaName_2; // 0x590(0x08)
	struct UREDTextBlock* Text_DetailMap_Goal_2; // 0x598(0x08)
	struct UVerticalBox* VerticalBox_1; // 0x5a0(0x08)
	struct UImage* viewer_noise; // 0x5a8(0x08)
	struct UWB_ui_DetailMap_Parts_4_C* WB_ui_Detail_Map_Parts_4_area; // 0x5b0(0x08)
	struct UWB_ui_DetailMap_Parts_4_C* WB_ui_Detail_Map_Parts_4_block; // 0x5b8(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_2; // 0x5c0(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_3; // 0x5c8(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_4; // 0x5d0(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_5; // 0x5d8(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_6; // 0x5e0(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_7; // 0x5e8(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_8; // 0x5f0(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_9; // 0x5f8(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_10; // 0x600(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_11; // 0x608(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_12; // 0x610(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_13; // 0x618(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_14; // 0x620(0x08)
	struct UWB_ui_DetailMap_Parts_2_C* WB_ui_Deteail_Map_Parts_2_15; // 0x628(0x08)
	struct UWB_ui_Guide_C* WB_ui_Guide; // 0x630(0x08)
	struct ABP_ui_Scene_Detailmap_C* SceneMap; // 0x638(0x08)
	struct FName StartAreaName; // 0x640(0x08)
	float DeltaTime; // 0x648(0x04)
	bool infoDispFlag; // 0x64c(0x01)
	char pad_64D[0x3]; // 0x64d(0x03)
	struct TArray<struct UWB_ui_DetailMap_Parts_2_C*> InfoIconList; // 0x650(0x10)
	struct TArray<struct FString> IconNameList; // 0x660(0x10)
	struct TArray<struct FString> IconList; // 0x670(0x10)
	struct FName SceneName; // 0x680(0x08)
	struct FString DebugAreaName; // 0x688(0x10)
	bool Sezoom; // 0x698(0x01)
	bool SeLocation; // 0x699(0x01)
	bool SeRotate; // 0x69a(0x01)
	char pad_69B[0x1]; // 0x69b(0x01)
	struct FVector2D MouseRotation; // 0x69c(0x08)
	struct FVector2D MouseLocation; // 0x6a4(0x08)
	bool SeRotate_mouse; // 0x6ac(0x01)
	bool SeLocation_mouse; // 0x6ad(0x01)
	bool Sezoom_mouse; // 0x6ae(0x01)
	bool SezoomOut; // 0x6af(0x01)
	bool Sezoom_mouse_Out; // 0x6b0(0x01)
	char pad_6B1[0x7]; // 0x6b1(0x07)
	struct TArray<struct UWB_ui_DetailMap_Parts_4_C*> AreaBlockArray; // 0x6b8(0x10)
	int32_t AreaNo; // 0x6c8(0x04)
	int32_t BlockNo; // 0x6cc(0x04)

	void InitializeAreaBlock(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.InitializeAreaBlock // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void isWorldMap(bool isWorld); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.isWorldMap // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1685580
	void PlayAreaL(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayAreaL // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PlayAreaR(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayAreaR // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PlayBlockL(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayBlockL // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PlayBlockR(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayBlockR // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void FixGuideText(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.FixGuideText // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool InitializeDataDetailMap(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.InitializeDataDetailMap // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool TextFixDataDetailMap(int32_t LocationNo); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.TextFixDataDetailMap // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool CreateDetailMap(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.CreateDetailMap // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ReleaseDetailMap(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.ReleaseDetailMap // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	bool ControlDetailMap(int32_t SubState); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.ControlDetailMap // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateFloorText(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.UpdateFloorText // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void SetupDetaileIconInfo(bool Draw); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.SetupDetaileIconInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void UpdateText(int32_t LocationNo, int32_t AreaNo); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.UpdateText // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void CameraReset(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.CameraReset // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void Construct(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void Destruct(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void PlayAreaLMouse(struct FRedMouseArgument argument, struct UObject* pWidget); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayAreaLMouse // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PlayAreaRMouse(struct FRedMouseArgument argument, struct UObject* pWidget); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayAreaRMouse // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PlayBlockLMouse(struct FRedMouseArgument argument, struct UObject* pWidget); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayBlockLMouse // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void PlayBlockRMouse(struct FRedMouseArgument argument, struct UObject* pWidget); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.PlayBlockRMouse // (BlueprintCallable|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_DetailMap_Parts_2(int32_t EntryPoint); // Function WB_ui_DetailMap_Parts_2.WB_ui_DetailMap_Parts_1_C.ExecuteUbergraph_WB_ui_DetailMap_Parts_2 // (Final|UbergraphFunction|HasDefaults) // @ game+0x1685580
};

