// WidgetBlueprintGeneratedClass WB_ui_Gold_Parts_2.WB_ui_Gold_Parts_1_C
// Size: 0x420 (Inherited: 0x3d0)
struct UWB_ui_Gold_Parts_1_C : UUIShopPayment {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3d0(0x08)
	struct UWidgetAnimation* Default_4; // 0x3d8(0x08)
	struct UWidgetAnimation* Default_3; // 0x3e0(0x08)
	struct UWidgetAnimation* Default; // 0x3e8(0x08)
	struct UREDTextBlock* Text_shop_gold_2; // 0x3f0(0x08)
	struct UREDTextBlock* Text_shop_gold_3; // 0x3f8(0x08)
	struct UREDTextBlock* Text_shop_gold_4; // 0x400(0x08)
	struct UREDTextBlock* Text_shop_gold_1_num; // 0x408(0x08)
	struct UREDTextBlock* Text_shop_gold_2_num; // 0x410(0x08)
	struct UREDTextBlock* Text_shop_gold_3_num; // 0x418(0x08)

	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Gold_Parts_2.WB_ui_Gold_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_Gold_Parts_2.WB_ui_Gold_Parts_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Gold_Parts_2(int32_t EntryPoint); // Function WB_ui_Gold_Parts_2.WB_ui_Gold_Parts_1_C.ExecuteUbergraph_WB_ui_Gold_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

