// WidgetBlueprintGeneratedClass WB_ui_Enemy_Info_Parts_2.WB_ui_Enemy_Info_Parts_1_C
// Size: 0x530 (Inherited: 0x428)
struct UWB_ui_Enemy_Info_Parts_1_C : UUIEnemyInfoWindow {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x428(0x08)
	struct UWidgetAnimation* change_2_2; // 0x430(0x08)
	struct UWidgetAnimation* change_1_3; // 0x438(0x08)
	struct UWidgetAnimation* Default_3; // 0x440(0x08)
	struct UWidgetAnimation* Default_2; // 0x448(0x08)
	struct UBorder* All_Color; // 0x450(0x08)
	struct UImage* Base_Info; // 0x458(0x08)
	struct UImage* Base_Info_Frame; // 0x460(0x08)
	struct UCanvasPanel* CanvasPanel_ViewRange_2; // 0x468(0x08)
	struct UCanvasPanel* CanvasPanel_ViewRange_3; // 0x470(0x08)
	struct UImage* Frame_Location; // 0x478(0x08)
	struct UREDImageBase* icon_font; // 0x480(0x08)
	struct UOverlay* List_Set; // 0x488(0x08)
	struct UOverlay* Overlay_Details; // 0x490(0x08)
	struct UREDScrollBoxSimple* REDScrollBoxSimple_Details2; // 0x498(0x08)
	struct UREDScrollBoxSimple* REDScrollBoxSimple_Detals1; // 0x4a0(0x08)
	struct UREDTextBlock* Text_enemy_habitat_2; // 0x4a8(0x08)
	struct UREDTextBlock* Text_enemy_habitat_3; // 0x4b0(0x08)
	struct UREDTextBlock* Text_enemy_info_2; // 0x4b8(0x08)
	struct UREDTextBlock* Text_enemy_info_3; // 0x4c0(0x08)
	struct UREDTextBlock* Text_enemy_item_2; // 0x4c8(0x08)
	struct UREDTextBlock* Text_enemy_name_2; // 0x4d0(0x08)
	struct UImage* Text_icon_2; // 0x4d8(0x08)
	struct UImage* Text_icon_3; // 0x4e0(0x08)
	struct UImage* Text_icon_4; // 0x4e8(0x08)
	struct UImage* Thubnail_Shade; // 0x4f0(0x08)
	struct UImage* Thumbnail_Enemy_M; // 0x4f8(0x08)
	struct UImage* Thumbnail_Frame; // 0x500(0x08)
	struct UImage* Thumbnail_Noise; // 0x508(0x08)
	struct UREDOverlay* Thumbnail_Set; // 0x510(0x08)
	struct UVerticalBox* VerticalBox_DropItem; // 0x518(0x08)
	struct UVerticalBox* VerticalBox_Habitat; // 0x520(0x08)
	struct UWB_ui_Enemy_Info_Parts_2_C* WB_ui_Enemy_Info_Parts_3; // 0x528(0x08)

	void Construct(); // Function WB_ui_Enemy_Info_Parts_2.WB_ui_Enemy_Info_Parts_1_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void UpdateState(int32_t State, int32_t SubState, float DeltaSeconds); // Function WB_ui_Enemy_Info_Parts_2.WB_ui_Enemy_Info_Parts_1_C.UpdateState // (Event|Public|BlueprintEvent) // @ game+0x1685580
	void PreConstruct(bool IsDesignTime); // Function WB_ui_Enemy_Info_Parts_2.WB_ui_Enemy_Info_Parts_1_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void OnInitialized(); // Function WB_ui_Enemy_Info_Parts_2.WB_ui_Enemy_Info_Parts_1_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1685580
	void ExecuteUbergraph_WB_ui_Enemy_Info_Parts_2(int32_t EntryPoint); // Function WB_ui_Enemy_Info_Parts_2.WB_ui_Enemy_Info_Parts_1_C.ExecuteUbergraph_WB_ui_Enemy_Info_Parts_2 // (Final|UbergraphFunction) // @ game+0x1685580
};

