// UserDefinedStruct WeakObjectRecommendEnemy.WeakObjectRecommendEnemy
// Size: 0x2c (Inherited: 0x00)
struct FWeakObjectRecommendEnemy {
	enum class PsychicGrabButtonType ObjectType_10_CE8A4C244BBD8863A7E283AE9E9F68C4; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Distance_11_4799AB1C47489058BF4D3AB64ED22FBF; // 0x04(0x04)
	float Angle_12_04A3732546917E43B65CABA903984528; // 0x08(0x04)
	float RotationZ_13_868638D5487C566F44EF6A9C25F2A3E4; // 0x0c(0x04)
	struct FVector Offset_16_92864CD84EB56482AA494A94F4B10D58; // 0x10(0x0c)
	struct FName BoneName_19_5D89C8924A7BDB8358E7529684183F1F; // 0x1c(0x08)
	struct FName WeakBoneName_24_8F00EA184A72D806BB7F90A0AEF23F5F; // 0x24(0x08)
};

